{
  "meta": {
    "version": "1.0",
    "month": 8,
    "month_name": "august",
    "year": 2025,
    "total_days": 31
  },
  "daily_readings": {
    "2025-08-01": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.911Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-01": {
          "date": "2025-08-01",
          "liturgical_date": "Memorial of Saint Alphonsus Liguori, Bishop and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Leviticus 23:1, 4-11, 15-16, 27, 34b-37",
              "content": "The LORD said to Moses,\n\"These are the festivals of the LORD which you shall celebrate\nat their proper time with a sacred assembly.\nThe Passover of the LORD falls on the fourteenth day of the first month,\nat the evening twilight.\nThe fifteenth day of this month is the LORD's feast of Unleavened Bread.\nFor seven days you shall eat unleavened bread.\nOn the first of these days you shall hold a sacred assembly\nand do no sort of work.\nOn each of the seven days you shall offer an oblation to the LORD.\nThen on the seventh day you shall again hold a sacred assembly\nand do no sort of work.\"\n\nThe LORD said to Moses, \"Speak to the children of Israel and tell them:\nWhen you come into the land which I am giving you,\nand reap your harvest,\nyou shall bring a sheaf of the first fruits of your harvest\nto the priest, who shall wave the sheaf before the LORD\nthat it may be acceptable for you.\nOn the day after the sabbath the priest shall do this.\n\n\"Beginning with the day after the sabbath,\nthe day on which you bring the wave-offering sheaf,\nyou shall count seven full weeks,\nand then on the day after the seventh week, the fiftieth day,\nyou shall present the new cereal offering to the LORD.\n\n\"The tenth of this seventh month is the Day of Atonement,\nwhen you shall hold a sacred assembly and mortify yourselves\nand offer an oblation to the LORD.\n\n\"The fifteenth day of this seventh month is the LORD's feast of Booths,\nwhich shall continue for seven days.\nOn the first day there shall be a sacred assembly,\nand you shall do no sort of work.\nFor seven days you shall offer an oblation to the LORD,\nand on the eighth day you shall again hold a sacred assembly\nand offer an oblation to the LORD.\nOn that solemn closing you shall do no sort of work.\n\n\"These, therefore, are the festivals of the LORD\non which you shall proclaim a sacred assembly,\nand offer as an oblation to the LORD burnt offerings and cereal offerings,\nsacrifices and libations, as prescribed for each day.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 81:3-4, 5-6, 10-11ab",
              "response": "R. (2a) Sing with joy to God our help.",
              "content": "Take up a melody, and sound the timbrel,\n\nthe pleasant harp and the lyre.\n\nBlow the trumpet at the new moon,\n\nat the full moon, on our solemn feast.\n\nR. Sing with joy to God our help.\n\nFor it is a statute in Israel,\n\nan ordinance of the God of Jacob,\n\nWho made it a decree for Joseph\n\nwhen he came forth from the land of Egypt.\n\nR. Sing with joy to God our help.\n\nThere shall be no strange god among you\n\nnor shall you worship any alien god.\n\nI, the LORD, am your God\n\nwho led you forth from the land of Egypt.\n\nR. Sing with joy to God our help."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe word of the Lord remains forever;\nthis is the word that has been proclaimed to you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:54-58",
              "content": "Jesus came to his native place and taught the people in their synagogue.\nThey were astonished and said,\n\"Where did this man get such wisdom and mighty deeds?\nIs he not the carpenter's son?\nIs not his mother named Mary\nand his brothers James, Joseph, Simon, and Judas?\nAre not his sisters all with us?\nWhere did this man get all this?\"\nAnd they took offense at him.\nBut Jesus said to them,\n\"A prophet is not without honor except in his native place\nand in his own house.\"\nAnd he did not work many mighty deeds there\nbecause of their lack of faith."
            }
          },
          "saint_of_day": {
            "name": "Alphonsus Liguori",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-02": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.964Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-02": {
          "date": "2025-08-02",
          "liturgical_date": "Saturday of the Seventeenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Leviticus 25:1, 8-17",
              "content": "The LORD said to Moses on Mount Sinai,\n\"Seven weeks of years shall you count–seven times seven years–\nso that the seven cycles amount to forty-nine years.\nThen, on the tenth day of the seventh month, let the trumpet resound;\non this, the Day of Atonement, the trumpet blast shall re-echo\nthroughout your land.\nThis fiftieth year you shall make sacred\nby proclaiming liberty in the land for all its inhabitants.\nIt shall be a jubilee for you,\nwhen every one of you shall return to his own property,\nevery one to his own family estate.\nIn this fiftieth year, your year of jubilee,\nyou shall not sow, nor shall you reap the aftergrowth\nor pick the grapes from the untrimmed vines.\nSince this is the jubilee, which shall be sacred for you,\nyou may not eat of its produce,\nexcept as taken directly from the field.\n\n\"In this year of jubilee, then,\nevery one of you shall return to his own property.\nTherefore, when you sell any land to your neighbor\nor buy any from him, do not deal unfairly.\nOn the basis of the number of years since the last jubilee\nshall you purchase the land from your neighbor;\nand so also, on the basis of the number of years for crops,\nshall he sell it to you.\nWhen the years are many, the price shall be so much the more;\nwhen the years are few, the price shall be so much the less.\nFor it is really the number of crops that he sells you.\nDo not deal unfairly, then; but stand in fear of your God.\nI, the LORD, am your God.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 67:2-3, 5, 7-8",
              "response": "R. (4) O God, let all the nations praise you!",
              "content": "May God have pity on us and bless us;\n\nmay he let his face shine upon us.\n\nSo may your way be known upon earth;\n\namong all nations, your salvation.\n\nR. O God, let all the nations praise you!\n\nMay the nations be glad and exult\n\nbecause you rule the peoples in equity;\n\nthe nations on the earth you guide.\n\nR. O God, let all the nations praise you!\n\nThe earth has yielded its fruits;\n\nGod, our God, has blessed us.\n\nMay God bless us,\n\nand may all the ends of the earth fear him!\n\nR. O God, let all the nations praise you!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who are persecuted for the sake of righteousness\nfor theirs is the Kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 14:1-12",
              "content": "Herod the tetrarch heard of the reputation of Jesus\nand said to his servants, \"This man is John the Baptist.\nHe has been raised from the dead;\nthat is why mighty powers are at work in him.\"\n\nNow Herod had arrested John, bound him, and put him in prison\non account of Herodias, the wife of his brother Philip,\nfor John had said to him,\n\"It is not lawful for you to have her.\"\nAlthough he wanted to kill him, he feared the people,\nfor they regarded him as a prophet.\nBut at a birthday celebration for Herod,\nthe daughter of Herodias performed a dance before the guests\nand delighted Herod so much\nthat he swore to give her whatever she might ask for.\nPrompted by her mother, she said,\n\"Give me here on a platter the head of John the Baptist.\"\nThe king was distressed,\nbut because of his oaths and the guests who were present,\nhe ordered that it be given, and he had John beheaded in the prison.\nHis head was brought in on a platter and given to the girl,\nwho took it to her mother.\nHis disciples came and took away the corpse\nand buried him; and they went and told Jesus."
            }
          },
          "saint_of_day": {
            "name": "Optional Memorial of Saint Eusebius of Vercelli, Bishop",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-03": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.967Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-03": {
          "date": "2025-08-03",
          "liturgical_date": "Eighteenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ecclesiastes 1:2; 2:21-23",
              "content": "Vanity of vanities, says Qoheleth,\nvanity of vanities!  All things are vanity!\n\nHere is one who has labored with wisdom and knowledge and skill,\nand yet to another who has not labored over it,\nhe must leave property.\nThis also is vanity and a great misfortune.\nFor what profit comes to man from all the toil and anxiety of heart\nwith which he has labored under the sun?\nAll his days sorrow and grief are his occupation;\neven at night his mind is not at rest.\nThis also is vanity."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 90:3-4, 5-6, 12-13, 14 and 17",
              "response": "R. (1) If today you hear his voice, harden not your hearts.",
              "content": "You turn man back to dust,\n\nsaying, “Return, O children of men.”\n\nFor a thousand years in your sight\n\nare as yesterday, now that it is past,\n\nor as a watch of the night.\n\nR. If today you hear his voice, harden not your hearts.\n\nYou make an end of them in their sleep;\n\nthe next morning they are like the changing grass,\n\nWhich at dawn springs up anew,\n\nbut by evening wilts and fades.\n\nR. If today you hear his voice, harden not your hearts.\n\nTeach us to number our days aright,\n\nthat we may gain wisdom of heart.\n\nReturn, O LORD! How long?\n\nHave pity on your servants!\n\nR. If today you hear his voice, harden not your hearts.\n\nFill us at daybreak with your kindness,\n\nthat we may shout for joy and gladness all our days.\n\nAnd may the gracious care of the LORD our God be ours;\n\nprosper the work of our hands for us!\n\nProsper the work of our hands!\n\nR. If today you hear his voice, harden not your hearts."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are the poor in spirit,\nfor theirs is the kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 12:13-21",
              "content": "Someone in the crowd said to Jesus,\n“Teacher, tell my brother to share the inheritance with me.”\nHe replied to him,\n“Friend, who appointed me as your judge and arbitrator?”\nThen he said to the crowd,\n“Take care to guard against all greed,\nfor though one may be rich,\none’s life does not consist of possessions.”\n\nThen he told them a parable.\n“There was a rich man whose land produced a bountiful harvest.\nHe asked himself, ‘What shall I do,\nfor I do not have space to store my harvest?’\nAnd he said, ‘This is what I shall do:\nI shall tear down my barns and build larger ones.\nThere I shall store all my grain and other goods\nand I shall say to myself, “Now as for you,\nyou have so many good things stored up for many years,\nrest, eat, drink, be merry!”’\nBut God said to him,\n‘You fool, this night your life will be demanded of you;\nand the things you have prepared, to whom will they belong?’\nThus will it be for all who store up treasure for themselves\nbut are not rich in what matters to God.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-04": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.966Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-04": {
          "date": "2025-08-04",
          "liturgical_date": "Memorial of Saint John Vianney, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Numbers 11:4b-15",
              "content": "The children of Israel lamented,\n\"Would that we had meat for food!\nWe remember the fish we used to eat without cost in Egypt,\nand the cucumbers, the melons, the leeks,\nthe onions, and the garlic.\nBut now we are famished;\nwe see nothing before us but this manna.\"\n\nManna was like coriander seed and had the color of resin.\nWhen they had gone about and gathered it up,\nthe people would grind it between millstones or pound it in a mortar,\nthen cook it in a pot and make it into loaves,\nwhich tasted like cakes made with oil.\nAt night, when the dew fell upon the camp, the manna also fell.\n\nWhen Moses heard the people, family after family,\ncrying at the entrance of their tents,\nso that the LORD became very angry, he was grieved.\n\"Why do you treat your servant so badly?\" Moses asked the LORD.\n\"Why are you so displeased with me\nthat you burden me with all this people?\nWas it I who conceived all this people?\nOr was it I who gave them birth,\nthat you tell me to carry them at my bosom,\nlike a foster father carrying an infant,\nto the land you have promised under oath to their fathers?\nWhere can I get meat to give to all this people?\nFor they are crying to me,\n'Give us meat for our food.'\nI cannot carry all this people by myself,\nfor they are too heavy for me.\nIf this is the way you will deal with me,\nthen please do me the favor of killing me at once,\nso that I need no longer face this distress.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 81:12-13, 14-15, 16-17",
              "response": "R. (2a) Sing with joy to God our help.",
              "content": "\"My people heard not my voice,\n\nand Israel obeyed me not;\n\nSo I gave them up to the hardness of their hearts;\n\nthey walked according to their own counsels.\"\n\nR. Sing with joy to God our help.\n\n\"If only my people would hear me,\n\nand Israel walk in my ways,\n\nQuickly would I humble their enemies;\n\nagainst their foes I would turn my hand.\"\n\nR. Sing with joy to God our help.\n\n\"Those who hated the LORD would seek to flatter me,\n\nbut their fate would endure forever,\n\nWhile Israel I would feed with the best of wheat,\n\nand with honey from the rock I would fill them.\"\n\nR. Sing with joy to God our help."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOne does not live on bread alone,\nbut on every word that comes forth from the mouth of God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 14:13-21",
              "content": "When Jesus heard of the death of John the Baptist,\nhe withdrew in a boat to a deserted place by himself.\nThe crowds heard of this and followed him on foot from their towns.\nWhen he disembarked and saw the vast crowd,\nhis heart was moved with pity for them, and he cured their sick.\nWhen it was evening, the disciples approached him and said,\n\"This is a deserted place and it is already late;\ndismiss the crowds so that they can go to the villages\nand buy food for themselves.\"\nHe said to them, \"There is no need for them to go away;\ngive them some food yourselves.\"\nBut they said to him,\n\"Five loaves and two fish are all we have here.\"\nThen he said, \"Bring them here to me,\"\nand he ordered the crowds to sit down on the grass.\nTaking the five loaves and the two fish, and looking up to heaven,\nhe said the blessing, broke the loaves,\nand gave them to the disciples,\nwho in turn gave them to the crowds.\nThey all ate and were satisfied,\nand they picked up the fragments left over–\ntwelve wicker baskets full.\nThose who ate were about five thousand men,\nnot counting women and children."
            }
          },
          "saint_of_day": {
            "name": "Memorial of Saint John Vianney, Priest",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-05": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.968Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-05": {
          "date": "2025-08-05",
          "liturgical_date": "Tuesday of the Eighteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 51:3-4, 5-6ab, 6cd-7, 12-13",
              "response": "R. (see 3a) Be merciful, O Lord, for we have sinned.",
              "content": "Have mercy on me, O God, in your goodness;\n\nin the greatness of your compassion wipe out my offense.\n\nThoroughly wash me from my guilt\n\nand of my sin cleanse me.\n\nR. Be merciful, O Lord, for we have sinned.\n\nFor I acknowledge my offense;\n\nand my sin is before me always:\n\n“Against you only have I sinned;\n\nand done what is evil in your sight.”\n\nR. Be merciful, O Lord, for we have sinned.\n\nThat you may be justified in your sentence,\n\nvindicated when you condemn.\n\nIndeed, in guilt was I born,\n\nand in sin my mother conceived me.\n\nR. Be merciful, O Lord, for we have sinned.\n\nA clean heart create for me, O God,\n\nand a steadfast spirit renew within me.\n\nCast me not off from your presence,\n\nand your Holy Spirit take not from me.\n\nR. Be merciful, O Lord, for we have sinned."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nRabbi, you are the Son of God;\nyou are the King of Israel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 14:22-36",
              "content": "Jesus made the disciples get into a boat\nand precede him to the other side of the sea,\nwhile he dismissed the crowds.\nAfter doing so, he went up on the mountain by himself to pray.\nWhen it was evening he was there alone.\nMeanwhile the boat, already a few miles offshore,\nwas being tossed about by the waves, for the wind was against it.\nDuring the fourth watch of the night,\nhe came toward them, walking on the sea.\nWhen the disciples saw him walking on the sea they were terrified.\n“It is a ghost,” they said, and they cried out in fear.\nAt once Jesus spoke to them, “Take courage, it is I; do not be afraid.”\nPeter said to him in reply,\n“Lord, if it is you, command me to come to you on the water.”\nHe said, “Come.”\nPeter got out of the boat and began to walk on the water toward Jesus.\nBut when he saw how strong the wind was he became frightened;\nand, beginning to sink, he cried out, “Lord, save me!”\nImmediately Jesus stretched out his hand and caught him,\nand said to him, “O you of little faith, why did you doubt?”\nAfter they got into the boat, the wind died down.\nThose who were in the boat did him homage, saying,\n“Truly, you are the Son of God.”\n\nAfter making the crossing, they came to land at Gennesaret.\nWhen the men of that place recognized him,\nthey sent word to all the surrounding country.\nPeople brought to him all those who were sick\nand begged him that they might touch only the tassel on his cloak,\nand as many as touched it were healed.\n\nThe following text may be substituted, \n    especially in Year A when the above Gospel is read on Monday:\n\nMatthew 15:1-2, 10-14\n\nSome Pharisees and scribes came to Jesus from Jerusalem and said,\n“Why do your disciples break the tradition of the elders?\nThey do not wash their hands when they eat a meal.”\nHe summoned the crowd and said to them, “Hear and understand.\nIt is not what enters one’s mouth that defiles the man;\nbut what comes out of the mouth is what defiles one.”\nThen his disciples approached and said to him,\n“Do you know that the Pharisees took offense\nwhen they heard what you said?”\nHe said in reply, “Every plant that my heavenly Father has not planted\nwill be uprooted.\nLet them alone; they are blind guides of the blind.\nIf a blind man leads a blind man,\nboth will fall into a pit.”"
            }
          },
          "saint_of_day": {
            "name": "Dedication Basilica Mary Major",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-06": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.255Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-06": {
          "date": "2025-08-06",
          "liturgical_date": "Feast of the Transfiguration of the Lord",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Daniel 7:9-10, 13-14",
              "content": "As I watched:Thrones were set upand the Ancient One took his throne.His clothing was bright as snow,and the hair on his head as white as wool;his throne was flames of fire,with wheels of burning fire.A surging stream of fireflowed out from where he sat;Thousands upon thousands were ministering to him,and myriads upon myriads attended him.The court was convened and the books were opened.As the visions during the night continued, I saw:One like a Son of man coming,on the clouds of heaven;When he reached the Ancient Oneand was presented before him,The one like a Son of man received dominion, glory, and kingship;all peoples, nations, and languages serve him.His dominion is an everlasting dominionthat shall not be taken away,his kingship shall not be destroyed."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 97:1-2, 5-6, 9",
              "response": "R.(1a and 9a) The Lord is king, the Most High over all the earth.",
              "content": "The LORD is king; let the earth rejoice;\n\nlet the many islands be glad.\n\nClouds and darkness are round about him,\n\njustice and judgment are the foundation of his throne.\n\nR. The Lord is king, the Most High over all the earth.\n\nThe mountains melt like wax before the LORD,\n\nbefore the LORD of all the earth.\n\nThe heavens proclaim his justice,\n\nand all peoples see his glory.\n\nR. The Lord is king, the Most High over all the earth.\n\nBecause you, O LORD, are the Most High over all the earth,\n\nexalted far above all gods.\n\nR. The Lord is king, the Most High over all the earth."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThis is my beloved Son, with whom I am well-pleased;\nlisten to him.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:28b-36",
              "content": "Jesus took Peter, John, and James \nand went up a mountain to pray.\nWhile he was praying his face changed in appearance \nand his clothing became dazzling white.\nAnd behold, two men were conversing with him, Moses and Elijah, \nwho appeared in glory and spoke of his exodus \nthat he was going to accomplish in Jerusalem.\nPeter and his companions had been overcome by sleep, \nbut becoming fully awake, \nthey saw his glory and the two men standing with him.\nAs they were about to part from him, Peter said to Jesus, \n“Master, it is good that we are here;\nlet us make three tents,\none for you, one for Moses, and one for Elijah.”\nBut he did not know what he was saying.\nWhile he was still speaking, \na cloud came and cast a shadow over them,\nand they became frightened when they entered the cloud.\nThen from the cloud came a voice that said, \n“This is my chosen Son; listen to him.”\nAfter the voice had spoken, Jesus was found alone.\nThey fell silent and did not at that time \ntell anyone what they had seen."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-07": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.984Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-07": {
          "date": "2025-08-07",
          "liturgical_date": "Thursday of the Eighteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 95:1-2, 6-7, 8-9",
              "response": "R.    (8)  If today you hear his voice, harden not your hearts.",
              "content": "Come, let us sing joyfully to the LORD;\n\nlet us acclaim the Rock of our salvation.\n\nLet us come into his presence with thanksgiving;\n\nlet us joyfully sing psalms to him.\n\nR.    If today you hear his voice, harden not your hearts.\n\nCome, let us bow down in worship;\n\nlet us kneel before the LORD who made us.\n\nFor he is our God,\n\nand we are the people he shepherds, the flock he guides.\n\nR.    If today you hear his voice, harden not your hearts.\n\nOh, that today you would hear his voice:\n\n“Harden not your hearts as at Meribah,\n\nas in the day of Massah in the desert,\n\nWhere your fathers tested me;\n\nthey tested me though they had seen my works.”\n\nR.    If today you hear his voice, harden not your hearts."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYou are Peter, and upon this rock I will build my Church,\nand the gates of the netherworld shall not prevail against it.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 16:13-23",
              "content": "Jesus went into the region of Caesarea Philippi\nand he asked his disciples,\n“Who do people say that the Son of Man is?”\nThey replied, “Some say John the Baptist, others Elijah,\nstill others Jeremiah or one of the prophets.”\nHe said to them, “But who do you say that I am?”\nSimon Peter said in reply,\n“You are the Christ, the Son of the living God.”\nJesus said to him in reply, “Blessed are you, Simon son of Jonah.\nFor flesh and blood has not revealed this to you, but my heavenly Father.\nAnd so I say to you, you are Peter,\nand upon this rock I will build my Church,\nand the gates of the netherworld shall not prevail against it.\nI will give you the keys to the Kingdom of heaven.\nWhatever you bind on earth shall be bound in heaven;\nand whatever you loose on earth shall be loosed in heaven.”\n\nThen he strictly ordered his disciples\nto tell no one that he was the Christ.\n\nFrom that time on, Jesus began to show his disciples\nthat he must go to Jerusalem and suffer greatly\nfrom the elders, the chief priests, and the scribes,\nand be killed and on the third day be raised.\nThen Peter took Jesus aside and began to rebuke him,\n“God forbid, Lord!  No such thing shall ever happen to you.”\nHe turned and said to Peter,\n“Get behind me, Satan!  You are an obstacle to me.\nYou are thinking not as God does, but as human beings do.”"
            }
          },
          "saint_of_day": {
            "name": "Cajetan",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-08": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.984Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-08": {
          "date": "2025-08-08",
          "liturgical_date": "Memorial of Saint Dominic, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 4:32-40",
              "content": "Moses said to the people:\n\"Ask now of the days of old, before your time,\never since God created man upon the earth;\nask from one end of the sky to the other:\nDid anything so great ever happen before?\nWas it ever heard of?\nDid a people ever hear the voice of God\nspeaking from the midst of fire, as you did, and live?\nOr did any god venture to go and take a nation for himself\nfrom the midst of another nation,\nby testings, by signs and wonders, by war,\nwith his strong hand and outstretched arm, and by great terrors,\nall of which the LORD, your God,\ndid for you in Egypt before your very eyes?\nAll this you were allowed to see\nthat you might know the LORD is God and there is no other.\nOut of the heavens he let you hear his voice to discipline you;\non earth he let you see his great fire,\nand you heard him speaking out of the fire.\nFor love of your fathers he chose their descendants\nand personally led you out of Egypt by his great power,\ndriving out of your way nations greater and mightier than you,\nso as to bring you in\nand to make their land your heritage, as it is today.\nThis is why you must now know, and fix in your heart,\nthat the LORD is God in the heavens above and on earth below,\nand that there is no other.\nYou must keep his statutes and commandments which I enjoin on you today,\nthat you and your children after you may prosper,\nand that you may have long life on the land\nwhich the LORD, your God, is giving you forever.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 77:12-13, 14-15, 16 and 21",
              "response": "R. (12a) I remember the deeds of the Lord.",
              "content": "I remember the deeds of the LORD;\n\nyes, I remember your wonders of old.\n\nAnd I meditate on your works;\n\nyour exploits I ponder.\n\nR. I remember the deeds of the Lord.\n\nO God, your way is holy;\n\nwhat great god is there like our God?\n\nYou are the God who works wonders;\n\namong the peoples you have made known your power.\n\nR. I remember the deeds of the Lord.\n\nWith your strong arm you redeemed your people,\n\nthe sons of Jacob and Joseph.\n\nYou led your people like a flock\n\nunder the care of Moses and Aaron.\n\nR. I remember the deeds of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who are persecuted for the sake of righteousness;\nfor theirs is the Kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 16:24-28",
              "content": "Jesus said to his disciples,\n\"Whoever wishes to come after me must deny himself,\ntake up his cross, and follow me.\nFor whoever wishes to save his life will lose it,\nbut whoever loses his life for my sake will find it.\nWhat profit would there be for one to gain the whole world\nand forfeit his life?\nOr what can one give in exchange for his life?\nFor the Son of Man will come with his angels in his Father's glory,\nand then he will repay each according to his conduct.\nAmen, I say to you, there are some standing here\nwho will not taste death\nuntil they see the Son of Man coming in his Kingdom.\""
            }
          },
          "saint_of_day": {
            "name": "Dominic",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-09": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.433Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-09": {
          "date": "2025-08-09",
          "liturgical_date": "Saturday of the Eighteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 6:4-13",
              "content": "Moses said to the people:\n\"Hear, O Israel! The LORD is our God, the LORD alone!\nTherefore, you shall love the LORD, your God,\nwith all your heart,\nand with all your soul,\nand with all your strength.\nTake to heart these words which I enjoin on you today.\nDrill them into your children.\nSpeak of them at home and abroad, whether you are busy or at rest.\nBind them at your wrist as a sign\nand let them be as a pendant on your forehead.\nWrite them on the doorposts of your houses and on your gates.\n\n\"When the LORD, your God, brings you into the land which he swore\nto your fathers: Abraham, Isaac and Jacob,\nthat he would give you,\na land with fine, large cities that you did not build,\nwith houses full of goods of all sorts that you did not garner,\nwith cisterns that you did not dig,\nwith vineyards and olive groves that you did not plant;\nand when, therefore, you eat your fill,\ntake care not to forget the LORD,\nwho brought you out of the land of Egypt, that place of slavery.\nThe LORD, your God, shall you fear;\nhim shall you serve, and by his name shall you swear.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 18:2-3a, 3bc-4, 47 and 51",
              "response": "R. (2) I love you, Lord, my strength.",
              "content": "I love you, O LORD, my strength,\n\nO LORD, my rock, my fortress, my deliverer.\n\nR. I love you, Lord, my strength.\n\nMy God, my rock of refuge,\n\nmy shield, the horn of my salvation, my stronghold!\n\nPraised be the LORD, I exclaim!\n\nAnd I am safe from my enemies.\n\nR. I love you, Lord, my strength.\n\nThe LORD live! And blessed be my Rock!\n\nExtolled be God my savior!\n\nYou who gave great victories to your king,\n\nand showed kindness to your anointed,\n\nto David and his posterity forever.\n\nR. I love you, Lord, my strength."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOur Savior Jesus Christ has destroyed death\nand brought life to light through the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 17:14-20",
              "content": "A man came up to Jesus, knelt down before him, and said,\n\"Lord, have pity on my son, who is a lunatic and suffers severely;\noften he falls into fire, and often into water.\nI brought him to your disciples, but they could not cure him.\"\nJesus said in reply,\n\"O faithless and perverse generation, how long will I be with you?\nHow long will I endure you?\nBring the boy here to me.\"\nJesus rebuked him and the demon came out of him,\nand from that hour the boy was cured.\nThen the disciples approached Jesus in private and said,\n\"Why could we not drive it out?\"\nHe said to them, \"Because of your little faith.\nAmen, I say to you, if you have faith the size of a mustard seed,\nyou will say to this mountain,\n'Move from here to there,' and it will move.\nNothing will be impossible for you.\""
            }
          },
          "saint_of_day": {
            "name": "Teresa Benedicta",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-10": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.492Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-10": {
          "date": "2025-08-10",
          "liturgical_date": "Nineteenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Wisdom 18:6-9",
              "content": "The night of the passover was known beforehand to our fathers,\n that, with sure knowledge of the oaths in which they put their faith,\n they might have courage.\n Your people awaited the salvation of the just\n and the destruction of their foes.\n For when you punished our adversaries,\n in this you glorified us whom you had summoned.\n For in secret the holy children of the good were offering sacrifice\n and putting into effect with one accord the divine institution."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 33:1, 12, 18-19, 20-22",
              "response": "R. (12b) Blessed the people the Lord has chosen to be his own.",
              "content": "Exult, you just, in the LORD;\n\npraise from the upright is fitting.\n\nBlessed the nation whose God is the LORD,\n\nthe people he has chosen for his own inheritance.\n\nR. Blessed the people the Lord has chosen to be his own.\n\nSee, the eyes of the LORD are upon those who fear him,\n\nupon those who hope for his kindness,\n\nTo deliver them from death\n\nand preserve them in spite of famine.\n\nR. Blessed the people the Lord has chosen to be his own.\n\nOur soul waits for the LORD,\n\nwho is our help and our shield.\n\nMay your kindness, O LORD, be upon us\n\nwho have put our hope in you.\n\nR. Blessed the people the Lord has chosen to be his own."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nStay awake and be ready!\nFor you do not know on what day your Lord will come.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 12:32-48",
              "content": "Jesus said to his disciples:\n“Do not be afraid any longer, little flock,\nfor your Father is pleased to give you the kingdom.\nSell your belongings and give alms.\nProvide money bags for yourselves that do not wear out,\nan inexhaustible treasure in heaven\nthat no thief can reach nor moth destroy.\nFor where your treasure is, there also will your heart be.\n\n“Gird your loins and light your lamps\nand be like servants who await their master’s return from a wedding,\nready to open immediately when he comes and knocks.\nBlessed are those servants\nwhom the master finds vigilant on his arrival.  \nAmen, I say to you, he will gird himself,\nhave them recline at table, and proceed to wait on them.\nAnd should he come in the second or third watch\nand find them prepared in this way,\nblessed are those servants.\nBe sure of this:\nif the master of the house had known the hour\nwhen the thief was coming,\nhe would not have let his house be broken into.\nYou also must be prepared, for at an hour you do not expect,\nthe Son of Man will come.”\n\nThen Peter said,\n“Lord, is this parable meant for us or for everyone?”\nAnd the Lord replied,\n“Who, then, is the faithful and prudent steward\nwhom the master will put in charge of his servants\nto distribute the food allowance at the proper time?\nBlessed is that servant whom his master on arrival finds doing so.\nTruly, I say to you, the master will put the servant\nin charge of all his property.\nBut if that servant says to himself,\n‘My master is delayed in coming,’\nand begins to beat the menservants and the maidservants,\nto eat and drink and get drunk,\nthen that servant’s master will come\non an unexpected day and at an unknown hour\nand will punish the servant severely\nand assign him a place with the unfaithful.\nThat servant who knew his master’s will\nbut did not make preparations nor act in accord with his will\nshall be beaten severely;\nand the servant who was ignorant of his master’s will\nbut acted in a way deserving of a severe beating\nshall be beaten only lightly.\nMuch will be required of the person entrusted with much,\nand still more will be demanded of the person entrusted with more.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-11": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.752Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-11": {
          "date": "2025-08-11",
          "liturgical_date": "Memorial of Saint Clare, Virgin",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 10:12-22",
              "content": "Moses said to the people:\n\"And now, Israel, what does the LORD, your God, ask of you\nbut to fear the LORD, your God, and follow his ways exactly,\nto love and serve the LORD, your God,\nwith all your heart and all your soul,\nto keep the commandments and statutes of the LORD\nwhich I enjoin on you today for your own good?\nThink! The heavens, even the highest heavens,\nbelong to the LORD, your God,\nas well as the earth and everything on it.\nYet in his love for your fathers the LORD was so attached to them\nas to choose you, their descendants,\nin preference to all other peoples, as indeed he has now done.\nCircumcise your hearts, therefore, and be no longer stiff-necked.\nFor the LORD, your God, is the God of gods,\nthe LORD of lords, the great God, mighty and awesome,\nwho has no favorites, accepts no bribes;\nwho executes justice for the orphan and the widow,\nand befriends the alien, feeding and clothing him.\nSo you too must befriend the alien,\nfor you were once aliens yourselves in the land of Egypt.\nThe LORD, your God, shall you fear, and him shall you serve;\nhold fast to him and swear by his name.\nHe is your glory, he, your God,\nwho has done for you those great and terrible things\nwhich your own eyes have seen.\nYour ancestors went down to Egypt seventy strong,\nand now the LORD, your God,\nhas made you as numerous as the stars of the sky.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 147:12-13, 14-15, 19-20",
              "response": "R. (12a) Praise the Lord, Jerusalem.",
              "content": "Glorify the LORD, O Jerusalem;\n\npraise your God, O Zion.\n\nFor he has strengthened the bars of your gates;\n\nhe has blessed your children within you.\n\nR. Praise the Lord, Jerusalem.\n\nHe has granted peace in your borders;\n\nwith the best of wheat he fills you.\n\nHe sends forth his command to the earth;\n\nswiftly runs his word!\n\nR. Praise the Lord, Jerusalem.\n\nHe has proclaimed his word to Jacob,\n\nhis statutes and his ordinances to Israel.\n\nHe has not done thus for any other nation;\n\nhis ordinances he has not made known to them. Alleluia.\n\nR. Praise the Lord, Jerusalem."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nGod has called you through the Gospel\nto possess the glory of our Lord Jesus Christ.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 17:22-27",
              "content": "As Jesus and his disciples were gathering in Galilee,\nJesus said to them,\n\"The Son of Man is to be handed over to men,\nand they will kill him, and he will be raised on the third day.\"\nAnd they were overwhelmed with grief.\n\nWhen they came to Capernaum,\nthe collectors of the temple tax approached Peter and said,\n\"Does not your teacher pay the temple tax?\"\n\"Yes,\" he said.\nWhen he came into the house, before he had time to speak,\nJesus asked him, \"What is your opinion, Simon?\nFrom whom do the kings of the earth take tolls or census tax?\nFrom their subjects or from foreigners?\"\nWhen he said, \"From foreigners,\" Jesus said to him,\n\"Then the subjects are exempt.\nBut that we may not offend them, go to the sea, drop in a hook,\nand take the first fish that comes up.\nOpen its mouth and you will find a coin worth twice the temple tax.\nGive that to them for me and for you.\""
            }
          },
          "saint_of_day": {
            "name": "Saintclare",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-12": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.422Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-12": {
          "date": "2025-08-12",
          "liturgical_date": "Tuesday of the Nineteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 31:1-8",
              "content": "When Moses had finished speaking to all Israel, he said to them,\n\"I am now one hundred and twenty years old\nand am no longer able to move about freely;\nbesides, the LORD has told me that I shall not cross this Jordan.\nIt is the LORD, your God, who will cross before you;\nhe will destroy these nations before you,\nthat you may supplant them.\nIt is Joshua who will cross before you, as the LORD promised.\nThe LORD will deal with them just as he dealt with Sihon and Og,\nthe kings of the Amorites whom he destroyed,\nand with their country.\nWhen, therefore, the LORD delivers them up to you,\nyou must deal with them exactly as I have ordered you.\nBe brave and steadfast; have no fear or dread of them,\nfor it is the LORD, your God, who marches with you;\nhe will never fail you or forsake you.\"\n\nThen Moses summoned Joshua and in the presence of all Israel\nsaid to him, \"Be brave and steadfast,\nfor you must bring this people into the land\nwhich the LORD swore to their fathers he would give them;\nyou must put them in possession of their heritage.\nIt is the LORD who marches before you;\nhe will be with you and will never fail you or forsake you.\nSo do not fear or be dismayed.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Deuteronomy 32:3-4ab, 7, 8, 9 and 12",
              "response": "R.(9a) The portion of the Lord is his people.",
              "content": "For I will sing the LORD's renown.\n\nOh, proclaim the greatness of our God!\n\nThe Rock–how faultless are his deeds,\n\nhow right all his ways!\n\nR. The portion of the Lord is his people.\n\nThink back on the days of old,\n\nreflect on the years of age upon age.\n\nAsk your father and he will inform you,\n\nask your elders and they will tell you.\n\nR. The portion of the Lord is his people.\n\nWhen the Most High assigned the nations their heritage,\n\nwhen he parceled out the descendants of Adam,\n\nHe set up the boundaries of the peoples\n\nafter the number of the sons of Israel.\n\nR. The portion of the Lord is his people.\n\nWhile the LORD's own portion was Jacob,\n\nhis hereditary share was Israel.\n\nThe LORD alone was their leader,\n\nno strange god was with him.\n\nR. The portion of the Lord is his people."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nTake my yoke upon you and learn from me,\nfor I am meek and humble of heart.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 18:1-5, 10, 12-14",
              "content": "The disciples approached Jesus and said,\n\"Who is the greatest in the Kingdom of heaven?\"\nHe called a child over, placed it in their midst, and said,\n\"Amen, I say to you, unless you turn and become like children,\nyou will not enter the Kingdom of heaven.\nWhoever becomes humble like this child\nis the greatest in the Kingdom of heaven.\nAnd whoever receives one child such as this in my name receives me.\n\n\"See that you do not despise one of these little ones,\nfor I say to you that their angels in heaven\nalways look upon the face of my heavenly Father.\nWhat is your opinion?\nIf a man has a hundred sheep and one of them goes astray,\nwill he not leave the ninety-nine in the hills\nand go in search of the stray?\nAnd if he finds it, amen, I say to you, he rejoices more over it\nthan over the ninety-nine that did not stray.\nIn just the same way, it is not the will of your heavenly Father\nthat one of these little ones be lost.\""
            }
          },
          "saint_of_day": {
            "name": "Jane Frances De Chantal",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-13": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.674Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-13": {
          "date": "2025-08-13",
          "liturgical_date": "Wednesday of the Nineteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 34:1-12",
              "content": "Moses went up from the plains of Moab to Mount Nebo,\nthe headland of Pisgah which faces Jericho,\nand the LORD showed him all the land—\nGilead, and as far as Dan, all Naphtali,\nthe land of Ephraim and Manasseh,\nall the land of Judah as far as the Western Sea,\nthe Negeb, the circuit of the Jordan\nwith the lowlands at Jericho, city of palms,\nand as far as Zoar.\nThe LORD then said to him,\n\"This is the land\nwhich I swore to Abraham, Isaac, and Jacob\nthat I would give to their descendants.\nI have let you feast your eyes upon it, but you shall not cross over.\"\nSo there, in the land of Moab, Moses, the servant of the LORD,\ndied as the LORD had said; and he was buried in the ravine\nopposite Beth-peor in the land of Moab,\nbut to this day no one knows the place of his burial.\nMoses was one hundred and twenty years old when he died,\nyet his eyes were undimmed and his vigor unabated.\nFor thirty days the children of Israel wept for Moses\nin the plains of Moab, till they had completed\nthe period of grief and mourning for Moses.\n\nNow Joshua, son of Nun, was filled with the spirit of wisdom,\nsince Moses had laid his hands upon him;\nand so the children of Israel gave him their obedience,\nthus carrying out the LORD's command to Moses.\n\nSince then no prophet has arisen in Israel like Moses,\nwhom the LORD knew face to face.\nHe had no equal in all the signs and wonders\nthe LORD sent him to perform in the land of Egypt\nagainst Pharaoh and all his servants and against all his land,\nand for the might and the terrifying power\nthat Moses exhibited in the sight of all Israel."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 66:1-3a, 5 and 8, 16-17",
              "response": "R. (see 20a and 10b) Blessed be God who filled my soul with fire!",
              "content": "Shout joyfully to God, all the earth;\n\nsing praise to the glory of his name;\n\nproclaim his glorious praise.\n\nSay to God: \"How tremendous are your deeds!\"\n\nR. Blessed be God who filled my soul with fire!\n\nCome and see the works of God,\n\nhis tremendous deeds among the children of Adam.\n\nBless our God, you peoples;\n\nloudly sound his praise.\n\nR. Blessed be God who filled my soul with fire!\n\nHear now, all you who fear God, while I declare\n\nwhat he has done for me.\n\nWhen I appealed to him in words,\n\npraise was on the tip of my tongue.\n\nR. Blessed be God who filled my soul with fire!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nGod was reconciling the world to himself in Christ,\nAnd entreating to us the message of reconciliation.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 18:15-20",
              "content": "Jesus said to his disciples:\n\"If your brother sins against you,\ngo and tell him his fault between you and him alone.\nIf he listens to you, you have won over your brother.\nIf he does not listen,\ntake one or two others along with you,\nso that every fact may be established\non the testimony of two or three witnesses.\nIf he refuses to listen to them, tell the Church.\nIf he refuses to listen even to the Church,\nthen treat him as you would a Gentile or a tax collector.\nAmen, I say to you,\nwhatever you bind on earth shall be bound in heaven,\nand whatever you loose on earth shall be loosed in heaven.\nAgain, amen, I say to you, if two of you agree on earth\nabout anything for which they are to pray,\nit shall be granted to them by my heavenly Father.\nFor where two or three are gathered together in my name,\nthere am I in the midst of them.\""
            }
          },
          "saint_of_day": {
            "name": "Pontian Hippolytus",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-14": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.696Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-14": {
          "date": "2025-08-14",
          "liturgical_date": "Memorial of Saint Maximilian Kolbe, Priest and Martyr",
          "liturgical_color": "red",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Joshua 3:7-10a, 11, 13-17",
              "content": "The LORD said to Joshua,\n\"Today I will begin to exalt you in the sight of all Israel,\nthat they may know I am with you, as I was with Moses.\nNow command the priests carrying the ark of the covenant\nto come to a halt in the Jordan\nwhen you reach the edge of the waters.\"\n\nSo Joshua said to the children of Israel,\n\"Come here and listen to the words of the LORD, your God.\nThis is how you will know that there is a living God in your midst,\nwho at your approach will dispossess the Canaanites.\nThe ark of the covenant of the LORD of the whole earth\nwill precede you into the Jordan.\nWhen the soles of the feet of the priests carrying the ark of the LORD,\nthe Lord of the whole earth,\ntouch the water of the Jordan, it will cease to flow;\nfor the water flowing down from upstream will halt in a solid bank.\"\n\nThe people struck their tents to cross the Jordan,\nwith the priests carrying the ark of the covenant ahead of them.\nNo sooner had these priestly bearers of the ark\nwaded into the waters at the edge of the Jordan,\nwhich overflows all its banks\nduring the entire season of the harvest,\nthan the waters flowing from upstream halted,\nbacking up in a solid mass for a very great distance indeed,\nfrom Adam, a city in the direction of Zarethan;\nwhile those flowing downstream toward the Salt Sea of the Arabah\ndisappeared entirely.\nThus the people crossed over opposite Jericho.\nWhile all Israel crossed over on dry ground,\nthe priests carrying the ark of the covenant of the LORD\nremained motionless on dry ground in the bed of the Jordan\nuntil the whole nation had completed the passage."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 114:1-2, 3-4, 5-6",
              "response": "R. Alleluia!",
              "content": "When Israel came forth from Egypt,\n\nthe house of Jacob from a people of alien tongue,\n\nJudah became his sanctuary,\n\nIsrael his domain.\n\nR. Alleluia!\n\nThe sea beheld and fled;\n\nJordan turned back.\n\nThe mountains skipped like rams,\n\nthe hills like the lambs of the flock.\n\nR. Alleluia!\n\nWhy is it, O sea, that you flee?\n\nO Jordan, that you turn back?\n\nYou mountains, that you skip like rams?\n\nYou hills, like the lambs of the flock?\n\nR. Alleluia!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nLet your countenance shine upon your servant\nand teach me your statutes.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 18:21–19:1",
              "content": "Peter approached Jesus and asked him,\n\"Lord, if my brother sins against me,\nhow often must I forgive him?\nAs many as seven times?\"\nJesus answered, \"I say to you, not seven times but seventy-seven times.\nThat is why the Kingdom of heaven may be likened to a king\nwho decided to settle accounts with his servants.\nWhen he began the accounting,\na debtor was brought before him who owed him a huge amount.\nSince he had no way of paying it back,\nhis master ordered him to be sold,\nalong with his wife, his children, and all his property,\nin payment of the debt.\nAt that, the servant fell down, did him homage, and said,\n'Be patient with me, and I will pay you back in full.'\nMoved with compassion the master of that servant\nlet him go and forgave him the loan.\nWhen that servant had left, he found one of his fellow servants\nwho owed him a much smaller amount.\nHe seized him and started to choke him, demanding,\n'Pay back what you owe.'\nFalling to his knees, his fellow servant begged him,\n'Be patient with me, and I will pay you back.'\nBut he refused.\nInstead, he had the fellow servant put in prison\nuntil he paid back the debt.\nNow when his fellow servants saw what had happened,\nthey were deeply disturbed,\nand went to their master and reported the whole affair.\nHis master summoned him and said to him, 'You wicked servant!\nI forgave you your entire debt because you begged me to.\nShould you not have had pity on your fellow servant,\nas I had pity on you?'\nThen in anger his master handed him over to the torturers\nuntil he should pay back the whole debt.\nSo will my heavenly Father do to you,\nunless each of you forgives his brother from his heart.\"\n\nWhen Jesus finished these words, he left Galilee\nand went to the district of Judea across the Jordan."
            }
          },
          "saint_of_day": {
            "name": "Maximilian Mary Kolbe",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-15": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.590Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-15": {
          "date": "2025-08-15",
          "liturgical_date": "Solemnity of the Assumption of the Blessed Virgin Mary",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "",
              "response": "",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "",
              "content": ""
            },
            "gospel": {
              "citation": "",
              "content": ""
            }
          },
          "saint_of_day": {
            "name": "Vigil",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-16": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.697Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-16": {
          "date": "2025-08-16",
          "liturgical_date": "Saturday of the Nineteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Joshua 24:14-29",
              "content": "Joshua gathered together all the tribes of Israel at Shechem,\nand addressed them, saying:\n\"Fear the LORD and serve him completely and sincerely.\nCast out the gods your fathers served beyond the River and in Egypt,\nand serve the LORD.\nIf it does not please you to serve the LORD,\ndecide today whom you will serve,\nthe gods your fathers served beyond the River\nor the gods of the Amorites in whose country you are dwelling.\nAs for me and my household, we will serve the LORD.\"\n\nBut the people answered, \"Far be it from us to forsake the LORD\nfor the service of other gods.\nFor it was the LORD, our God,\nwho brought us and our fathers up out of the land of Egypt,\nout of a state of slavery.\nHe performed those great miracles before our very eyes\nand protected us along our entire journey and among all the peoples\nthrough whom we passed.\nAt our approach the LORD drove out all the peoples,\nincluding the Amorites who dwelt in the land.\nTherefore we also will serve the LORD, for he is our God.\"\n\nJoshua in turn said to the people,\n\"You may not be able to serve the LORD, for he is a holy God;\nhe is a jealous God who will not forgive\nyour transgressions or your sins.\nIf, after the good he has done for you,\nyou forsake the LORD and serve strange gods,\nhe will do evil to you and destroy you.\"\n\nBut the people answered Joshua, \"We will still serve the LORD.\"\nJoshua therefore said to the people,\n\"You are your own witnesses that you have chosen to serve the LORD.\"\nThey replied, \"We are, indeed!\"\nJoshua continued:\n\"Now, therefore, put away the strange gods that are among you\nand turn your hearts to the LORD, the God of Israel.\"\nThen the people promised Joshua,\n\"We will serve the LORD, our God, and obey his voice.\"\n\nSo Joshua made a covenant with the people that day\nand made statutes and ordinances for them at Shechem,\nwhich he recorded in the book of the law of God.\nThen he took a large stone and set it up there under the oak\nthat was in the sanctuary of the LORD.\nAnd Joshua said to all the people, \"This stone shall be our witness,\nfor it has heard all the words which the LORD spoke to us.\nIt shall be a witness against you, should you wish to deny your God.\"\nThen Joshua dismissed the people, each to his own heritage.\n\nAfter these events, Joshua, son of Nun, servant of the LORD,\ndied at the age of a hundred and ten."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 16:1-2a and 5, 7-8, 11",
              "response": "R. (see 5a) You are my inheritance, O Lord.",
              "content": "Keep me, O God, for in you I take refuge;\n\nI say to the LORD, \"My Lord are you.\"\n\nO LORD, my allotted portion and my cup,\n\nyou it is who hold fast my lot.\n\nR. You are my inheritance, O Lord.\n\nI bless the LORD who counsels me;\n\neven in the night my heart exhorts me.\n\nI set the LORD ever before me;\n\nwith him at my right hand I shall not be disturbed.\n\nR. You are my inheritance, O Lord.\n\nYou will show me the path to life,\n\nfullness of joys in your presence,\n\nthe delights at your right hand forever.\n\nR. You are my inheritance, O Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, Father, Lord of heaven and earth;\nyou have revealed to little ones the mysteries of the Kingdom.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 19:13-15",
              "content": "Children were brought to Jesus\nthat he might lay his hands on them and pray.\nThe disciples rebuked them, but Jesus said,\n\"Let the children come to me, and do not prevent them;\nfor the Kingdom of heaven belongs to such as these.\"\nAfter he placed his hands on them, he went away."
            }
          },
          "saint_of_day": {
            "name": "Stephen Hungary",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-17": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.785Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-17": {
          "date": "2025-08-17",
          "liturgical_date": "Twentieth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Jeremiah 38:4-6, 8-10",
              "content": "In those days, the princes said to the king:\n\"Jeremiah ought to be put to death;\nhe is demoralizing the soldiers who are left in this city,\nand all the people, by speaking such things to them;\nhe is not interested in the welfare of our people,\nbut in their ruin.\"\nKing Zedekiah answered: \"He is in your power\";\nfor the king could do nothing with them.\nAnd so they took Jeremiah\nand threw him into the cistern of Prince Malchiah,\nwhich was in the quarters of the guard,\nletting him down with ropes.\nThere was no water in the cistern, only mud,\nand Jeremiah sank into the mud.\n\nEbed-melech, a court official,\nwent there from the palace and said to him:\n\"My lord king,\nthese men have been at fault\nin all they have done to the prophet Jeremiah,\ncasting him into the cistern.\nHe will die of famine on the spot,\nfor there is no more food in the city.\"\nThen the king ordered Ebed-melech the Cushite\nto take three men along with him,\nand draw the prophet Jeremiah out of the cistern before\nhe should die."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 40:2, 3, 4, 18",
              "response": "R. (14b)  Lord, come to my aid!",
              "content": "I have waited, waited for the LORD,\n\nand he stooped toward me.\n\nR. Lord, come to my aid!\n\nThe LORD heard my cry.\n\nHe drew me out of the pit of destruction,\n\nout of the mud of the swamp;\n\nhe set my feet upon a crag;\n\nhe made firm my steps.\n\nR. Lord, come to my aid!\n\nAnd he put a new song into my mouth,\n\na hymn to our God.\n\nMany shall look on in awe\n\nand trust in the LORD.\n\nR. Lord, come to my aid!\n\nThough I am afflicted and poor,\n\nyet the LORD thinks of me.\n\nYou are my help and my deliverer;\n\nO my God, hold not back!\n\nR. Lord, come to my aid!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 12:49-53",
              "content": "Jesus said to his disciples:\n\"I have come to set the earth on fire,\nand how I wish it were already blazing!\nThere is a baptism with which I must be baptized,\nand how great is my anguish until it is accomplished!\nDo you think that I have come to establish peace on the earth?\nNo, I tell you, but rather division.\nFrom now on a household of five will be divided,\nthree against two and two against three;\na father will be divided against his son\nand a son against his father,\na mother against her daughter\nand a daughter against her mother,\na mother-in-law against her daughter-in-law\nand a daughter-in-law against her mother-in-law.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-18": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.555Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-18": {
          "date": "2025-08-18",
          "liturgical_date": "Monday of the Twentieth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 106:34-35, 36-37, 39-40, 43ab and 44",
              "response": "R.    (4a)  Remember us, O Lord, as you favor your people.",
              "content": "They did not exterminate the peoples,\n\nas the LORD had commanded them,\n\nBut mingled with the nations\n\nand learned their works.\n\nR.    Remember us, O Lord, as you favor your people.\n\nThey served their idols,\n\nwhich became a snare for them.\n\nThey sacrificed their sons\n\nand their daughters to demons.\n\nR.    Remember us, O Lord, as you favor your people.\n\nThey became defiled by their works,\n\nand wanton in their crimes.\n\nAnd the LORD grew angry with his people,\n\nand abhorred his inheritance.\n\nR.    Remember us, O Lord, as you favor your people.\n\nMany times did he rescue them,\n\nbut they embittered him with their counsels.\n\nYet he had regard for their affliction\n\nwhen he heard their cry.\n\nR.    Remember us, O Lord, as you favor your people."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are the poor in spirit;\nfor theirs is the Kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 19:16-22",
              "content": "A young man approached Jesus and said,\n“Teacher, what good must I do to gain eternal life?”\nHe answered him, “Why do you ask me about the good?\nThere is only One who is good.\nIf you wish to enter into life, keep the commandments.”\nHe asked him, “Which ones?”\nAnd Jesus replied, “You shall not kill;\nyou shall not commit adultery;\nyou shall not steal;\nyou shall not bear false witness;\nhonor your father and your mother;\nand you shall love your neighbor as yourself.”\nThe young man said to him,\n“All of these I have observed. What do I still lack?”\nJesus said to him, “If you wish to be perfect, go,\nsell what you have and give to the poor,\nand you will have treasure in heaven.\nThen come, follow me.”\nWhen the young man heard this statement, he went away sad,\nfor he had many possessions."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-19": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.625Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-19": {
          "date": "2025-08-19",
          "liturgical_date": "Tuesday of the Twentieth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 85:9, 11-12, 13-14",
              "response": "R.    (see 9b)  The Lord speaks of peace to his people.",
              "content": "I will hear what God proclaims;\n\nthe LORD–for he proclaims peace\n\nTo his people, and to his faithful ones,\n\nand to those who put in him their hope.\n\nR.    The Lord speaks of peace to his people.\n\nKindness and truth shall meet;\n\njustice and peace shall kiss.\n\nTruth shall spring out of the earth,\n\nand justice shall look down from heaven.\n\nR.    The Lord speaks of peace to his people.\n\nThe LORD himself will give his benefits;\n\nour land shall yield its increase.\n\nJustice shall walk before him,\n\nand salvation, along the way of his steps.\n\nR.    The Lord speaks of peace to his people."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nJesus Christ became poor although he was rich\nso that by his poverty you might become rich.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 19:23-30",
              "content": "Jesus said to his disciples:\n“Amen, I say to you, it will be hard for one who is rich\nto enter the Kingdom of heaven.\nAgain I say to you,\nit is easier for a camel to pass through the eye of a needle\nthan for one who is rich to enter the Kingdom of God.”\nWhen the disciples heard this, they were greatly astonished and said,\n“Who then can be saved?”\nJesus looked at them and said,\n“For men this is impossible,\nbut for God all things are possible.”\nThen Peter said to him in reply,\n“We have given up everything and followed you.\nWhat will there be for us?”\nJesus said to them, “Amen, I say to you\nthat you who have followed me, in the new age,\nwhen the Son of Man is seated on his throne of glory,\nwill yourselves sit on twelve thrones,\njudging the twelve tribes of Israel.\nAnd everyone who has given up houses or brothers or sisters\nor father or mother or children or lands\nfor the sake of my name will receive a hundred times more,\nand will inherit eternal life.\nBut many who are first will be last, and the last will be first.”"
            }
          },
          "saint_of_day": {
            "name": "John Eudes",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-20": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.815Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-20": {
          "date": "2025-08-20",
          "liturgical_date": "Memorial of Saint Bernard, Abbot and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Judges 9:6-15",
              "content": "All the citizens of Shechem and all Beth-millo came together\nand proceeded to make Abimelech king\nby the terebinth at the memorial pillar in Shechem.\n\nWhen this was reported to him,\nJotham went to the top of Mount Gerizim and, standing there,\ncried out to them in a loud voice:\n\"Hear me, citizens of Shechem, that God may then hear you!\nOnce the trees went to anoint a king over themselves.\nSo they said to the olive tree, 'Reign over us.'\nBut the olive tree answered them, 'Must I give up my rich oil,\nwhereby men and gods are honored,\nand go to wave over the trees?'\nThen the trees said to the fig tree, 'Come; you reign over us!'\nBut the fig tree answered them,\n'Must I give up my sweetness and my good fruit,\nand go to wave over the trees?'\nThen the trees said to the vine, 'Come you, and reign over us.'\nBut the vine answered them,\n'Must I give up my wine that cheers gods and men,\nand go to wave over the trees?'\nThen all the trees said to the buckthorn, 'Come; you reign over us!'\nBut the buckthorn replied to the trees,\n'If you wish to anoint me king over you in good faith,\ncome and take refuge in my shadow.\nOtherwise, let fire come from the buckthorn\nand devour the cedars of Lebanon.'\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 21:2-3, 4-5, 6-7",
              "response": "R. (2a) Lord, in your strength the king is glad.",
              "content": "O LORD, in your strength the king is glad;\n\nin your victory how greatly he rejoices!\n\nYou have granted him his heart's desire;\n\nyou refused not the wish of his lips.\n\nR. Lord, in your strength the king is glad.\n\nFor you welcomed him with goodly blessings,\n\nyou placed on his head a crown of pure gold.\n\nHe asked life of you: you gave him\n\nlength of days forever and ever.\n\nR. Lord, in your strength the king is glad.\n\nGreat is his glory in your victory;\n\nmajesty and splendor you conferred upon him.\n\nYou made him a blessing forever,\n\nyou gladdened him with the joy of your face.\n\nR. Lord, in your strength the king is glad."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe word of God is living and effective,\nable to discern the reflections and thoughts of the heart.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 20:1-16",
              "content": "Jesus told his disciples this parable:\n\"The Kingdom of heaven is like a landowner\nwho went out at dawn to hire laborers for his vineyard.\nAfter agreeing with them for the usual daily wage,\nhe sent them into his vineyard.\nGoing out about nine o'clock,\nhe saw others standing idle in the marketplace,\nand he said to them, 'You too go into my vineyard,\nand I will give you what is just.'\nSo they went off.\nAnd he went out again around noon,\nand around three o'clock, and did likewise.\nGoing out about five o'clock,\nhe found others standing around, and said to them,\n'Why do you stand here idle all day?'\nThey answered, 'Because no one has hired us.'\nHe said to them, 'You too go into my vineyard.'\nWhen it was evening the owner of the vineyard said to his foreman,\n'Summon the laborers and give them their pay,\nbeginning with the last and ending with the first.'\nWhen those who had started about five o'clock came,\neach received the usual daily wage.\nSo when the first came, they thought that they would receive more,\nbut each of them also got the usual wage.\nAnd on receiving it they grumbled against the landowner, saying,\n'These last ones worked only one hour,\nand you have made them equal to us,\nwho bore the day's burden and the heat.'\nHe said to one of them in reply,\n'My friend, I am not cheating you.\nDid you not agree with me for the usual daily wage?\nTake what is yours and go.\nWhat if I wish to give this last one the same as you?\nOr am I not free to do as I wish with my own money?\nAre you envious because I am generous?'\nThus, the last will be first, and the first will be last.\""
            }
          },
          "saint_of_day": {
            "name": "Bernard",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-21": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.753Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-21": {
          "date": "2025-08-21",
          "liturgical_date": "Memorial of Saint Pius X, Pope",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 40:5, 7-8a, 8b-9, 10",
              "response": "R.    (8a and 9a)  Here I am, Lord; I come to do your will.",
              "content": "Blessed the man who makes the LORD his trust;\n\nwho turns not to idolatry\n\nor to those who stray after falsehood.\n\nR.    Here I am, Lord; I come to do your will.\n\nSacrifice or oblation you wished not,\n\nbut ears open to obedience you gave me.\n\nBurnt offerings or sin-offerings you sought not;\n\nthen said I, “Behold I come.”\n\nR.    Here I am, Lord; I come to do your will.\n\n“In the written scroll it is prescribed for me.\n\nTo do your will, O my God, is my delight,\n\nand your law is within my heart!”\n\nR.    Here I am, Lord; I come to do your will.\n\nI announced your justice in the vast assembly;\n\nI did not restrain my lips, as you, O LORD, know.\n\nR.    Here I am, Lord; I come to do your will."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf today you hear his voice,\nharden not your hearts.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 22:1-14",
              "content": "Jesus again in reply spoke to the chief priests and the elders of the people in parables\nsaying, “The Kingdom of heaven may be likened to a king\nwho gave a wedding feast for his son.\nHe dispatched his servants to summon the invited guests to the feast,\nbut they refused to come.\nA second time he sent other servants, saying,\n‘Tell those invited: “Behold, I have prepared my banquet,\nmy calves and fattened cattle are killed,\nand everything is ready; come to the feast.”’\nSome ignored the invitation and went away,\none to his farm, another to his business.\nThe rest laid hold of his servants,\nmistreated them, and killed them.\nThe king was enraged and sent his troops,\ndestroyed those murderers, and burned their city.\n\nThen the king said to his servants, ‘The feast is ready,\nbut those who were invited were not worthy to come.\nGo out, therefore, into the main roads\nand invite to the feast whomever you find.’\nThe servants went out into the streets\nand gathered all they found, bad and good alike,\nand the hall was filled with guests.\nBut when the king came in to meet the guests\nhe saw a man there not dressed in a wedding garment.\nHe said to him, ‘My friend, how is it\nthat you came in here without a wedding garment?’\nBut he was reduced to silence.\nThen the king said to his attendants, ‘Bind his hands and feet,\nand cast him into the darkness outside,\nwhere there will be wailing and grinding of teeth.’\nMany are invited, but few are chosen.”"
            }
          },
          "saint_of_day": {
            "name": "Pius X",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-22": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.681Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-22": {
          "date": "2025-08-22",
          "liturgical_date": "Memorial of the Queenship of the Blessed Virgin Mary",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ruth 1:1, 3-6, 14b-16, 22",
              "content": "Once in the time of the judges there was a famine in the land;\nso a man from Bethlehem of Judah\ndeparted with his wife and two sons\nto reside on the plateau of Moab.\nElimelech, the husband of Naomi, died,\nand she was left with her two sons, who married Moabite women,\none named Orpah, the other Ruth.\nWhen they had lived there about ten years,\nboth Mahlon and Chilion died also,\nand the woman was left with neither her two sons nor her husband.\nShe then made ready to go back from the plateau of Moab\nbecause word reached her there\nthat the LORD had visited his people and given them food.\n\nOrpah kissed her mother-in-law good-bye, but Ruth stayed with her.\n\nNaomi said, \"See now!\nYour sister-in-law has gone back to her people and her god.\nGo back after your sister-in-law!\"\nBut Ruth said, \"Do not ask me to abandon or forsake you!\nFor wherever you go, I will go, wherever you lodge I will lodge,\nyour people shall be my people, and your God my God.\"\n\nThus it was that Naomi returned\nwith the Moabite daughter-in-law, Ruth,\nwho accompanied her back from the plateau of Moab.\nThey arrived in Bethlehem at the beginning of the barley harvest."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 146:5-6ab, 6c-7, 8-9a, 9bc-10",
              "response": "R. (1b) Praise the Lord, my soul!",
              "content": "Blessed is he whose help is the God of Jacob,\n\nwhose hope is in the LORD, his God,\n\nWho made heaven and earth,\n\nthe sea and all that is in them.\n\nR. Praise the Lord, my soul!\n\nThe LORD keeps faith forever,\n\nsecures justice for the oppressed,\n\ngives food to the hungry.\n\nThe LORD sets captives free.\n\nR. Praise the Lord, my soul!\n\nThe LORD gives sight to the blind.\n\nThe LORD raises up those who were bowed down;\n\nThe LORD loves the just.\n\nThe LORD protects strangers.\n\nR. Praise the Lord, my soul!\n\nThe fatherless and the widow he sustains,\n\nbut the way of the wicked he thwarts.\n\nThe LORD shall reign forever;\n\nyour God, O Zion, through all generations. Alleluia.\n\nR. Praise the Lord, my soul!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nTeach me your paths, my God,\nguide me in your truth.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 22:34-40",
              "content": "When the Pharisees heard that Jesus had silenced the Sadducees,\nthey gathered together, and one of them,\na scholar of the law, tested him by asking,\n\"Teacher, which commandment in the law is the greatest?\"\nHe said to him,\n\"You shall love the Lord, your God, with all your heart,\nwith all your soul, and with all your mind.\nThis is the greatest and the first commandment.\nThe second is like it:\nYou shall love your neighbor as yourself.\nThe whole law and the prophets depend on these two commandments.\""
            }
          },
          "saint_of_day": {
            "name": "Queenship Mary",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-23": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.523Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-23": {
          "date": "2025-08-23",
          "liturgical_date": "Saturday of the Twentieth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ruth 2:1-3, 8-11; 4:13-17",
              "content": "Naomi had a prominent kinsman named Boaz,\nof the clan of her husband Elimelech.\nRuth the Moabite said to Naomi,\n\"Let me go and glean ears of grain in the field\nof anyone who will allow me that favor.\"\nNaomi said to her, \"Go, my daughter,\" and she went.\nThe field she entered to glean after the harvesters\nhappened to be the section belonging to Boaz\nof the clan of Elimelech.\n\nBoaz said to Ruth, \"Listen, my daughter!\nDo not go to glean in anyone else's field;\nyou are not to leave here.\nStay here with my women servants.\nWatch to see which field is to be harvested, and follow them;\nI have commanded the young men to do you no harm.\nWhen you are thirsty, you may go and drink from the vessels\nthe young men have filled.\"\nCasting herself prostrate upon the ground, Ruth said to him,\n\"Why should I, a foreigner, be favored with your notice?\"\nBoaz answered her:\n\"I have had a complete account of what you have done\nfor your mother-in-law after your husband's death;\nyou have left your father and your mother and the land of your birth,\nand have come to a people whom you did not know previously.\"\n\nBoaz took Ruth.\nWhen they came together as man and wife,\nthe LORD enabled her to conceive and she bore a son.\nThen the women said to Naomi,\n\"Blessed is the LORD who has not failed\nto provide you today with an heir!\nMay he become famous in Israel!\nHe will be your comfort and the support of your old age,\nfor his mother is the daughter-in-law who loves you.\nShe is worth more to you than seven sons!\"\nNaomi took the child, placed him on her lap, and became his nurse.\nAnd the neighbor women gave him his name,\nat the news that a grandson had been born to Naomi.\nThey called him Obed.\nHe was the father of Jesse, the father of David."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 128:1b-2, 3, 4, 5",
              "response": "R. (4) See how the Lord blesses those who fear him.",
              "content": "Blessed are you who fear the LORD,\n\nwho walk in his ways!\n\nFor you shall eat the fruit of your handiwork;\n\nblessed shall you be, and favored.\n\nR. See how the Lord blesses those who fear him.\n\nYou wife shall be like a fruitful vine\n\nin the recesses of your home;\n\nYour children like olive plants\n\naround your table.\n\nR. See how the Lord blesses those who fear him.\n\nBehold, thus is the man blessed\n\nwho fears the LORD.\n\nR. See how the Lord blesses those who fear him.\n\nThe LORD bless you from Zion:\n\nmay you see the prosperity of Jerusalem\n\nall the days of your life.\n\nR. See how the Lord blesses those who fear him."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYou have but one Father in heaven;\nyou have but one master, the Christ.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 23:1-12",
              "content": "Jesus spoke to the crowds and to his disciples, saying,\n\"The scribes and the Pharisees\nhave taken their seat on the chair of Moses.\nTherefore, do and observe all things whatsoever they tell you,\nbut do not follow their example.\nFor they preach but they do not practice.\nThey tie up heavy burdens hard to carry\nand lay them on people's shoulders,\nbut they will not lift a finger to move them.\nAll their works are performed to be seen.\nThey widen their phylacteries and lengthen their tassels.\nThey love places of honor at banquets, seats of honor in synagogues,\ngreetings in marketplaces, and the salutation 'Rabbi.'\nAs for you, do not be called 'Rabbi.'\nYou have but one teacher, and you are all brothers.\nCall no one on earth your father;\nyou have but one Father in heaven.\nDo not be called 'Master';\nyou have but one master, the Christ.\nThe greatest among you must be your servant.\nWhoever exalts himself will be humbled;\nbut whoever humbles himself will be exalted.\""
            }
          },
          "saint_of_day": {
            "name": "Rose Lima",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-24": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.753Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-24": {
          "date": "2025-08-24",
          "liturgical_date": "Twenty-first Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Isaiah 66:18-21",
              "content": "Thus says the LORD:\nI know their works and their thoughts,\nand I come to gather nations of every language;\nthey shall come and see my glory.\nI will set a sign among them;\nfrom them I will send fugitives to the nations:\nto Tarshish, Put and Lud, Mosoch, Tubal and Javan,\nto the distant coastlands\nthat have never heard of my fame, or seen my glory;\nand they shall proclaim my glory among the nations.\nThey shall bring all your brothers and sisters from all the nations\nas an offering to the LORD,\non horses and in chariots, in carts, upon mules and dromedaries,\nto Jerusalem, my holy mountain, says the LORD,\njust as the Israelites bring their offering\nto the house of the LORD in clean vessels.\nSome of these I will take as priests and Levites, says the LORD."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 117:1, 2",
              "response": "R.(Mk 16:15) Go out to all the world and tell the Good News.",
              "content": "or:\n\nR. Alleluia.\n\nPraise the LORD, all you nations;\n\nglorify him, all you peoples!\n\nR. Go out to all the world and tell the Good News.\n\nor:\n\nR. Alleluia.\n\nFor steadfast is his kindness toward us,\n\nand the fidelity of the LORD endures forever.\n\nR. Go out to all the world and tell the Good News.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way, the truth and the life, says the Lord;\nno one comes to the Father, except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 13:22-30",
              "content": "Jesus passed through towns and villages,\nteaching as he went and making his way to Jerusalem.\nSomeone asked him,\n\"Lord, will only a few people be saved?\"\nHe answered them,\n\"Strive to enter through the narrow gate,\nfor many, I tell you, will attempt to enter\nbut will not be strong enough.\nAfter the master of the house has arisen and locked the door,\nthen will you stand outside knocking and saying,\n'Lord, open the door for us.'\nHe will say to you in reply,\n'I do not know where you are from.\nAnd you will say,\n'We ate and drank in your company and you taught in our streets.'\nThen he will say to you,\n'I do not know where you are from.\nDepart from me, all you evildoers!'\nAnd there will be wailing and grinding of teeth\nwhen you see Abraham, Isaac, and Jacob\nand all the prophets in the kingdom of God\nand you yourselves cast out.\nAnd people will come from the east and the west\nand from the north and the south\nand will recline at table in the kingdom of God.\nFor behold, some are last who will be first,\nand some are first who will be last.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-25": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.685Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-25": {
          "date": "2025-08-25",
          "liturgical_date": "Monday of the Twenty-first Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 149:1b-2, 3-4, 5-6a and 9b",
              "response": "R.    (see 4a)  The Lord takes delight in his people.",
              "content": "or:\n\nR.    Alleluia.\n\nSing to the LORD a new song\n\nof praise in the assembly of the faithful.\n\nLet Israel be glad in their maker,\n\nlet the children of Zion rejoice in their king.\n\nR.    The Lord takes delight in his people.\n\nor:\n\nR.    Alleluia.\n\nLet them praise his name in the festive dance,\n\nlet them sing praise to him with timbrel and harp.\n\nFor the LORD loves his people,\n\nand he adorns the lowly with victory.\n\nR.    The Lord takes delight in his people.\n\nor:\n\nR.    Alleluia.\n\nLet the faithful exult in glory;\n\nlet them sing for joy upon their couches;\n\nLet the high praises of God be in their throats.\n\nThis is the glory of all his faithful. Alleluia.\n\nR.    The Lord takes delight in his people.\n\nor:\n\nR.    Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 23:13-22",
              "content": "Jesus said to the crowds and to his disciples:\n“Woe to you, scribes and Pharisees, you hypocrites.\nYou lock the Kingdom of heaven before men.\nYou do not enter yourselves,\nnor do you allow entrance to those trying to enter.\n\n“Woe to you, scribes and Pharisees, you hypocrites.\nYou traverse sea and land to make one convert,\nand when that happens you make him a child of Gehenna\ntwice as much as yourselves.\n\n“Woe to you, blind guides, who say,\n‘If one swears by the temple, it means nothing,\nbut if one swears by the gold of the temple, one is obligated.’\nBlind fools, which is greater, the gold,\nor the temple that made the gold sacred?\nAnd you say, ‘If one swears by the altar, it means nothing,\nbut if one swears by the gift on the altar, one is obligated.’\nYou blind ones, which is greater, the gift,\nor the altar that makes the gift sacred?\nOne who swears by the altar swears by it and all that is upon it;\none who swears by the temple swears by it\nand by him who dwells in it;\none who swears by heaven swears by the throne of God\nand by him who is seated on it.”"
            }
          },
          "saint_of_day": {
            "name": "Louis",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-26": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:47.249Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-26": {
          "date": "2025-08-26",
          "liturgical_date": "Tuesday of the Twenty-first Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 2:1-8",
              "content": "You yourselves know, brothers and sisters,\nthat our reception among you was not without effect.\nRather, after we had suffered and been insolently treated,\nas you know, in Philippi,\nwe drew courage through our God\nto speak to you the Gospel of God with much struggle.\nOur exhortation was not from delusion or impure motives,\nnor did it work through deception.\nBut as we were judged worthy by God to be entrusted with the Gospel,\nthat is how we speak,\nnot as trying to please men,\nbut rather God, who judges our hearts.\nNor, indeed, did we ever appear with flattering speech, as you know,\nor with a pretext for greed–God is witness–\nnor did we seek praise from men,\neither from you or from others,\nalthough we were able to impose our weight as Apostles of Christ.\nRather, we were gentle among you,\nas a nursing mother cares for her children.\nWith such affection for you, we were determined to share with you\nnot only the Gospel of God, but our very selves as well,\nso dearly beloved had you become to us."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 139:1-3, 4-6",
              "response": "R. (1) You have searched me and you know me, Lord.",
              "content": "O LORD, you have probed me and you know me;\n\nyou know when I sit and when I stand;\n\nyou understand my thoughts from afar.\n\nMy journeys and my rest you scrutinize,\n\nwith all my ways you are familiar.\n\nR. You have searched me and you know me, Lord.\n\nEven before a word is on my tongue,\n\nbehold, O LORD, you know the whole of it.\n\nBehind me and before, you hem me in\n\nand rest your hand upon me.\n\nSuch knowledge is too wonderful for me;\n\ntoo lofty for me to attain.\n\nR. You have searched me and you know me, Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe word of God is living and effective,\nable to discern reflections and thoughts of the heart.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 23:23-26",
              "content": "Jesus said:\n“Woe to you, scribes and Pharisees, you hypocrites.\nYou pay tithes of mint and dill and cummin,\nand have neglected the weightier things of the law:\njudgment and mercy and fidelity.\nBut these you should have done, without neglecting the others.\nBlind guides, who strain out the gnat and swallow the camel!\n\n“Woe to you, scribes and Pharisees, you hypocrites.\nYou cleanse the outside of cup and dish,\nbut inside they are full of plunder and self-indulgence.\nBlind Pharisee, cleanse first the inside of the cup,\nso that the outside also may be clean.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-27": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.685Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-27": {
          "date": "2025-08-27",
          "liturgical_date": "Memorial of Saint Monica",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 2:9-13",
              "content": "You recall, brothers and sisters, our toil and drudgery.\nWorking night and day in order not to burden any of you,\nwe proclaimed to you the Gospel of God.\nYou are witnesses, and so is God,\nhow devoutly and justly and blamelessly\nwe behaved toward you believers.\nAs you know, we treated each one of you as a father treats his children,\nexhorting and encouraging you and insisting\nthat you walk in a manner worthy of the God\nwho calls you into his Kingdom and glory.\n\nAnd for this reason we too give thanks to God unceasingly,\nthat, in receiving the word of God from hearing us,\nyou received it not as the word of men, but as it truly is, the word of God,\nwhich is now at work in you who believe."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 139:7-8, 9-10, 11-12ab",
              "response": "R. (1) You have searched me and you know me, Lord.",
              "content": "Where can I go from your spirit?\n\nFrom your presence where can I flee?\n\nIf I go up to the heavens, you are there;\n\nif I sink to the nether world, you are present there.\n\nR. You have searched me and you know me, Lord.\n\nIf I take the wings of the dawn,\n\nif I settle at the farthest limits of the sea,\n\nEven there your hand shall guide me,\n\nand your right hand hold me fast.\n\nR. You have searched me and you know me, Lord.\n\nIf I say, \"Surely the darkness shall hide me,\n\nand night shall be my light\"–\n\nFor you darkness itself is not dark,\n\nand night shines as the day.\n\nR. You have searched me and you know me, Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhoever keeps the word of Christ,\nthe love of God is truly perfected in him.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 23:27-32",
              "content": "Jesus said,\n\"Woe to you, scribes and Pharisees, you hypocrites.\nYou are like whitewashed tombs, which appear beautiful on the outside,\nbut inside are full of dead men's bones and every kind of filth.\nEven so, on the outside you appear righteous,\nbut inside you are filled with hypocrisy and evildoing.\n\n\"Woe to you, scribes and Pharisees, you hypocrites.\nYou build the tombs of the prophets\nand adorn the memorials of the righteous,\nand you say, 'If we had lived in the days of our ancestors,\nwe would not have joined them in shedding the prophets' blood.'\nThus you bear witness against yourselves\nthat you are the children of those who murdered the prophets;\nnow fill up what your ancestors measured out!\""
            }
          },
          "saint_of_day": {
            "name": "Monica",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-28": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:48.753Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-28": {
          "date": "2025-08-28",
          "liturgical_date": "Memorial of Saint Augustine, Bishop and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 3:7-13",
              "content": "We have been reassured about you, brothers and sisters,\nin our every distress and affliction, through your faith.\nFor we now live, if you stand firm in the Lord.\n\nWhat thanksgiving, then, can we render to God for you,\nfor all the joy we feel on your account before our God?\nNight and day we pray beyond measure to see you in person\nand to remedy the deficiencies of your faith.\nNow may God himself, our Father, and our Lord Jesus\ndirect our way to you, and may the Lord make you increase\nand abound in love for one another and for all,\njust as we have for you,\nso as to strengthen your hearts,\nto be blameless in holiness before our God and Father\nat the coming of our Lord Jesus with all his holy ones. Amen."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 90:3-5a, 12-13, 14 and 17",
              "response": "R. (14) Fill us with your love, O Lord, and we will sing for joy!",
              "content": "You turn man back to dust,\n\nsaying, \"Return, O children of men.\"\n\nFor a thousand years in your sight\n\nare as yesterday, now that it is past,\n\nor as a watch of the night.\n\nR. Fill us with your love, O Lord, and we will sing for joy!\n\nTeach us to number our days aright,\n\nthat we may gain wisdom of heart.\n\nReturn, O LORD! How long?\n\nHave pity on your servants!\n\nR. Fill us with your love, O Lord, and we will sing for joy!\n\nFill us at daybreak with your kindness,\n\nthat we may shout for joy and gladness all our days.\n\nAnd may the gracious care of the LORD our God be ours;\n\nprosper the work of our hands for us!\n\nProsper the work of our hands!\n\nR. Fill us with your love, O Lord, and we will sing for joy!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nStay awake!\nFor you do not know when the Son of Man will come.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 24:42-51",
              "content": "Jesus said to his disciples:\n\"Stay awake!\nFor you do not know on which day your Lord will come.\nBe sure of this: if the master of the house\nhad known the hour of night when the thief was coming,\nhe would have stayed awake\nand not let his house be broken into.\nSo too, you also must be prepared,\nfor at an hour you do not expect, the Son of Man will come.\n\n\"Who, then, is the faithful and prudent servant,\nwhom the master has put in charge of his household\nto distribute to them their food at the proper time?\nBlessed is that servant whom his master on his arrival finds doing so.\nAmen, I say to you, he will put him in charge of all his property.\nBut if that wicked servant says to himself, 'My master is long delayed,'\nand begins to beat his fellow servants,\nand eat and drink with drunkards,\nthe servant's master will come on an unexpected day\nand at an unknown hour and will punish him severely\nand assign him a place with the hypocrites,\nwhere there will be wailing and grinding of teeth.\""
            }
          },
          "saint_of_day": {
            "name": "Augustine",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-29": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.260Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-29": {
          "date": "2025-08-29",
          "liturgical_date": "Memorial of the Passion of Saint John the Baptist",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 4:1-8",
              "content": "Brothers and sisters,\nwe earnestly ask and exhort you in the Lord Jesus that,\nas you received from us\nhow you should conduct yourselves to please God–\nand as you are conducting yourselves–\nyou do so even more.\nFor you know what instructions we gave you through the Lord Jesus.\n\nThis is the will of God, your holiness:\nthat you refrain from immorality,\nthat each of you know how to acquire a wife for himself\nin holiness and honor, not in lustful passion\nas do the Gentiles who do not know God;\nnot to take advantage of or exploit a brother or sister in this matter,\nfor the Lord is an avenger in all these things,\nas we told you before and solemnly affirmed.\nFor God did not call us to impurity but to holiness.\nTherefore, whoever disregards this,\ndisregards not a human being but God,\nwho also gives his Holy Spirit to you."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 97:1 and 2b, 5-6, 10, 11-12",
              "response": "R. (12a) Rejoice in the Lord, you just!",
              "content": "The LORD is king; let the earth rejoice;\n\nlet the many isles be glad.\n\nJustice and judgment are the foundation of his throne.\n\nR. Rejoice in the Lord, you just!\n\nThe mountains melt like wax before the LORD,\n\nbefore the LORD of all the earth.\n\nThe heavens proclaim his justice,\n\nand all peoples see his glory.\n\nR. Rejoice in the Lord, you just!\n\nThe LORD loves those who hate evil;\n\nhe guards the lives of his faithful ones;\n\nfrom the hand of the wicked he delivers them.\n\nR. Rejoice in the Lord, you just!\n\nLight dawns for the just;\n\nand gladness, for the upright of heart.\n\nBe glad in the LORD, you just,\n\nand give thanks to his holy name.\n\nR. Rejoice in the Lord, you just!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are those who are persecuted for the sake of righteousness,\nfor theirs is the Kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:17-29",
              "content": "Herod was the one who had John the Baptist arrested and bound in prison\non account of Herodias,\nthe wife of his brother Philip, whom he had married.\nJohn had said to Herod,\n“It is not lawful for you to have your brother’s wife.”\nHerodias harbored a grudge against him\nand wanted to kill him but was unable to do so.\nHerod feared John, knowing him to be a righteous and holy man,\nand kept him in custody.\nWhen he heard him speak he was very much perplexed,\nyet he liked to listen to him.\nShe had an opportunity one day when Herod, on his birthday,\ngave a banquet for his courtiers,\nhis military officers, and the leading men of Galilee.\nHerodias’ own daughter came in\nand performed a dance that delighted Herod and his guests.\nThe king said to the girl,\n“Ask of me whatever you wish and I will grant it to you.”\nHe even swore many things to her,\n“I will grant you whatever you ask of me,\neven to half of my kingdom.”\nShe went out and said to her mother,\n“What shall I ask for?”\nShe replied, “The head of John the Baptist.”\nThe girl hurried back to the king’s presence and made her request,\n“I want you to give me at once\non a platter the head of John the Baptist.”\nThe king was deeply distressed,\nbut because of his oaths and the guests\nhe did not wish to break his word to her.\nSo he promptly dispatched an executioner with orders\nto bring back his head.\nHe went off and beheaded him in the prison.\nHe brought in the head on a platter and gave it to the girl.\nThe girl in turn gave it to her mother.\nWhen his disciples heard about it,\nthey came and took his body and laid it in a tomb."
            }
          },
          "saint_of_day": {
            "name": "Passion John Baptist",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-30": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.286Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-30": {
          "date": "2025-08-30",
          "liturgical_date": "Saturday of the Twenty-first Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 4:9-11",
              "content": "Brothers and sisters:\nOn the subject of fraternal charity\nyou have no need for anyone to write you,\nfor you yourselves have been taught by God to love one another.\nIndeed, you do this for all the brothers throughout Macedonia.\nNevertheless we urge you, brothers and sisters, to progress even more,\nand to aspire to live a tranquil life,\nto mind your own affairs,\nand to work with your own hands,\nas we instructed you."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 98:1, 7-8, 9",
              "response": "R. (9) The Lord comes to rule the earth with justice.",
              "content": "Sing to the LORD a new song,\n\nfor he has done wondrous deeds;\n\nHis right hand has won victory for him,\n\nhis holy arm.\n\nR. The Lord comes to rule the earth with justice.\n\nLet the sea and what fills it resound,\n\nthe world and those who dwell in it;\n\nLet the rivers clap their hands,\n\nthe mountains shout with them for joy.\n\nR. The Lord comes to rule the earth with justice.\n\nBefore the LORD, for he comes,\n\nfor he comes to rule the earth;\n\nHe will rule the world with justice\n\nand the peoples with equity.\n\nR. The Lord comes to rule the earth with justice."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI give you a new commandment:\nlove one another as I have loved you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 25:14-30",
              "content": "Jesus told his disciples this parable:\n\"A man going on a journey\ncalled in his servants and entrusted his possessions to them.\nTo one he gave five talents; to another, two; to a third, one–\nto each according to his ability.\nThen he went away.\nImmediately the one who received five talents went and traded with them,\nand made another five.\nLikewise, the one who received two made another two.\nBut the man who received one went off and dug a hole in the ground\nand buried his master's money.\nAfter a long time\nthe master of those servants came back and settled accounts with them.\nThe one who had received five talents\ncame forward bringing the additional five.\nHe said, 'Master, you gave me five talents.\nSee, I have made five more.'\nHis master said to him, 'Well done, my good and faithful servant.\nSince you were faithful in small matters,\nI will give you great responsibilities.\nCome, share your master's joy.'\nThen the one who had received two talents also came forward and said,\n'Master, you gave me two talents.\nSee, I have made two more.'\nHis master said to him, 'Well done, my good and faithful servant.\nSince you were faithful in small matters,\nI will give you great responsibilities.\nCome, share your master's joy.'\nThen the one who had received the one talent came forward and said,\n'Master, I knew you were a demanding person,\nharvesting where you did not plant\nand gathering where you did not scatter;\nso out of fear I went off and buried your talent in the ground.\nHere it is back.'\nHis master said to him in reply, 'You wicked, lazy servant!\nSo you knew that I harvest where I did not plant\nand gather where I did not scatter?\nShould you not then have put my money in the bank\nso that I could have got it back with interest on my return?\nNow then! Take the talent from him and give it to the one with ten.\nFor to everyone who has,\nmore will be given and he will grow rich;\nbut from the one who has not,\neven what he has will be taken away.\nAnd throw this useless servant into the darkness outside,\nwhere there will be wailing and grinding of teeth.'\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-08-31": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.286Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-08-31": {
          "date": "2025-08-31",
          "liturgical_date": "Twenty-second Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirach 3:17-18, 20, 28-29",
              "content": "My child, conduct your affairs with humility,\n and you will be loved more than a giver of gifts.\n Humble yourself the more, the greater you are,\n and you will find favor with God.\n What is too sublime for you, seek not,\n into things beyond your strength search not.\n The mind of a sage appreciates proverbs,\n and an attentive ear is the joy of the wise.\n Water quenches a flaming fire,\n and alms atone for sins."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 68:4-5, 6-7, 10-11",
              "response": "R. (cf. 11b)  God, in your goodness, you have made a home for the poor.",
              "content": "The just rejoice and exult before God;\n\nthey are glad and rejoice.\n\nSing to God, chant praise to his name;\n\nwhose name is the LORD.\n\nR. God, in your goodness, you have made a home for the poor.\n\nThe father of orphans and the defender of widows\n\nis God in his holy dwelling.\n\nGod gives a home to the forsaken;\n\nhe leads forth prisoners to prosperity.\n\nR. God, in your goodness, you have made a home for the poor.\n\nA bountiful rain you showered down, O God, upon your inheritance;\n\nyou restored the land when it languished;\n\nyour flock settled in it;\n\nin your goodness, O God, you provided it for the needy.\n\nR. God, in your goodness, you have made a home for the poor."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nTake my yoke upon you, says the Lord,\nand learn from me, for I am meek and humble of heart.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 14:1, 7-14",
              "content": "On a sabbath Jesus went to dine\nat the home of one of the leading Pharisees,\nand the people there were observing him carefully.\n\nHe told a parable to those who had been invited,\nnoticing how they were choosing the places of honor at the table.\n\"When you are invited by someone to a wedding banquet,\ndo not recline at table in the place of honor.\nA more distinguished guest than you may have been invited by him,\nand the host who invited both of you may approach you and say,\n'Give your place to this man,'\nand then you would proceed with embarrassment\nto take the lowest place.\nRather, when you are invited,\ngo and take the lowest place\nso that when the host comes to you he may say,\n'My friend, move up to a higher position.'\nThen you will enjoy the esteem of your companions at the table.\nFor every one who exalts himself will be humbled,\nbut the one who humbles himself will be exalted.\"\nThen he said to the host who invited him,\n\"When you hold a lunch or a dinner,\ndo not invite your friends or your brothers\nor your relatives or your wealthy neighbors,\nin case they may invite you back and you have repayment.\nRather, when you hold a banquet,\ninvite the poor, the crippled, the lame, the blind;\nblessed indeed will you be because of their inability to repay you.\nFor you will be repaid at the resurrection of the righteous.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    }
  }
}