{
  "meta": {
    "version": "1.0",
    "month": 5,
    "month_name": "may",
    "year": 2025,
    "total_days": 31
  },
  "daily_readings": {
    "2025-05-01": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:35.910Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-01": {
          "date": "2025-05-01",
          "liturgical_date": "Thursday of the Second Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 5:27-33",
              "content": "When the court officers had brought the Apostles in\nand made them stand before the Sanhedrin,\nthe high priest questioned them,\n\"We gave you strict orders did we not,\nto stop teaching in that name.\nYet you have filled Jerusalem with your teaching\nand want to bring this man's blood upon us.\"\nBut Peter and the Apostles said in reply,\n\"We must obey God rather than men.\nThe God of our ancestors raised Jesus,\nthough you had him killed by hanging him on a tree.\nGod exalted him at his right hand as leader and savior\nto grant Israel repentance and forgiveness of sins.\nWe are witnesses of these things,\nas is the Holy Spirit whom God has given to those who obey him.\"\n\nWhen they heard this,\nthey became infuriated and wanted to put them to death."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 34:2 and 9, 17-18, 19-20",
              "response": "R. (7a) The Lord hears the cry of the poor.",
              "content": "or:\n\nR. Alleluia.\n\nI will bless the LORD at all times;\n\nhis praise shall be ever in my mouth.\n\nTaste and see how good the LORD is;\n\nblessed the man who takes refuge in him.\n\nR. The Lord hears the cry of the poor.\n\nor:\n\nR. Alleluia.\n\nThe LORD confronts the evildoers,\n\nto destroy remembrance of them from the earth.\n\nWhen the just cry out, the LORD hears them,\n\nand from all their distress he rescues them.\n\nR. The Lord hears the cry of the poor.\n\nor:\n\nR. Alleluia.\n\nThe LORD is close to the brokenhearted;\n\nand those who are crushed in spirit he saves.\n\nMany are the troubles of the just man,\n\nbut out of them all the LORD delivers him.\n\nR. The Lord hears the cry of the poor.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYou believe in me, Thomas, because you have seen me, says the Lord;\nblessed are those who have not seen, but still believe!\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 3:31-36",
              "content": "The one who comes from above is above all.\nThe one who is of the earth is earthly and speaks of earthly things.\nBut the one who comes from heaven is above all.\nHe testifies to what he has seen and heard,\nbut no one accepts his testimony.\nWhoever does accept his testimony certifies that God is trustworthy.\nFor the one whom God sent speaks the words of God.\nHe does not ration his gift of the Spirit.\nThe Father loves the Son and has given everything over to him.\nWhoever believes in the Son has eternal life,\nbut whoever disobeys the Son will not see life,\nbut the wrath of God remains upon him."
            }
          },
          "saint_of_day": {
            "name": "Joseph Worker",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-02": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.338Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-02": {
          "date": "2025-05-02",
          "liturgical_date": "Memorial of Saint Athanasius, Bishop and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 5:34-42",
              "content": "A Pharisee in the Sanhedrin named Gamaliel,\na teacher of the law, respected by all the people,\nstood up, ordered the Apostles to be put outside for a short time,\nand said to the Sanhedrin, \"Fellow children of Israel,\nbe careful what you are about to do to these men.\nSome time ago, Theudas appeared, claiming to be someone important,\nand about four hundred men joined him, but he was killed,\nand all those who were loyal to him\nwere disbanded and came to nothing.\nAfter him came Judas the Galilean at the time of the census.\nHe also drew people after him,\nbut he too perished and all who were loyal to him were scattered.\nSo now I tell you,\nhave nothing to do with these men, and let them go.\nFor if this endeavor or this activity is of human origin,\nit will destroy itself.\nBut if it comes from God, you will not be able to destroy them;\nyou may even find yourselves fighting against God.\"\nThey were persuaded by him.\nAfter recalling the Apostles, they had them flogged,\nordered them to stop speaking in the name of Jesus,\nand dismissed them.\nSo they left the presence of the Sanhedrin,\nrejoicing that they had been found worthy\nto suffer dishonor for the sake of the name.\nAnd all day long, both at the temple and in their homes,\nthey did not stop teaching and proclaiming the Christ, Jesus."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 27:1, 4, 13-14",
              "response": "R. (see 4abc) One thing I seek: to dwell in the house of the Lord.",
              "content": "or:\n\nR. Alleluia.\n\nThe LORD is my light and my salvation;\n\nwhom should I fear?\n\nThe LORD is my life's refuge;\n\nof whom should I be afraid?\n\nR. One thing I seek: to dwell in the house of the Lord.\n\nor:\n\nR. Alleluia.\n\nOne thing I ask of the LORD\n\nthis I seek:\n\nTo dwell in the house of the LORD\n\nall the days of my life,\n\nThat I may gaze on the loveliness of the LORD\n\nand contemplate his temple.\n\nR. One thing I seek: to dwell in the house of the Lord.\n\nor:\n\nR. Alleluia.\n\nI believe that I shall see the bounty of the LORD\n\nin the land of the living.\n\nWait for the LORD with courage;\n\nbe stouthearted, and wait for the LORD.\n\nR. One thing I seek: to dwell in the house of the Lord.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOne does not live on bread alone,\nbut on every word that comes forth from the mouth of God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:1-15",
              "content": "Jesus went across the Sea of Galilee.\nA large crowd followed him,\nbecause they saw the signs he was performing on the sick.\nJesus went up on the mountain,\nand there he sat down with his disciples.\nThe Jewish feast of Passover was near.\nWhen Jesus raised his eyes and saw that a large crowd was coming to him,\nhe said to Philip, \"Where can we buy enough food for them to eat?\"\nHe said this to test him,\nbecause he himself knew what he was going to do.\nPhilip answered him,\n\"Two hundred days' wages worth of food would not be enough\nfor each of them to have a little.\"\nOne of his disciples,\nAndrew, the brother of Simon Peter, said to him,\n\"There is a boy here who has five barley loaves and two fish;\nbut what good are these for so many?\"\nJesus said, \"Have the people recline.\"\nNow there was a great deal of grass in that place.\nSo the men reclined, about five thousand in number.\nThen Jesus took the loaves, gave thanks,\nand distributed them to those who were reclining,\nand also as much of the fish as they wanted.\nWhen they had had their fill, he said to his disciples,\n\"Gather the fragments left over,\nso that nothing will be wasted.\"\nSo they collected them,\nand filled twelve wicker baskets with fragments\nfrom the five barley loaves that had been more than they could eat.\nWhen the people saw the sign he had done, they said,\n\"This is truly the Prophet, the one who is to come into the world.\"\nSince Jesus knew that they were going to come and carry him off\nto make him king,\nhe withdrew again to the mountain alone."
            }
          },
          "saint_of_day": {
            "name": "Athanasius",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-03": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:35.917Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-03": {
          "date": "2025-05-03",
          "liturgical_date": "Feast of Saints Philip and James, Apostles",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Corinthians 15:1-8",
              "content": "I am reminding you, brothers and sisters,\nof the Gospel I preached to you,\nwhich you indeed received and in which you also stand.\nThrough it you are also being saved,\nif you hold fast to the word I preached to you,\nunless you believed in vain.\nFor I handed on to you as of first importance what I also received:\nthat Christ died for our sins\nin accordance with the Scriptures;\nthat he was buried;\nthat he was raised on the third day\nin accordance with the Scriptures;\nthat he appeared to Cephas, then to the Twelve.\nAfter that, he appeared to more\nthan five hundred brothers and sisters at once,\nmost of whom are still living,\nthough some have fallen asleep.\nAfter that he appeared to James,\nthen to all the Apostles.\nLast of all, as to one born abnormally,\nhe appeared to me."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 19:2-3, 4-5",
              "response": "R. (5)  Their message goes out through all the earth.",
              "content": "or:\n\nR. Alleluia.\n\nThe heavens declare the glory of God;\n\nand the firmament proclaims his handiwork.\n\nDay pours out the word to day;\n\nand night to night imparts knowledge.\n\nR. Their message goes out through all the earth.\n\nor:\n\nR. Alleluia.\n\nNot a word nor a discourse\n\nwhose voice is not heard;\n\nThrough all the earth their voice resounds,\n\nand to the ends of the world, their message.\n\nR. Their message goes out through all the earth.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way, the truth, and the life, says the Lord;\nPhilip, whoever has seen me has seen the Father.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:6-14",
              "content": "Jesus said to Thomas, \"I am the way and the truth and the life.\nNo one comes to the Father except through me.\nIf you know me, then you will also know my Father.\nFrom now on you do know him and have seen him.\"\nPhilip said to him,\n\"Master, show us the Father, and that will be enough for us.\"\nJesus said to him, \"Have I been with you for so long a time\nand you still do not know me, Philip?\nWhoever has seen me has seen the Father.\nHow can you say, 'Show us the Father'?\nDo you not believe that I am in the Father and the Father is in me?\nThe words that I speak to you I do not speak on my own.\nThe Father who dwells in me is doing his works.\nBelieve me that I am in the Father and the Father is in me,\nor else, believe because of the works themselves.\nAmen, amen, I say to you,\nwhoever believes in me will do the works that I do,\nand will do greater ones than these,\nbecause I am going to the Father.\nAnd whatever you ask in my name, I will do,\nso that the Father may be glorified in the Son.\nIf you ask anything of me in my name, I will do it.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-04": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.083Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-04": {
          "date": "2025-05-04",
          "liturgical_date": "Third Sunday of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 5:27-32, 40b-41",
              "content": "When the captain and the court officers had brought the apostles inand made them stand before the Sanhedrin,the high priest questioned them,\"We gave you strict orders, did we not,to stop teaching in that name?Yet you have filled Jerusalem with your teachingand want to bring this man's blood upon us.\"But Peter and the apostles said in reply,\"We must obey God rather than men.The God of our ancestors raised Jesus,though you had him killed by hanging him on a tree.God exalted him at his right hand as leader and saviorto grant Israel repentance and forgiveness of sins.We are witnesses of these things,as is the Holy Spirit whom God has given to those who obey him.\"The Sanhedrin ordered the apostlesto stop speaking in the name of Jesus, and dismissed them.So they left the presence of the Sanhedrin,rejoicing that they had been found worthyto suffer dishonor for the sake of the name."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 30:2, 4, 5-6, 11-12, 13",
              "response": "R. (2a) I will praise you, Lord, for you have rescued me.",
              "content": "or:\n\nR. Alleluia.\n\nI will extol you, O LORD, for you drew me clear\n\nand did not let my enemies rejoice over me.\n\nO LORD, you brought me up from the netherworld;\n\nyou preserved me from among those going down into the pit.\n\nR. I will praise you, Lord, for you have rescued me.\n\nor:\n\nR. Alleluia.\n\nSing praise to the LORD, you his faithful ones,\n\nand give thanks to his holy name.\n\nFor his anger lasts but a moment;\n\na lifetime, his good will.\n\nAt nightfall, weeping enters in,\n\nbut with the dawn, rejoicing.\n\nR. I will praise you, Lord, for you have rescued me.\n\nor:\n\nR. Alleluia.\n\nHear, O LORD, and have pity on me;\n\nO LORD, be my helper.\n\nYou changed my mourning into dancing;\n\nO LORD, my God, forever will I give you thanks.\n\nR. I will praise you, Lord, for you have rescued me.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nChrist is risen, creator of all;\nhe has shown pity on all people.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 21:1-19",
              "content": "At that time, Jesus revealed himself again to his disciples at the Sea of Tiberias.He revealed himself in this way.Together were Simon Peter, Thomas called Didymus,Nathanael from Cana in Galilee,Zebedee's sons, and two others of his disciples.Simon Peter said to them, \"I am going fishing.\"They said to him, \"We also will come with you.\"So they went out and got into the boat,but that night they caught nothing.When it was already dawn, Jesus was standing on the shore;but the disciples did not realize that it was Jesus.Jesus said to them, \"Children, have you caught anything to eat?\"They answered him, \"No.\"So he said to them, \"Cast the net over the right side of the boatand you will find something.\"So they cast it, and were not able to pull it inbecause of the number of fish.So the disciple whom Jesus loved said to Peter, \"It is the Lord.\"When Simon Peter heard that it was the Lord,he tucked in his garment, for he was lightly clad,and jumped into the sea.The other disciples came in the boat,for they were not far from shore, only about a hundred yards,dragging the net with the fish.When they climbed out on shore,they saw a charcoal fire with fish on it and bread.Jesus said to them, \"Bring some of the fish you just caught.\"So Simon Peter went over and dragged the net ashorefull of one hundred fifty-three large fish.Even though there were so many, the net was not torn.Jesus said to them, \"Come, have breakfast.\"And none of the disciples dared to ask him, \"Who are you?\"because they realized it was the Lord.Jesus came over and took the bread and gave it to them,and in like manner the fish.This was now the third time Jesus was revealed to his disciplesafter being raised from the dead.\n\nWhen they had finished breakfast, Jesus said to Simon Peter,\"Simon, son of John, do you love me more than these?\"Simon Peter answered him, \"Yes, Lord, you know that I love you.\"Jesus said to him, \"Feed my lambs.\"He then said to Simon Peter a second time,\"Simon, son of John, do you love me?\"Simon Peter answered him, \"Yes, Lord, you know that I love you.\"Jesus said to him, \"Tend my sheep.\"Jesus said to him the third time,\"Simon, son of John, do you love me?\"Peter was distressed that Jesus had said to him a third time,\"Do you love me?\" and he said to him,\"Lord, you know everything; you know that I love you.\"Jesus said to him, \"Feed my sheep.Amen, amen, I say to you, when you were younger,you used to dress yourself and go where you wanted;but when you grow old, you will stretch out your hands,and someone else will dress youand lead you where you do not want to go.\"He said this signifying by what kind of death he would glorify God.And when he had said this, he said to him, \"Follow me.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-05": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.453Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-05": {
          "date": "2025-05-05",
          "liturgical_date": "Monday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 6:8-15",
              "content": "Stephen, filled with grace and power,\nwas working great wonders and signs among the people.\nCertain members of the so-called Synagogue of Freedmen,\nCyreneans, and Alexandrians,\nand people from Cilicia and Asia,\ncame forward and debated with Stephen,\nbut they could not withstand the wisdom and the Spirit with which he spoke.\nThen they instigated some men to say,\n\"We have heard him speaking blasphemous words\nagainst Moses and God.\"\nThey stirred up the people, the elders, and the scribes,\naccosted him, seized him,\nand brought him before the Sanhedrin.\nThey presented false witnesses who testified,\n\"This man never stops saying things against this holy place and the law.\nFor we have heard him claim\nthat this Jesus the Nazorean will destroy this place\nand change the customs that Moses handed down to us.\"\nAll those who sat in the Sanhedrin looked intently at him\nand saw that his face was like the face of an angel."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 119:23-24, 26-27, 29-30",
              "response": "R. (1ab) Blessed are they who follow the law of the Lord!",
              "content": "or:\n\nR. Alleluia.\n\nThough princes meet and talk against me,\n\nyour servant meditates on your statutes.\n\nYes, your decrees are my delight;\n\nthey are my counselors.\n\nR. Blessed are they who follow the law of the Lord!\n\nor:\n\nR. Alleluia.\n\nI declared my ways, and you answered me;\n\nteach me your statutes.\n\nMake me understand the way of your precepts,\n\nand I will meditate on your wondrous deeds.\n\nR. Blessed are they who follow the law of the Lord!\n\nor:\n\nR. Alleluia.\n\nRemove from me the way of falsehood,\n\nand favor me with your law.\n\nThe way of truth I have chosen;\n\nI have set your ordinances before me.\n\nR. Blessed are they who follow the law of the Lord!\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOne does not live on bread alone\nbut on every word that comes forth from the mouth of God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:22-29",
              "content": "[After Jesus had fed the five thousand men, his disciples saw him walking on the sea.]\nThe next day, the crowd that remained across the sea\nsaw that there had been only one boat there,\nand that Jesus had not gone along with his disciples in the boat,\nbut only his disciples had left.\nOther boats came from Tiberias\nnear the place where they had eaten the bread\nwhen the Lord gave thanks.\nWhen the crowd saw that neither Jesus nor his disciples were there,\nthey themselves got into boats\nand came to Capernaum looking for Jesus.\nAnd when they found him across the sea they said to him,\n\"Rabbi, when did you get here?\"\nJesus answered them and said,\n\"Amen, amen, I say to you, you are looking for me\nnot because you saw signs\nbut because you ate the loaves and were filled.\nDo not work for food that perishes\nbut for the food that endures for eternal life,\nwhich the Son of Man will give you.\nFor on him the Father, God, has set his seal.\"\nSo they said to him,\n\"What can we do to accomplish the works of God?\"\nJesus answered and said to them,\n\"This is the work of God, that you believe in the one he sent.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-06": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.453Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-06": {
          "date": "2025-05-06",
          "liturgical_date": "Tuesday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 31:3cd-4, 6 and 7b and 8a, 17 and 21ab",
              "response": "R.    (6a)  Into your hands, O Lord, I commend my spirit.",
              "content": "or:\n\nR.    Alleluia.\n\nBe my rock of refuge,\n\na stronghold to give me safety.\n\nYou are my rock and my fortress;\n\nfor your name’s sake you will lead and guide me.\n\nR.    Into your hands, O Lord, I commend my spirit.\n\nor:\n\nR.    Alleluia.\n\nInto your hands I commend my spirit;\n\nyou will redeem me, O LORD, O faithful God.\n\nMy trust is in the LORD;\n\nI will rejoice and be glad of your mercy.\n\nR.    Into your hands, O Lord, I commend my spirit.\n\nor:\n\nR.    Alleluia.\n\nLet your face shine upon your servant;\n\nsave me in your kindness.\n\nYou hide them in the shelter of your presence\n\nfrom the plottings of men.\n\nR.    Into your hands, O Lord, I commend my spirit.\n\nor:\n\nR.    Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the bread of life, says the Lord;\nwhoever comes to me will never hunger.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:30-35",
              "content": "The crowd said to Jesus:\n“What sign can you do, that we may see and believe in you?\nWhat can you do?\nOur ancestors ate manna in the desert, as it is written:\n\nHe gave them bread from heaven to eat.”\n\nSo Jesus said to them,\n“Amen, amen, I say to you,\nit was not Moses who gave the bread from heaven;\nmy Father gives you the true bread from heaven. \nFor the bread of God is that which comes down from heaven\nand gives life to the world.”\n\nSo they said to Jesus,\n“Sir, give us this bread always.” \nJesus said to them, “I am the bread of life;\nwhoever comes to me will never hunger,\nand whoever believes in me will never thirst.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-07": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.453Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-07": {
          "date": "2025-05-07",
          "liturgical_date": "Wednesday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 8:1b-8",
              "content": "There broke out a severe persecution of the Church in Jerusalem,\nand all were scattered\nthroughout the countryside of Judea and Samaria,\nexcept the Apostles.\nDevout men buried Stephen and made a loud lament over him.\nSaul, meanwhile, was trying to destroy the Church;\nentering house after house and dragging out men and women,\nhe handed them over for imprisonment.\n\nNow those who had been scattered went about preaching the word.\nThus Philip went down to the city of Samaria\nand proclaimed the Christ to them.\nWith one accord, the crowds paid attention to what was said by Philip\nwhen they heard it and saw the signs he was doing.\nFor unclean spirits, crying out in a loud voice,\ncame out of many possessed people,\nand many paralyzed and crippled people were cured.\nThere was great joy in that city."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 66:1-3a, 4-5, 6-7a",
              "response": "R. (1) Let all the earth cry out to God with joy.",
              "content": "or:\n\nR. Alleluia.\n\nShout joyfully to God, all the earth,\n\nsing praise to the glory of his name;\n\nproclaim his glorious praise.\n\nSay to God, \"How tremendous are your deeds!\"\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\n\"Let all on earth worship and sing praise to you,\n\nsing praise to your name!\"\n\nCome and see the works of God,\n\nhis tremendous deeds among the children of Adam.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\nHe has changed the sea into dry land;\n\nthrough the river they passed on foot;\n\ntherefore let us rejoice in him.\n\nHe rules by his might forever.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nEveryone who believes in the Son has eternal life,\nand I shall raise him up on the last day, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:35-40",
              "content": "Jesus said to the crowds,\n\"I am the bread of life;\nwhoever comes to me will never hunger,\nand whoever believes in me will never thirst.\nBut I told you that although you have seen me,\nyou do not believe.\nEverything that the Father gives me will come to me,\nand I will not reject anyone who comes to me,\nbecause I came down from heaven not to do my own will\nbut the will of the one who sent me.\nAnd this is the will of the one who sent me,\nthat I should not lose anything of what he gave me,\nbut that I should raise it on the last day.\nFor this is the will of my Father,\nthat everyone who sees the Son and believes in him\nmay have eternal life,\nand I shall raise him on the last day.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-08": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.995Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-08": {
          "date": "2025-05-08",
          "liturgical_date": "Thursday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 8:26-40",
              "content": "The angel of the Lord spoke to Philip,\n\"Get up and head south on the road\nthat goes down from Jerusalem to Gaza, the desert route.\"\nSo he got up and set out.\nNow there was an Ethiopian eunuch,\na court official of the Candace,\nthat is, the queen of the Ethiopians,\nin charge of her entire treasury,\nwho had come to Jerusalem to worship, and was returning home.\nSeated in his chariot, he was reading the prophet Isaiah.\nThe Spirit said to Philip,\n\"Go and join up with that chariot.\"\nPhilip ran up and heard him reading Isaiah the prophet and said,\n\"Do you understand what you are reading?\"\nHe replied,\n\"How can I, unless someone instructs me?\"\nSo he invited Philip to get in and sit with him.\nThis was the Scripture passage he was reading:\n\nLike a sheep he was led to the slaughter,\nand as a lamb before its shearer is silent,\nso he opened not his mouth.\nIn his humiliation justice was denied him.\nWho will tell of his posterity?\nFor his life is taken from the earth.\n\nThen the eunuch said to Philip in reply,\n\"I beg you, about whom is the prophet saying this?\nAbout himself, or about someone else?\"\nThen Philip opened his mouth and, beginning with this Scripture passage,\nhe proclaimed Jesus to him.\nAs they traveled along the road\nthey came to some water,\nand the eunuch said, \"Look, there is water.\nWhat is to prevent my being baptized?\"\nThen he ordered the chariot to stop,\nand Philip and the eunuch both went down into the water,\nand he baptized him.\nWhen they came out of the water,\nthe Spirit of the Lord snatched Philip away,\nand the eunuch saw him no more,\nbut continued on his way rejoicing.\nPhilip came to Azotus, and went about proclaiming the good news\nto all the towns until he reached Caesarea."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 66:8-9, 16-17, 20",
              "response": "R.(1) Let all the earth cry out to God with joy.",
              "content": "or:\n\nR. Alleluia.\n\nBless our God, you peoples,\n\nloudly sound his praise;\n\nHe has given life to our souls,\n\nand has not let our feet slip.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\nHear now, all you who fear God, while I declare\n\nwhat he has done for me.\n\nWhen I appealed to him in words,\n\npraise was on the tip of my tongue.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\nBlessed be God who refused me not\n\nmy prayer or his kindness!\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the living bread that came down from heaven, says the Lord;\nwhoever eats this bread will live forever.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:44-51",
              "content": "Jesus said to the crowds:\n\"No one can come to me unless the Father who sent me draw him,\nand I will raise him on the last day.\nIt is written in the prophets:\n\nThey shall all be taught by God.\n\nEveryone who listens to my Father and learns from him comes to me.\nNot that anyone has seen the Father\nexcept the one who is from God;\nhe has seen the Father.\nAmen, amen, I say to you,\nwhoever believes has eternal life.\nI am the bread of life.\nYour ancestors ate the manna in the desert, but they died;\nthis is the bread that comes down from heaven\nso that one may eat it and not die.\nI am the living bread that came down from heaven;\nwhoever eats this bread will live forever;\nand the bread that I will give\nis my Flesh for the life of the world.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-09": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.097Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-09": {
          "date": "2025-05-09",
          "liturgical_date": "Friday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 9:1-20",
              "content": "Saul, still breathing murderous threats against the disciples of the Lord,\nwent to the high priest and asked him\nfor letters to the synagogues in Damascus, that,\nif he should find any men or women who belonged to the Way,\nhe might bring them back to Jerusalem in chains.\nOn his journey, as he was nearing Damascus,\na light from the sky suddenly flashed around him.\nHe fell to the ground and heard a voice saying to him,\n\"Saul, Saul, why are you persecuting me?\"\nHe said, \"Who are you, sir?\"\nThe reply came, \"I am Jesus, whom you are persecuting.\nNow get up and go into the city and you will be told what you must do.\"\nThe men who were traveling with him stood speechless,\nfor they heard the voice but could see no one.\nSaul got up from the ground,\nbut when he opened his eyes he could see nothing;\nso they led him by the hand and brought him to Damascus.\nFor three days he was unable to see, and he neither ate nor drank.\n\nThere was a disciple in Damascus named Ananias,\nand the Lord said to him in a vision, \"Ananias.\"\nHe answered, \"Here I am, Lord.\"\nThe Lord said to him, \"Get up and go to the street called Straight\nand ask at the house of Judas for a man from Tarsus named Saul.\nHe is there praying,\nand in a vision he has seen a man named Ananias\ncome in and lay his hands on him,\nthat he may regain his sight.\"\nBut Ananias replied,\n\"Lord, I have heard from many sources about this man,\nwhat evil things he has done to your holy ones in Jerusalem.\nAnd here he has authority from the chief priests\nto imprison all who call upon your name.\"\nBut the Lord said to him,\n\"Go, for this man is a chosen instrument of mine\nto carry my name before Gentiles, kings, and children of Israel,\nand I will show him what he will have to suffer for my name.\"\nSo Ananias went and entered the house;\nlaying his hands on him, he said,\n\"Saul, my brother, the Lord has sent me,\nJesus who appeared to you on the way by which you came,\nthat you may regain your sight and be filled with the Holy Spirit.\"\nImmediately things like scales fell from his eyes\nand he regained his sight.\nHe got up and was baptized,\nand when he had eaten, he recovered his strength.\n\nHe stayed some days with the disciples in Damascus,\nand he began at once to proclaim Jesus in the synagogues,\nthat he is the Son of God."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 117:1bc, 2",
              "response": "R. (Mark 16:15) Go out to all the world and tell the Good News.",
              "content": "or:\n\nR. Alleluia.\n\nPraise the LORD, all you nations;\n\nglorify him, all you peoples!\n\nR. Go out to all the world and tell the Good News.\n\nor:\n\nR. Alleluia.\n\nFor steadfast is his kindness toward us,\n\nand the fidelity of the LORD endures forever.\n\nR. Go out to all the world and tell the Good News.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhoever eats my Flesh and drinks my Blood,\nremains in me and I in him, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:52-59",
              "content": "The Jews quarreled among themselves, saying,\n“How can this man give us his Flesh to eat?”\nJesus said to them,\n“Amen, amen, I say to you,\nunless you eat the Flesh of the Son of Man and drink his Blood,\nyou do not have life within you.\nWhoever eats my Flesh and drinks my Blood\nhas eternal life,\nand I will raise him on the last day.\nFor my Flesh is true food,\nand my Blood is true drink.\nWhoever eats my Flesh and drinks my Blood\nremains in me and I in him.\nJust as the living Father sent me\nand I have life because of the Father,\nso also the one who feeds on me will have life because of me.\nThis is the bread that came down from heaven.\nUnlike your ancestors who ate and still died,\nwhoever eats this bread will live forever.”\nThese things he said while teaching in the synagogue in Capernaum."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-10": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.386Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-10": {
          "date": "2025-05-10",
          "liturgical_date": "Saturday of the Third Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 116:12-13, 14-15, 16-17",
              "response": "R.    (12) How shall I make a return to the Lord for all the good he has done for me?",
              "content": "or:\n\nR.    Alleluia.\n\nHow shall I make a return to the LORD\n\nfor all the good he has done for me?\n\nThe cup of salvation I will take up,\n\nand I will call upon the name of the LORD\n\nR.    How shall I make a return to the Lord for all the good he has done for me?\n\nor:\n\nR.    Alleluia.\n\nMy vows to the LORD I will pay\n\nin the presence of all his people.\n\nPrecious in the eyes of the LORD\n\nis the death of his faithful ones.\n\nR.    How shall I make a return to the Lord for all the good he has done for me?\n\nor:\n\nR.    Alleluia.\n\nO LORD, I am your servant;\n\nI am your servant, the son of your handmaid;\n\nyou have loosed my bonds.\n\nTo you will I offer sacrifice of thanksgiving,\n\nand I will call upon the name of the LORD.\n\nR.    How shall I make a return to the Lord for all the good he has done for me?\n\nor:\n\nR.    Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life;\nyou have the words of everlasting life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 6:60-69",
              "content": "Many of the disciples of Jesus who were listening said,\n“This saying is hard; who can accept it?”\nSince Jesus knew that his disciples were murmuring about this,\nhe said to them, “Does this shock you?\nWhat if you were to see the Son of Man ascending to where he was before?\nIt is the Spirit that gives life, while the flesh is of no avail.\nThe words I have spoken to you are Spirit and life.\nBut there are some of you who do not believe.”\nJesus knew from the beginning the ones who would not believe\nand the one who would betray him.\nAnd he said, “For this reason I have told you that no one can come to me\nunless it is granted him by my Father.”\n\nAs a result of this,\nmany of his disciples returned to their former way of life\nand no longer walked with him.\nJesus then said to the Twelve, “Do you also want to leave?”\nSimon Peter answered him, “Master, to whom shall we go?\nYou have the words of eternal life.\nWe have come to believe\nand are convinced that you are the Holy One of God.”"
            }
          },
          "saint_of_day": {
            "name": "Optional Memorial of John of Avila, Priest and Doctor of the Church",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-11": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:36.778Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-11": {
          "date": "2025-05-11",
          "liturgical_date": "Fourth Sunday of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 13:14, 43-52",
              "content": "Paul and Barnabas continued on from Perga\nand reached Antioch in Pisidia.\nOn the sabbath they entered the synagogue and took their seats.\nMany Jews and worshipers who were converts to Judaism\nfollowed Paul and Barnabas, who spoke to them\nand urged them to remain faithful to the grace of God.\n\nOn the following sabbath almost the whole city gathered\nto hear the word of the Lord.\nWhen the Jews saw the crowds, they were filled with jealousy\nand with violent abuse contradicted what Paul said.\nBoth Paul and Barnabas spoke out boldly and said,\n“It was necessary that the word of God be spoken to you first,\nbut since you reject it\nand condemn yourselves as unworthy of eternal life,\nwe now turn to the Gentiles.\nFor so the Lord has commanded us,\nI have made you a light to the Gentiles,\nthat you may be an instrument of salvation\nto the ends of the earth.”\n\nThe Gentiles were delighted when they heard this\nand glorified the word of the Lord.\nAll who were destined for eternal life came to believe,\nand the word of the Lord continued to spread\nthrough the whole region.\nThe Jews, however, incited the women of prominence who were worshipers\nand the leading men of the city,\nstirred up a persecution against Paul and Barnabas,\nand expelled them from their territory.\nSo they shook the dust from their feet in protest against them,\nand went to Iconium.\nThe disciples were filled with joy and the Holy Spirit."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 100:1-2, 3, 5",
              "response": "R.(3c) We are his people, the sheep of his flock.",
              "content": "or:\n\nR. Alleluia.\n\nSing joyfully to the LORD, all you lands;\n\nserve the LORD with gladness;\n\ncome before him with joyful song.\n\nR. We are his people, the sheep of his flock.\n\nor:\n\nR. Alleluia.\n\nKnow that the LORD is God;\n\nhe made us, his we are;\n\nhis people, the flock he tends.\n\nR.We are his people, the sheep of his flock.\n\nor:\n\nR. Alleluia.\n\nThe LORD is good:\n\nhis kindness endures forever,\n\nand his faithfulness, to all generations.\n\nR.We are his people, the sheep of his flock.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the good shepherd, says the Lord;\nI know my sheep, and mine know me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 10:27-30",
              "content": "Jesus said:\n“My sheep hear my voice;\nI know them, and they follow me.\nI give them eternal life, and they shall never perish.\nNo one can take them out of my hand.\nMy Father, who has given them to me, is greater than all,\nand no one can take them out of the Father’s hand.\nThe Father and I are one.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-12": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.269Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-12": {
          "date": "2025-05-12",
          "liturgical_date": "Monday of the Fourth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 42:2-3; 43:3, 4",
              "response": "R. (see 3a) Athirst is my soul for the living God.",
              "content": "or:\n\nR. Alleluia.\n\nAs the hind longs for the running waters,\n\nso my soul longs for you, O God.\n\nAthirst is my soul for God, the living God.\n\nWhen shall I go and behold the face of God?\n\nR. Athirst is my soul for the living God.\n\nor:\n\nR. Alleluia.\n\nSend forth your light and your fidelity;\n\nthey shall lead me on\n\nAnd bring me to your holy mountain,\n\nto your dwelling-place.\n\nR. Athirst is my soul for the living God.\n\nor:\n\nR. Alleluia.\n\nThen will I go in to the altar of God,\n\nthe God of my gladness and joy;\n\nThen will I give you thanks upon the harp,\n\nO God, my God!\n\nR. Athirst is my soul for the living God.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the good shepherd, says the Lord;\nI know my sheep, and mine know me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 10:1-10",
              "content": "Jesus said:\n“Amen, amen, I say to you,\nwhoever does not enter a sheepfold through the gate\nbut climbs over elsewhere is a thief and a robber.\nBut whoever enters through the gate is the shepherd of the sheep.\nThe gatekeeper opens it for him, and the sheep hear his voice,\nas the shepherd calls his own sheep by name and leads them out.\nWhen he has driven out all his own,\nhe walks ahead of them, and the sheep follow him,\nbecause they recognize his voice.\nBut they will not follow a stranger;\nthey will run away from him,\nbecause they do not recognize the voice of strangers.”\nAlthough Jesus used this figure of speech,\nthe Pharisees did not realize what he was trying to tell them.\n\nSo Jesus said again, “Amen, amen, I say to you,\nI am the gate for the sheep.\nAll who came before me are thieves and robbers,\nbut the sheep did not listen to them.\nI am the gate.\nWhoever enters through me will be saved,\nand will come in and go out and find pasture.\nA thief comes only to steal and slaughter and destroy;\nI came so that they might have life and have it more abundantly.”"
            }
          },
          "saint_of_day": {
            "name": "Nereus Achilleus",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-13": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.386Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-13": {
          "date": "2025-05-13",
          "liturgical_date": "Tuesday of the Fourth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 87:1b-3, 4-5, 6-7",
              "response": "R.    (117:1a)  All you nations, praise the Lord.",
              "content": "or:\n\nR.    Alleluia.\n\nHis foundation upon the holy mountains\n\nthe LORD loves:\n\nThe gates of Zion,\n\nmore than any dwelling of Jacob.\n\nGlorious things are said of you,\n\nO city of God!\n\nR.    All you nations, praise the Lord.\n\nor:\n\nR.    Alleluia.\n\nI tell of Egypt and Babylon\n\namong those who know the LORD;\n\nOf Philistia, Tyre, Ethiopia:\n\n“This man was born there.”\n\nAnd of Zion they shall say:\n\n“One and all were born in her;\n\nAnd he who has established her\n\nis the Most High LORD.”\n\nR.    All you nations, praise the Lord.\n\nor:\n\nR.    Alleluia.\n\nThey shall note, when the peoples are enrolled:\n\n“This man was born there.”\n\nAnd all shall sing, in their festive dance:\n\n“My home is within you.”\n\nR.    All you nations, praise the Lord.\n\nor:\n\nR.    Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 10:22-30",
              "content": "The feast of the Dedication was taking place in Jerusalem.\nIt was winter. \nAnd Jesus walked about in the temple area on the Portico of Solomon. \nSo the Jews gathered around him and said to him,\n“How long are you going to keep us in suspense? \nIf you are the Christ, tell us plainly.” \nJesus answered them, “I told you and you do not believe.\nThe works I do in my Father’s name testify to me.\nBut you do not believe, because you are not among my sheep.\nMy sheep hear my voice;\nI know them, and they follow me. \nI give them eternal life, and they shall never perish. \nNo one can take them out of my hand. \nMy Father, who has given them to me, is greater than all,\nand no one can take them out of the Father’s hand. \nThe Father and I are one.”"
            }
          },
          "saint_of_day": {
            "name": "Our Lady Fatima",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-14": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.199Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-14": {
          "date": "2025-05-14",
          "liturgical_date": "Feast of Saint Matthias, Apostle",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 113:1-2, 3-4, 5-6, 7-8",
              "response": "R.        (8)  The Lord will give him a seat with the leaders of his people.",
              "content": "or:\n\nR.        Alleluia.\n\nPraise, you servants of the LORD,\n\npraise the name of the LORD.\n\nBlessed be the name of the LORD\n\nboth now and forever.\n\nR.        The Lord will give him a seat with the leaders of his people.\n\nor:\n\nR.        Alleluia.\n\nFrom the rising to the setting of the sun\n\nis the name of the LORD to be praised.\n\nHigh above all nations is the LORD;\n\nabove the heavens is his glory.\n\nR.        The Lord will give him a seat with the leaders of his people.\n\nor:\n\nR.        Alleluia.\n\nWho is like the LORD, our God, who is enthroned on high\n\nand looks upon the heavens and the earth below?\n\nR.        The Lord will give him a seat with the leaders of his people.\n\nor:\n\nR.        Alleluia.\n\nHe raises up the lowly from the dust;\n\nfrom the dunghill he lifts up the poor\n\nTo seat them with princes,\n\nwith the princes of his own people.\n\nR.        The Lord will give him a seat with the leaders of his people.\n\nor:\n\nR.        Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI chose you from the world,\nto go and bear fruit that will last, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:9-17",
              "content": "Jesus said to his disciples:\n“As the Father loves me, so I also love you.\nRemain in my love.\nIf you keep my commandments, you will remain in my love,\njust as I have kept my Father’s commandments\nand remain in his love.\n\n“I have told you this so that my joy might be in you\nand your joy might be complete.\nThis is my commandment: love one another as I love you.\nNo one has greater love than this,\nto lay down one’s life for one’s friends.\nYou are my friends if you do what I command you.\nI no longer call you slaves,\nbecause a slave does not know what his master is doing.\nI have called you friends,\nbecause I have told you everything I have heard from my Father.\nIt was not you who chose me, but I who chose you\nand appointed you to go and bear fruit that will remain,\nso that whatever you ask the Father in my name he may give you.\nThis I command you:  love one another.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-15": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.270Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-15": {
          "date": "2025-05-15",
          "liturgical_date": "Thursday of the Fourth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 13:13-25",
              "content": "From Paphos, Paul and his companions\nset sail and arrived at Perga in Pamphylia.\nBut John left them and returned to Jerusalem.\nThey continued on from Perga and reached Antioch in Pisidia.\nOn the sabbath they entered into the synagogue and took their seats.\nAfter the reading of the law and the prophets,\nthe synagogue officials sent word to them,\n\"My brothers, if one of you has a word of exhortation\nfor the people, please speak.\"\n\nSo Paul got up, motioned with his hand, and said,\n\"Fellow children of Israel and you others who are God-fearing, listen.\nThe God of this people Israel chose our ancestors\nand exalted the people during their sojourn in the land of Egypt.\nWith uplifted arm he led them out,\nand for about forty years he put up with them in the desert.\nWhen he had destroyed seven nations in the land of Canaan,\nhe gave them their land as an inheritance\nat the end of about four hundred and fifty years.\nAfter these things he provided judges up to Samuel the prophet.\nThen they asked for a king.\nGod gave them Saul, son of Kish,\na man from the tribe of Benjamin, for forty years.\nThen he removed him and raised up David as their king;\nof him he testified,\nI have found David, son of Jesse, a man after my own heart;\nhe will carry out my every wish.\nFrom this man's descendants God, according to his promise,\nhas brought to Israel a savior, Jesus.\nJohn heralded his coming by proclaiming a baptism of repentance\nto all the people of Israel;\nand as John was completing his course, he would say,\n'What do you suppose that I am? I am not he.\nBehold, one is coming after me;\nI am not worthy to unfasten the sandals of his feet.'\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 89:2-3, 21-22, 25 and 27",
              "response": "R.(2) For ever I will sing the goodness of the Lord.",
              "content": "or:\n\nR. Alleluia.\n\nThe favors of the LORD I will sing forever;\n\nthrough all generations my mouth shall proclaim your faithfulness.\n\nFor you have said, \"My kindness is established forever\";\n\nin heaven you have confirmed your faithfulness.\n\nR. For ever I will sing the goodness of the Lord.\n\nor:\n\nR. Alleluia.\n\n\"I have found David, my servant;\n\nwith my holy oil I have anointed him,\n\nThat my hand may be always with him,\n\nand that my arm may make him strong.\"\n\nR. For ever I will sing the goodness of the Lord.\n\nor:\n\nR. Alleluia.\n\n\"My faithfulness and my mercy shall be with him,\n\nand through my name shall his horn be exalted.\n\nHe shall say of me, 'You are my father,\n\nmy God, the Rock, my savior.'\"\n\nR. For ever I will sing the goodness of the Lord.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nJesus Christ, you are the faithful witness,\nthe firstborn of the dead,\nyou have loved us and freed us from our sins by your Blood.\nR. Alleluia, alleluia"
            },
            "gospel": {
              "citation": "Gospel John 13:16-20",
              "content": "When Jesus had washed the disciples' feet, he said to them:\n\"Amen, amen, I say to you, no slave is greater than his master\nnor any messenger greater than the one who sent him.\nIf you understand this, blessed are you if you do it.\nI am not speaking of all of you.\nI know those whom I have chosen.\nBut so that the Scripture might be fulfilled,\nThe one who ate my food has raised his heel against me.\nFrom now on I am telling you before it happens,\nso that when it happens you may believe that I AM.\nAmen, amen, I say to you, whoever receives the one I send\nreceives me, and whoever receives me receives the one who sent me.\""
            }
          },
          "saint_of_day": {
            "name": "Isidore",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-16": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.386Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-16": {
          "date": "2025-05-16",
          "liturgical_date": "Friday of the Fourth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 13:26-33",
              "content": "When Paul came to Antioch in Pisidia, he said in the synagogue:\n\"My brothers, children of the family of Abraham,\nand those others among you who are God-fearing,\nto us this word of salvation has been sent.\nThe inhabitants of Jerusalem and their leaders failed to recognize him,\nand by condemning him they fulfilled the oracles of the prophets\nthat are read sabbath after sabbath.\nFor even though they found no grounds for a death sentence,\nthey asked Pilate to have him put to death,\nand when they had accomplished all that was written about him,\nthey took him down from the tree and placed him in a tomb.\nBut God raised him from the dead,\nand for many days he appeared to those\nwho had come up with him from Galilee to Jerusalem.\nThese are now his witnesses before the people.\nWe ourselves are proclaiming this good news to you\nthat what God promised our fathers\nhe has brought to fulfillment for us, their children, by raising up Jesus,\nas it is written in the second psalm,\nYou are my Son; this day I have begotten you.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 2:6-7, 8-9, 10-11ab",
              "response": "R.(7bc) You are my Son; this day I have begotten you.",
              "content": "or:\n\nR. Alleluia.\n\n\"I myself have set up my king\n\non Zion, my holy mountain.\"\n\nI will proclaim the decree of the LORD:\n\nThe LORD said to me, \"You are my Son;\n\nthis day I have begotten you.\"\n\nR. You are my Son; this day I have begotten you.\n\nor:\n\nR.  Alleluia.\n\n\"Ask of me and I will give you\n\nthe nations for an inheritance\n\nand the ends of the earth for your possession.\n\nYou shall rule them with an iron rod;\n\nyou shall shatter them like an earthen dish.\"\n\nR. You are my Son; this day I have begotten you.\n\nor:\n\nR. Alleluia.\n\nAnd now, O kings, give heed;\n\ntake warning, you rulers of the earth.\n\nServe the LORD with fear, and rejoice before him;\n\nwith trembling rejoice.\n\nR. You are my Son; this day I have begotten you.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way and the truth and the life, says the Lord;\nno one comes to the Father except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:1-6",
              "content": "Jesus said to his disciples:\n\"Do not let your hearts be troubled.\nYou have faith in God; have faith also in me.\nIn my Father's house there are many dwelling places.\nIf there were not,\nwould I have told you that I am going to prepare a place for you?\nAnd if I go and prepare a place for you,\nI will come back again and take you to myself,\nso that where I am you also may be.\nWhere I am going you know the way.\"\nThomas said to him,\n\"Master, we do not know where you are going;\nhow can we know the way?\"\nJesus said to him, \"I am the way and the truth and the life.\nNo one comes to the Father except through me.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-17": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.277Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-17": {
          "date": "2025-05-17",
          "liturgical_date": "Saturday of the Fourth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 13:44-52",
              "content": "On the following sabbath\nalmost the whole city\ngathered to hear the word of the Lord.\nWhen the Jews saw the crowds, they were filled with jealousy\nand with violent abuse contradicted what Paul said.\nBoth Paul and Barnabas spoke out boldly and said,\n\"It was necessary that the word of God be spoken to you first,\nbut since you reject it\nand condemn yourselves as unworthy of eternal life,\nwe now turn to the Gentiles.\nFor so the Lord has commanded us,\nI have made you a light to the Gentiles,\nthat you may be an instrument of salvation\nto the ends of the earth.\"\n\nThe Gentiles were delighted when they heard this\nand glorified the word of the Lord.\nAll who were destined for eternal life came to believe,\nand the word of the Lord continued to spread\nthrough the whole region.\nThe Jews, however, incited the women of prominence who were worshipers\nand the leading men of the city,\nstirred up a persecution against Paul and Barnabas,\nand expelled them from their territory.\nSo they shook the dust from their feet in protest against them\nand went to Iconium.\nThe disciples were filled with joy and the Holy Spirit."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 98:1, 2-3ab, 3cd-4",
              "response": "R. (3cd) All the ends of the earth have seen the saving power of God.",
              "content": "or:\n\nR. Alleluia.\n\nSing to the LORD a new song,\n\nfor he has done wondrous deeds;\n\nHis right hand has won victory for him,\n\nhis holy arm.\n\nR. All the ends of the earth have seen the saving power of God.\n\nor:\n\nR. Alleluia.\n\nThe LORD has made his salvation known:\n\nin the sight of the nations he has revealed his justice.\n\nHe has remembered his kindness and his faithfulness\n\ntoward the house of Israel.\n\nR. All the ends of the earth have seen the saving power of God.\n\nor:\n\nR. Alleluia.\n\nAll the ends of the earth have seen\n\nthe salvation by our God.\n\nSing joyfully to the LORD, all you lands;\n\nbreak into song; sing praise.\n\nR. All the ends of the earth have seen the saving power of God.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf you remain in my word, you will truly be my disciples,\nand you will know the truth, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:7-14",
              "content": "Jesus said to his disciples:\n\"If you know me, then you will also know my Father.\nFrom now on you do know him and have seen him.\"\nPhilip said to Jesus,\n\"Master, show us the Father, and that will be enough for us.\"\nJesus said to him, \"Have I been with you for so long a time\nand you still do not know me, Philip?\nWhoever has seen me has seen the Father.\nHow can you say, 'Show us the Father'?\nDo you not believe that I am in the Father and the Father is in me?\nThe words that I speak to you I do not speak on my own.\nThe Father who dwells in me is doing his works.\nBelieve me that I am in the Father and the Father is in me,\nor else, believe because of the works themselves.\nAmen, amen, I say to you,\nwhoever believes in me will do the works that I do,\nand will do greater ones than these,\nbecause I am going to the Father.\nAnd whatever you ask in my name, I will do,\nso that the Father may be glorified in the Son.\nIf you ask anything of me in my name, I will do it.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-18": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.547Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-18": {
          "date": "2025-05-18",
          "liturgical_date": "Fifth Sunday of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 145:8-9, 10-11, 12-13",
              "response": "",
              "content": "R (cf. 1) I will praise your name for ever, my king and my God.\nor:\nR Alleluia.\nThe LORD is gracious and merciful,\n            slow to anger and of great kindness.\nThe LORD is good to all\n            and compassionate toward all his works.\nR I will praise your name for ever, my king and my God.\nor:\nR Alleluia.\nLet all your works give you thanks, O LORD,\n            and let your faithful ones bless you.\nLet them discourse of the glory of your kingdom\n            and speak of your might.\nR I will praise your name for ever, my king and my God.\nor:\nR Alleluia.\nLet them make known your might to the children of Adam,\n            and the glorious splendor of your kingdom.\nYour kingdom is a kingdom for all ages,\n            and your dominion endures through all generations.\nR I will praise your name for ever, my king and my God.\nor:\nR Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI give you a new commandment, says the Lord:\nlove one another as I have loved you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 13:31-33a, 34-35",
              "content": "When Judas had left them, Jesus said,\n“Now is the Son of Man glorified, and God is glorified in him.\nIf God is glorified in him,\nGod will also glorify him in himself,\nand God will glorify him at once.\nMy children, I will be with you only a little while longer.\nI give you a new commandment: love one another.\nAs I have loved you, so you also should love one another.\nThis is how all will know that you are my disciples,\nif you have love for one another.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-19": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.486Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-19": {
          "date": "2025-05-19",
          "liturgical_date": "Monday of the Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 14:5-18",
              "content": "There was an attempt in Iconiumby both the Gentiles and the Jews,together with their leaders,to attack and stone Paul and Barnabas.They realized it,and fled to the Lycaonian cities of Lystra and Derbeand to the surrounding countryside,where they continued to proclaim the Good News.At Lystra there was a crippled man, lame from birth,who had never walked.He listened to Paul speaking, who looked intently at him,saw that he had the faith to be healed,and called out in a loud voice, \"Stand up straight on your feet.\"He jumped up and began to walk about.When the crowds saw what Paul had done,they cried out in Lycaonian,\"The gods have come down to us in human form.\"They called Barnabas \"Zeus\" and Paul \"Hermes,\"because he was the chief speaker.And the priest of Zeus, whose temple was at the entrance to the city,brought oxen and garlands to the gates,for he together with the people intended to offer sacrifice.The Apostles Barnabas and Paul tore their garmentswhen they heard this and rushed out into the crowd, shouting,\"Men, why are you doing this?We are of the same nature as you, human beings.We proclaim to you good newsthat you should turn from these idols to the living God,who made heaven and earth and sea and all that is in them.In past generations he allowed all Gentiles to go their own ways;yet, in bestowing his goodness,he did not leave himself without witness,for he gave you rains from heaven and fruitful seasons,and filled you with nourishment and gladness for your hearts.\"Even with these words, they scarcely restrained the crowdsfrom offering sacrifice to them."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 115:1-2, 3-4, 15-16",
              "response": "R.(1ab) Not to us, O Lord, but to your name give the glory.",
              "content": "or:\n\nR. Alleluia.\n\nNot to us, O LORD, not to us\n\nbut to your name give glory\n\nbecause of your mercy, because of your truth.\n\nWhy should the pagans say,\n\n\"Where is their God?\"\n\nR. Not to us, O Lord, but to your name give the glory.\n\nor:\n\nR. Alleluia.\n\nOur God is in heaven;\n\nwhatever he wills, he does.\n\nTheir idols are silver and gold,\n\nthe handiwork of men.\n\nR. Not to us, O Lord, but to your name give the glory.\n\nor:\n\nR. Alleluia.\n\nMay you be blessed by the LORD,\n\nwho made heaven and earth.\n\nHeaven is the heaven of the LORD,\n\nbut the earth he has given to the children of men.\n\nR. Not to us, O Lord, but to your name give the glory.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Holy Spirit will teach you everything\nand remind you of all I told you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:21-26",
              "content": "Jesus said to his disciples:\"Whoever has my commandments and observes themis the one who loves me.Whoever loves me will be loved by my Father,and I will love him and reveal myself to him.\"Judas, not the Iscariot, said to him,\"Master, then what happened that you will reveal yourself to usand not to the world?\"Jesus answered and said to him,\"Whoever loves me will keep my word,and my Father will love him,and we will come to him and make our dwelling with him.Whoever does not love me does not keep my words;yet the word you hear is not minebut that of the Father who sent me.\"I have told you this while I am with you.The Advocate, the Holy Spiritwhom the Father will send in my name--he will teach you everythingand remind you of all that I told you.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-20": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.507Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-20": {
          "date": "2025-05-20",
          "liturgical_date": "Tuesday of Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 14:19-28",
              "content": "In those days, some Jews from Antioch and Iconium\narrived and won over the crowds.\nThey stoned Paul and dragged him out of the city,\nsupposing that he was dead.\nBut when the disciples gathered around him,\nhe got up and entered the city.\nOn the following day he left with Barnabas for Derbe.\n\nAfter they had proclaimed the good news to that city\nand made a considerable number of disciples,\nthey returned to Lystra and to Iconium and to Antioch.\nThey strengthened the spirits of the disciples\nand exhorted them to persevere in the faith, saying,\n\"It is necessary for us to undergo many hardships\nto enter the Kingdom of God.\"\nThey appointed presbyters for them in each Church and,\nwith prayer and fasting, commended them to the Lord\nin whom they had put their faith.\nThen they traveled through Pisidia and reached Pamphylia.\nAfter proclaiming the word at Perga they went down to Attalia.\nFrom there they sailed to Antioch,\nwhere they had been commended to the grace of God\nfor the work they had now accomplished.\nAnd when they arrived, they called the Church together\nand reported what God had done with them\nand how he had opened the door of faith to the Gentiles.\nThen they spent no little time with the disciples."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 145:10-11, 12-13ab, 21",
              "response": "R.(see 12) Your friends make known, O Lord, the glorious splendor of your kingdom.",
              "content": "or:\n\nR. Alleluia.\n\nLet all your works give you thanks, O LORD,\n\nand let your faithful ones bless you.\n\nLet them discourse of the glory of your kingdom\n\nand speak of your might.\n\nR. Your friends make known, O Lord, the glorious splendor of your kingdom.\n\nor:\n\nR. Alleluia.\n\nMaking known to men your might\n\nand the glorious splendor of your kingdom.\n\nYour kingdom is a kingdom for all ages,\n\nand your dominion endures through all generations.\n\nR. Your friends make known, O Lord, the glorious splendor of your kingdom.\n\nor:\n\nR. Alleluia.\n\nMay my mouth speak the praise of the LORD,\n\nand may all flesh bless his holy name forever and ever.\n\nR. Your friends make known, O Lord, the glorious splendor of your kingdom.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nChrist had to suffer and to rise from the dead,\nand so enter into his glory.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:27-31a",
              "content": "Jesus said to his disciples:\n\"Peace I leave with you; my peace I give to you.\nNot as the world gives do I give it to you.\nDo not let your hearts be troubled or afraid.\nYou heard me tell you,\n'I am going away and I will come back to you.'\nIf you loved me,\nyou would rejoice that I am going to the Father;\nfor the Father is greater than I.\nAnd now I have told you this before it happens,\nso that when it happens you may believe.\nI will no longer speak much with you,\nfor the ruler of the world is coming.\nHe has no power over me,\nbut the world must know that I love the Father\nand that I do just as the Father has commanded me.\""
            }
          },
          "saint_of_day": {
            "name": "Bernardine Siena",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-21": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.045Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-21": {
          "date": "2025-05-21",
          "liturgical_date": "Wednesday of the Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 15:1-6",
              "content": "Some who had come down from Judea were instructing the brothers,\n\"Unless you are circumcised according to the Mosaic practice,\nyou cannot be saved.\"\nBecause there arose no little dissension and debate\nby Paul and Barnabas with them,\nit was decided that Paul, Barnabas, and some of the others\nshould go up to Jerusalem to the Apostles and presbyters\nabout this question.\nThey were sent on their journey by the Church,\nand passed through Phoenicia and Samaria\ntelling of the conversion of the Gentiles,\nand brought great joy to all the brethren.\nWhen they arrived in Jerusalem,\nthey were welcomed by the Church,\nas well as by the Apostles and the presbyters,\nand they reported what God had done with them.\nBut some from the party of the Pharisees who had become believers\nstood up and said, \"It is necessary to circumcise them\nand direct them to observe the Mosaic law.\"\n\nThe Apostles and the presbyters met together to see about this matter."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 122:1-2, 3-4ab, 4cd-5",
              "response": "R.(see 1) Let us go rejoicing to the house of the Lord.",
              "content": "or:\n\nR. Alleluia.\n\nI rejoiced because they said to me,\n\n\"We will go up to the house of the LORD.\"\n\nAnd now we have set foot\n\nwithin your gates, O Jerusalem.\n\nR. Let us go rejoicing to the house of the Lord.\n\nor:\n\nR. Alleluia.\n\nJerusalem, built as a city\n\nwith compact unity.\n\nTo it the tribes go up,\n\nthe tribes of the LORD.\n\nR. Let us go rejoicing to the house of the Lord.\n\nor:\n\nR. Alleluia.\n\nAccording to the decree for Israel,\n\nto give thanks to the name of the LORD.\n\nIn it are set up judgment seats,\n\nseats for the house of David.\n\nR. Let us go rejoicing to the house of the Lord.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nRemain in me, as I remain in you, says the Lord;\nwhoever remains in me will bear much fruit.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:1-8",
              "content": "Jesus said to his disciples:\n\"I am the true vine, and my Father is the vine grower.\nHe takes away every branch in me that does not bear fruit,\nand everyone that does he prunes so that it bears more fruit.\nYou are already pruned because of the word that I spoke to you.\nRemain in me, as I remain in you.\nJust as a branch cannot bear fruit on its own\nunless it remains on the vine,\nso neither can you unless you remain in me.\nI am the vine, you are the branches.\nWhoever remains in me and I in him will bear much fruit,\nbecause without me you can do nothing.\nAnyone who does not remain in me\nwill be thrown out like a branch and wither;\npeople will gather them and throw them into a fire\nand they will be burned.\nIf you remain in me and my words remain in you,\nask for whatever you want and it will be done for you.\nBy this is my Father glorified,\nthat you bear much fruit and become my disciples.\""
            }
          },
          "saint_of_day": {
            "name": "Christopher Magallanes",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-22": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.045Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-22": {
          "date": "2025-05-22",
          "liturgical_date": "Thursday of the Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 15:7-21",
              "content": "After much debate had taken place,\nPeter got up and said to the Apostles and the presbyters,\n\"My brothers, you are well aware that from early days\nGod made his choice among you that through my mouth\nthe Gentiles would hear the word of the Gospel and believe.\nAnd God, who knows the heart,\nbore witness by granting them the Holy Spirit\njust as he did us.\nHe made no distinction between us and them,\nfor by faith he purified their hearts.\nWhy, then, are you now putting God to the test\nby placing on the shoulders of the disciples\na yoke that neither our ancestors nor we have been able to bear?\nOn the contrary, we believe that we are saved\nthrough the grace of the Lord Jesus, in the same way as they.\"\nThe whole assembly fell silent,\nand they listened\nwhile Paul and Barnabas described the signs and wonders\nGod had worked among the Gentiles through them.\n\nAfter they had fallen silent, James responded,\n\"My brothers, listen to me.\nSymeon has described how God first concerned himself\nwith acquiring from among the Gentiles a people for his name.\nThe words of the prophets agree with this, as is written:\n\nAfter this I shall return\nand rebuild the fallen hut of David;\nfrom its ruins I shall rebuild it\nand raise it up again,\nso that the rest of humanity may seek out the Lord,\neven all the Gentiles on whom my name is invoked.\nThus says the Lord who accomplishes these things,\nknown from of old.\n\nIt is my judgment, therefore,\nthat we ought to stop troubling the Gentiles who turn to God,\nbut tell them by letter to avoid pollution from idols,\nunlawful marriage, the meat of strangled animals, and blood.\nFor Moses, for generations now,\nhas had those who proclaim him in every town,\nas he has been read in the synagogues every sabbath.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 96:1-2a, 2b-3, 10",
              "response": "R.(3) Proclaim God's marvelous deeds to all the nations.",
              "content": "or:\n\nR. Alleluia.\n\nSing to the LORD a new song;\n\nsing to the LORD, all you lands.\n\nSing to the LORD; bless his name.\n\nR. Proclaim God's marvelous deeds to all the nations.\n\nor:\n\nR. Alleluia.\n\nAnnounce his salvation, day after day.\n\nTell his glory among the nations;\n\namong all peoples, his wondrous deeds.\n\nR. Proclaim God's marvelous deeds to all the nations.\n\nor:\n\nR. Alleluia.\n\nSay among the nations: The LORD is king.\n\nHe has made the world firm, not to be moved;\n\nhe governs the peoples with equity.\n\nR. Proclaim God's marvelous deeds to all the nations.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:9-11",
              "content": "Jesus said to his disciples:\n\"As the Father loves me, so I also love you.\nRemain in my love.\nIf you keep my commandments, you will remain in my love,\njust as I have kept my Father's commandments\nand remain in his love.\n\n\"I have told you this so that\nmy joy might be in you and\nyour joy might be complete.\""
            }
          },
          "saint_of_day": {
            "name": "Rita Cascia",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-23": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.401Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-23": {
          "date": "2025-05-23",
          "liturgical_date": "Friday of the Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 15:22-31",
              "content": "The Apostles and presbyters, in agreement with the whole Church,\ndecided to choose representatives\nand to send them to Antioch with Paul and Barnabas.\nThe ones chosen were Judas, who was called Barsabbas,\nand Silas, leaders among the brothers.\nThis is the letter delivered by them:\n\"The Apostles and the presbyters, your brothers,\nto the brothers in Antioch, Syria, and Cilicia\nof Gentile origin: greetings.\nSince we have heard that some of our number\nwho went out without any mandate from us\nhave upset you with their teachings\nand disturbed your peace of mind,\nwe have with one accord decided to choose representatives\nand to send them to you along with our beloved Barnabas and Paul,\nwho have dedicated their lives to the name of our Lord Jesus Christ.\nSo we are sending Judas and Silas\nwho will also convey this same message by word of mouth:\n'It is the decision of the Holy Spirit and of us\nnot to place on you any burden beyond these necessities,\nnamely, to abstain from meat sacrificed to idols,\nfrom blood, from meats of strangled animals,\nand from unlawful marriage.\nIf you keep free of these,\nyou will be doing what is right. Farewell.'\"\n\nAnd so they were sent on their journey.\nUpon their arrival in Antioch\nthey called the assembly together and delivered the letter.\nWhen the people read it, they were delighted with the exhortation."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 57:8-9, 10 and 12",
              "response": "R. (10a) I will give you thanks among the peoples, O Lord.",
              "content": "or:\n\nR. Alleluia.\n\nMy heart is steadfast, O God; my heart is steadfast;\n\nI will sing and chant praise.\n\nAwake, O my soul; awake, lyre and harp!\n\nI will wake the dawn.\n\nR. I will give you thanks among the peoples, O Lord.\n\nor:\n\nR. Alleluia.\n\nI will give thanks to you among the peoples, O LORD,\n\nI will chant your praise among the nations.\n\nFor your mercy towers to the heavens,\n\nand your faithfulness to the skies.\n\nBe exalted above the heavens, O God;\n\nabove all the earth be your glory!\n\nR. I will give you thanks among the peoples, O Lord.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI call you my friends, says the Lord,\nfor I have made known to you all that the Father has told me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:12-17",
              "content": "Jesus said to his disciples:\n\"This is my commandment: love one another as I love you.\nNo one has greater love than this,\nto lay down one's life for one's friends.\nYou are my friends if you do what I command you.\nI no longer call you slaves,\nbecause a slave does not know what his master is doing.\nI have called you friends,\nbecause I have told you everything I have heard from my Father.\nIt was not you who chose me, but I who chose you\nand appointed you to go and bear fruit that will remain,\nso that whatever you ask the Father in my name he may give you.\nThis I command you: love one another.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-24": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:37.528Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-24": {
          "date": "2025-05-24",
          "liturgical_date": "Saturday of the Fifth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 16:1-10",
              "content": "Paul reached also Derbe and Lystra\nwhere there was a disciple named Timothy,\nthe son of a Jewish woman who was a believer,\nbut his father was a Greek.\nThe brothers in Lystra and Iconium spoke highly of him,\nand Paul wanted him to come along with him.\nOn account of the Jews of that region, Paul had him circumcised,\nfor they all knew that his father was a Greek.\nAs they traveled from city to city,\nthey handed on to the people for observance the decisions\nreached by the Apostles and presbyters in Jerusalem.\nDay after day the churches grew stronger in faith\nand increased in number.\n\nThey traveled through the Phrygian and Galatian territory\nbecause they had been prevented by the Holy Spirit\nfrom preaching the message in the province of Asia.\nWhen they came to Mysia, they tried to go on into Bithynia,\nbut the Spirit of Jesus did not allow them,\nso they crossed through Mysia and came down to Troas.\nDuring the night Paul had a vision.\nA Macedonian stood before him and implored him with these words,\n\"Come over to Macedonia and help us.\"\nWhen he had seen the vision,\nwe sought passage to Macedonia at once,\nconcluding that God had called us to proclaim the Good News to them."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 100:1b-2, 3, 5",
              "response": "R. (2a) Let all the earth cry out to God with joy.",
              "content": "or:\n\nR. Alleluia.\n\nSing joyfully to the LORD, all you lands;\n\nserve the LORD with gladness;\n\ncome before him with joyful song.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\nKnow that the LORD is God;\n\nhe made us, his we are;\n\nhis people, the flock he tends.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia.\n\nThe LORD is good:\n\nhis kindness endures forever,\n\nand his faithfulness, to all generations.\n\nR. Let all the earth cry out to God with joy.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf then you were raised with Christ,\nseek what is above,\nwhere Christ is seated at the right hand of God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:18-21",
              "content": "Jesus said to his disciples:\n\"If the world hates you, realize that it hated me first.\nIf you belonged to the world, the world would love its own;\nbut because you do not belong to the world,\nand I have chosen you out of the world,\nthe world hates you.\nRemember the word I spoke to you,\n'No slave is greater than his master.'\nIf they persecuted me, they will also persecute you.\nIf they kept my word, they will also keep yours.\nAnd they will do all these things to you on account of my name,\nbecause they do not know the one who sent me.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-25": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.092Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-25": {
          "date": "2025-05-25",
          "liturgical_date": "Sixth Sunday of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 67:2-3, 5, 6, 8",
              "response": "",
              "content": "R (4) O God, let all the nations praise you!\nor:\nR Alleluia.\nMay God have pity on us and bless us;\n            may he let his face shine upon us.\nSo may your way be known upon earth;\n            among all nations, your salvation.\nR O God, let all the nations praise you!\nor:\nR Alleluia.\nMay the nations be glad and exult\n            because you rule the peoples in equity;\n            the nations on the earth you guide.\nR O God, let all the nations praise you!\nor:\nR Alleluia.\nMay the peoples praise you, O God;\n            may all the peoples praise you!\nMay God bless us,\n            and may all the ends of the earth fear him!\nR O God, let all the nations praise you!\nor:\nR Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhoever loves me will keep my word, says the Lord,\nand my Father will love him and we will come to him.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 14:23-29",
              "content": "Jesus said to his disciples:\n“Whoever loves me will keep my word,\nand my Father will love him,\nand we will come to him and make our dwelling with him.\nWhoever does not love me does not keep my words;\nyet the word you hear is not mine\nbut that of the Father who sent me.\n\n“I have told you this while I am with you.\nThe Advocate, the Holy Spirit,\nwhom the Father will send in my name,\nwill teach you everything\nand remind you of all that I told you.\nPeace I leave with you; my peace I give to you.\nNot as the world gives do I give it to you.\nDo not let your hearts be troubled or afraid.\nYou heard me tell you,\n‘I am going away and I will come back to you.’\nIf you loved me,\nyou would rejoice that I am going to the Father;\nfor the Father is greater than I.\nAnd now I have told you this before it happens,\nso that when it happens you may believe.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-26": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.434Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-26": {
          "date": "2025-05-26",
          "liturgical_date": "Memorial of Saint Philip Neri, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 16:11-15",
              "content": "We set sail from Troas, making a straight run for Samothrace,\nand on the next day to Neapolis, and from there to Philippi,\na leading city in that district of Macedonia and a Roman colony.\nWe spent some time in that city.\nOn the sabbath we went outside the city gate along the river\nwhere we thought there would be a place of prayer.\nWe sat and spoke with the women who had gathered there.\nOne of them, a woman named Lydia, a dealer in purple cloth,\nfrom the city of Thyatira, a worshiper of God, listened,\nand the Lord opened her heart to pay attention\nto what Paul was saying.\nAfter she and her household had been baptized,\nshe offered us an invitation,\n\"If you consider me a believer in the Lord,\ncome and stay at my home,\" and she prevailed on us."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 149:1b-2, 3-4, 5-6a and 9b",
              "response": "R. (see 4a) The Lord takes delight in his people.",
              "content": "or:\n\nR. Alleluia.\n\nSing to the LORD a new song\n\nof praise in the assembly of the faithful.\n\nLet Israel be glad in their maker,\n\nlet the children of Zion rejoice in their king.\n\nR. The Lord takes delight in his people.\n\nor:\n\nR. Alleluia.\n\nLet them praise his name in the festive dance,\n\nlet them sing praise to him with timbrel and harp.\n\nFor the LORD loves his people,\n\nand he adorns the lowly with victory.\n\nR. The Lord takes delight in his people.\n\nor:\n\nR. Alleluia.\n\nLet the faithful exult in glory;\n\nlet them sing for joy upon their couches.\n\nLet the high praises of God be in their throats.\n\nThis is the glory of all his faithful. Alleluia.\n\nR. The Lord takes delight in his people.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Spirit of truth will testify to me, says the Lord,\nand you also will testify.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 15:26—16:4a",
              "content": "Jesus said to his disciples:\n\"When the Advocate comes whom I will send you from the Father,\nthe Spirit of truth who proceeds from the Father,\nhe will testify to me.\nAnd you also testify,\nbecause you have been with me from the beginning.\n\n\"I have told you this so that you may not fall away.\nThey will expel you from the synagogues;\nin fact, the hour is coming when everyone who kills you\nwill think he is offering worship to God.\nThey will do this because they have not known either the Father or me.\nI have told you this so that when their hour comes\nyou may remember that I told you.\""
            }
          },
          "saint_of_day": {
            "name": "Philip Neri",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-27": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.476Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-27": {
          "date": "2025-05-27",
          "liturgical_date": "Tuesday of the Sixth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 16:22-34",
              "content": "The crowd in Philippi joined in the attack on Paul and Silas,\nand the magistrates had them stripped\nand ordered them to be beaten with rods.\nAfter inflicting many blows on them,\nthey threw them into prison\nand instructed the jailer to guard them securely.\nWhen he received these instructions, he put them in the innermost cell\nand secured their feet to a stake.\n\nAbout midnight, while Paul and Silas were praying\nand singing hymns to God as the prisoners listened,\nthere was suddenly such a severe earthquake\nthat the foundations of the jail shook;\nall the doors flew open, and the chains of all were pulled loose.\nWhen the jailer woke up and saw the prison doors wide open,\nhe drew his sword and was about to kill himself,\nthinking that the prisoners had escaped.\nBut Paul shouted out in a loud voice,\n\"Do no harm to yourself; we are all here.\"\nHe asked for a light and rushed in and,\ntrembling with fear, he fell down before Paul and Silas.\nThen he brought them out and said,\n\"Sirs, what must I do to be saved?\"\nAnd they said, \"Believe in the Lord Jesus\nand you and your household will be saved.\"\nSo they spoke the word of the Lord to him and to everyone in his house.\nHe took them in at that hour of the night and bathed their wounds;\nthen he and all his family were baptized at once.\nHe brought them up into his house and provided a meal\nand with his household rejoiced at having come to faith in God."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 138:1-2ab, 2cde-3, 7c-8",
              "response": "R. (7c) Your right hand saves me, O Lord.",
              "content": "or:\n\nR. Alleluia.\n\nI will give thanks to you, O LORD, with all my heart,\n\nfor you have heard the words of my mouth;\n\nin the presence of the angels I will sing your praise;\n\nI will worship at your holy temple,\n\nand give thanks to your name.\n\nR. Your right hand saves me, O Lord.\n\nor:\n\nR. Alleluia.\n\nBecause of your kindness and your truth,\n\nyou have made great above all things\n\nyour name and your promise.\n\nWhen I called, you answered me;\n\nyou built up strength within me.\n\nR. Your right hand saves me, O Lord.\n\nor:\n\nR. Alleluia.\n\nYour right hand saves me.\n\nThe LORD will complete what he has done for me;\n\nyour kindness, O LORD, endures forever;\n\nforsake not the work of your hands.\n\nR. Your right hand saves me, O Lord.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI will send to you the Spirit of truth, says the Lord;\nhe will guide you to all truth.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 16:5-11",
              "content": "Jesus said to his disciples:\n\"Now I am going to the one who sent me,\nand not one of you asks me, 'Where are you going?'\nBut because I told you this, grief has filled your hearts.\nBut I tell you the truth, it is better for you that I go.\nFor if I do not go, the Advocate will not come to you.\nBut if I go, I will send him to you.\nAnd when he comes he will convict the world\nin regard to sin and righteousness and condemnation:\nsin, because they do not believe in me;\nrighteousness, because I am going to the Father\nand you will no longer see me;\ncondemnation, because the ruler of this world has been condemned.\""
            }
          },
          "saint_of_day": {
            "name": "Augustine Canterbury",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-28": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.439Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-28": {
          "date": "2025-05-28",
          "liturgical_date": "Wednesday of the Sixth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 17:15, 22—18:1",
              "content": "After Paul's escorts had taken him to Athens,\nthey came away with instructions for Silas and Timothy\nto join him as soon as possible.\n\nThen Paul stood up at the Areopagus and said:\n\"You Athenians, I see that in every respect\nyou are very religious.\nFor as I walked around looking carefully at your shrines,\nI even discovered an altar inscribed, 'To an Unknown God.'\nWhat therefore you unknowingly worship, I proclaim to you.\nThe God who made the world and all that is in it,\nthe Lord of heaven and earth,\ndoes not dwell in sanctuaries made by human hands,\nnor is he served by human hands because he needs anything.\nRather it is he who gives to everyone life and breath and everything.\nHe made from one the whole human race\nto dwell on the entire surface of the earth,\nand he fixed the ordered seasons and the boundaries of their regions,\nso that people might seek God,\neven perhaps grope for him and find him,\nthough indeed he is not far from any one of us.\nFor 'In him we live and move and have our being,'\nas even some of your poets have said,\n'For we too are his offspring.'\nSince therefore we are the offspring of God,\nwe ought not to think that the divinity is like an image\nfashioned from gold, silver, or stone by human art and imagination.\nGod has overlooked the times of ignorance,\nbut now he demands that all people everywhere repent\nbecause he has established a day on which he will 'judge the world\nwith justice' through a man he has appointed,\nand he has provided confirmation for all\nby raising him from the dead.\"\n\nWhen they heard about resurrection of the dead,\nsome began to scoff, but others said,\n\"We should like to hear you on this some other time.\"\nAnd so Paul left them.\nBut some did join him, and became believers.\nAmong them were Dionysius,\na member of the Court of the Areopagus,\na woman named Damaris, and others with them.\n\nAfter this he left Athens and went to Corinth."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 148:1-2, 11-12, 13, 14",
              "response": "R. Heaven and earth are full of your glory.",
              "content": "or:\n\nR. Alleluia.\n\nPraise the LORD from the heavens;\n\npraise him in the heights.\n\nPraise him, all you his angels;\n\npraise him, all you his hosts.\n\nR. Heaven and earth are full of your glory.\n\nor:\n\nR. Alleluia.\n\nLet the kings of the earth and all peoples,\n\nthe princes and all the judges of the earth,\n\nYoung men too, and maidens,\n\nold men and boys.\n\nR. Heaven and earth are full of your glory.\n\nor:\n\nR. Alleluia.\n\nPraise the name of the LORD,\n\nfor his name alone is exalted;\n\nHis majesty is above earth and heaven.\n\nR. Heaven and earth are full of your glory.\n\nor:\n\nR. Alleluia.\n\nHe has lifted up the horn of his people;\n\nBe this his praise from all his faithful ones,\n\nfrom the children of Israel, the people close to him.\n\nAlleluia.\n\nR. Heaven and earth are full of your glory.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI will ask the Father\nand he will give you another Advocate\nto be with you always.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 16:12-15",
              "content": "Jesus said to his disciples:\n\"I have much more to tell you, but you cannot bear it now.\nBut when he comes, the Spirit of truth,\nhe will guide you to all truth.\nHe will not speak on his own,\nbut he will speak what he hears,\nand will declare to you the things that are coming.\nHe will glorify me,\nbecause he will take from what is mine and declare it to you.\nEverything that the Father has is mine;\nfor this reason I told you that he will take from what is mine\nand declare it to you.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-29": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.175Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-29": {
          "date": "2025-05-29",
          "liturgical_date": "Thursday of the Sixth Week of Easter - Ascension",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "",
              "response": "",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "",
              "content": ""
            },
            "gospel": {
              "citation": "",
              "content": ""
            }
          },
          "saint_of_day": {
            "name": "Solemnity of the Ascension of the Lord",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-30": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:23:38.092Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-30": {
          "date": "2025-05-30",
          "liturgical_date": "Friday of the Sixth Week of Easter",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Acts 18:9-18",
              "content": "One night while Paul was in Corinth, the Lord said to him in a vision,\n“Do not be afraid.\nGo on speaking, and do not be silent, for I am with you.\nNo one will attack and harm you,\nfor I have many people in this city.”\nHe settled there for a year and a half\nand taught the word of God among them.\n\nBut when Gallio was proconsul of Achaia,\nthe Jews rose up together against Paul\nand brought him to the tribunal, saying,\n“This man is inducing people to worship God contrary to the law.”\nWhen Paul was about to reply, Gallio spoke to the Jews,\n“If it were a matter of some crime or malicious fraud,\nI should with reason hear the complaint of you Jews;\nbut since it is a question of arguments over doctrine and titles\nand your own law, see to it yourselves.\nI do not wish to be a judge of such matters.”\nAnd he drove them away from the tribunal.\nThey all seized Sosthenes, the synagogue official,\nand beat him in full view of the tribunal.\nBut none of this was of concern to Gallio.\n\nPaul remained for quite some time,\nand after saying farewell to the brothers he sailed for Syria,\ntogether with Priscilla and Aquila.\nAt Cenchreae he had shaved his head because he had taken a vow."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 47:2-3, 4-5, 6-7",
              "response": "R. (8a) God is king of all the earth.",
              "content": "or:\n\nR. Alleluia.\n\nAll you peoples, clap your hands,\n\nshout to God with cries of gladness,\n\nFor the LORD, the Most High, the awesome,\n\nis the great king over all the earth.\n\nR. God is king of all the earth.\n\nor:\n\nR. Alleluia.\n\nHe brings people under us;\n\nnations under our feet.\n\nHe chooses for us our inheritance,\n\nthe glory of Jacob, whom he loves.\n\nR. God is king of all the earth.\n\nor:\n\nR. Alleluia.\n\nGod mounts his throne amid shouts of joy;\n\nthe LORD, amid trumpet blasts.\n\nSing praise to God, sing praise;\n\nsing praise to our king, sing praise.\n\nR. God is king of all the earth.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nChrist had to suffer and to rise from the dead,\nand so enter into his glory.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 16:20-23",
              "content": "Jesus said to his disciples:\n“Amen, amen, I say to you, you will weep and mourn,\nwhile the world rejoices;\nyou will grieve, but your grief will become joy.\nWhen a woman is in labor, she is in anguish because her hour has arrived;\nbut when she has given birth to a child,\nshe no longer remembers the pain because of her joy\nthat a child has been born into the world.\nSo you also are now in anguish.\nBut I will see you again, and your hearts will rejoice,\nand no one will take your joy away from you.\nOn that day you will not question me about anything.\nAmen, amen, I say to you,\nwhatever you ask the Father in my name he will give you.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-05-31": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:24:36.041Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-05-31": {
          "date": "2025-05-31",
          "liturgical_date": "Feast of the Visitation of the Blessed Virgin Mary",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Isaiah 12:2-3, 4bcd, 5-6",
              "response": "R.        (6)  Among you is the great and Holy One of Israel.",
              "content": "God indeed is my savior;\n\nI am confident and unafraid.\n\nMy strength and my courage is the LORD,\n\nand he has been my savior.\n\nWith joy you will draw water\n\nat the fountain of salvation.\n\nR.        Among you is the great and Holy One of Israel.\n\nGive thanks to the LORD, acclaim his name;\n\namong the nations make known his deeds,\n\nproclaim how exalted is his name.\n\nR.        Among you is the great and Holy One of Israel.\n\nSing praise to the LORD for his glorious achievement;\n\nlet this be known throughout all the earth.\n\nShout with exultation, O city of Zion,\n\nfor great in your midst\n\nis the Holy One of Israel!\n\nR.        Among you is the great and Holy One of Israel."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, O Virgin Mary, who believed\nthat what was spoken to you by the Lord would be fulfilled.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 1:39-56",
              "content": "Mary set out\nand traveled to the hill country in haste\nto a town of Judah,\nwhere she entered the house of Zechariah\nand greeted Elizabeth.\nWhen Elizabeth heard Mary’s greeting,\nthe infant leaped in her womb,\nand Elizabeth, filled with the Holy Spirit,\ncried out in a loud voice and said,\n“Most blessed are you among women,\nand blessed is the fruit of your womb.\nAnd how does this happen to me,\nthat the mother of my Lord should come to me?\nFor at the moment the sound of your greeting reached my ears,\nthe infant in my womb leaped for joy.\nBlessed are you who believed\nthat what was spoken to you by the Lord\nwould be fulfilled.”\n\nAnd Mary said:\n “My soul proclaims the greatness of the Lord;\n            my spirit rejoices in God my Savior,\n            for he has looked with favor on his lowly servant.\nFrom this day all generations will call me blessed:\n            the Almighty has done great things for me,\n            and holy is his Name.\n\nHe has mercy on those who fear him\n            in every generation.\nHe has shown the strength of his arm,\n            he has scattered the proud in their conceit.\nHe has cast down the mighty from their thrones,\n            and has lifted up the lowly.\nHe has filled the hungry with good things,\n            and the rich he has sent away empty.\nHe has come to the help of his servant Israel\n            for he has remembered his promise of mercy,\n            the promise he made to our fathers,\n            to Abraham and his children for ever.”\n\nMary remained with her about three months\nand then returned to her home."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    }
  }
}