{
  "meta": {
    "version": "1.0",
    "month": 7,
    "month_name": "july",
    "year": 2025,
    "total_days": 31
  },
  "daily_readings": {
    "2025-07-01": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:41.962Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-01": {
          "date": "2025-07-01",
          "liturgical_date": "Tuesday of the Thirteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 19:15-29",
              "content": "As dawn was breaking, the angels urged Lot on, saying, \"On your way!\nTake with you your wife and your two daughters who are here,\nor you will be swept away in the punishment of Sodom.\"\nWhen he hesitated, the men, by the LORD's mercy,\nseized his hand and the hands of his wife and his two daughters\nand led them to safety outside the city.\nAs soon as they had been brought outside, he was told:\n\"Flee for your life!\nDon't look back or stop anywhere on the Plain.\nGet off to the hills at once, or you will be swept away.\"\n\"Oh, no, my lord!\" Lot replied,\n\"You have already thought enough of your servant\nto do me the great kindness of intervening to save my life.\nBut I cannot flee to the hills to keep the disaster from overtaking me,\nand so I shall die.\nLook, this town ahead is near enough to escape to.\nIt's only a small place.\nLet me flee there–it's a small place, is it not?–\nthat my life may be saved.\"\n\"Well, then,\" he replied,\n\"I will also grant you the favor you now ask.\nI will not overthrow the town you speak of.\nHurry, escape there!\nI cannot do anything until you arrive there.\"\nThat is why the town is called Zoar.\n\nThe sun was just rising over the earth as Lot arrived in Zoar;\nat the same time the LORD rained down sulphurous fire\nupon Sodom and Gomorrah\nfrom the LORD out of heaven.\nHe overthrew those cities and the whole Plain,\ntogether with the inhabitants of the cities\nand the produce of the soil.\nBut Lot's wife looked back, and she was turned into a pillar of salt.\n\nEarly the next morning Abraham went to the place\nwhere he had stood in the LORD's presence.\nAs he looked down toward Sodom and Gomorrah\nand the whole region of the Plain,\nhe saw dense smoke over the land rising like fumes from a furnace.\n\nThus it came to pass: when God destroyed the Cities of the Plain,\nhe was mindful of Abraham by sending Lot away from the upheaval\nby which God overthrew the cities where Lot had been living."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 26:2-3, 9-10, 11-12",
              "response": "R.(3a) O Lord, your mercy is before my eyes.",
              "content": "Search me, O LORD, and try me;\n\ntest my soul and my heart.\n\nFor your mercy is before my eyes,\n\nand I walk in your truth.\n\nR. O Lord, your mercy is before my eyes.\n\nGather not my soul with those of sinners,\n\nnor with men of blood my life.\n\nOn their hands are crimes,\n\nand their right hands are full of bribes.\n\nR. O Lord, your mercy is before my eyes.\n\nBut I walk in integrity;\n\nredeem me, and have mercy on me.\n\nMy foot stands on level ground;\n\nin the assemblies I will bless the LORD.\n\nR. O Lord, your mercy is before my eyes."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI trust in the LORD;\nmy soul trusts in his word.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 8:23-27",
              "content": "As Jesus got into a boat, his disciples followed him.\nSuddenly a violent storm came up on the sea,\nso that the boat was being swamped by waves;\nbut he was asleep.\nThey came and woke him, saying,\n\"Lord, save us!  We are perishing!\"\nHe said to them, \"Why are you terrified, O you of little faith?\"\nThen he got up, rebuked the winds and the sea,\nand there was great calm.\nThe men were amazed and said, \"What sort of man is this,\nwhom even the winds and the sea obey?\""
            }
          },
          "saint_of_day": {
            "name": "Junipero Serra",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-02": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:41.852Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-02": {
          "date": "2025-07-02",
          "liturgical_date": "Wednesday of the Thirteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 21:5, 8-20a",
              "content": "Abraham was a hundred years old when his son Isaac was born to him.\nIsaac grew, and on the day of the child's weaning\nAbraham held a great feast.\n\nSarah noticed the son whom Hagar the Egyptian\nhad borne to Abraham\nplaying with her son Isaac;\nso she demanded of Abraham:\n\"Drive out that slave and her son!\nNo son of that slave is going to share the inheritance\nwith my son Isaac!\"\nAbraham was greatly distressed,\nespecially on account of his son Ishmael.\nBut God said to Abraham: \"Do not be distressed about the boy\nor about your slave woman.\nHeed the demands of Sarah, no matter what she is asking of you;\nfor it is through Isaac that descendants shall bear your name.\nAs for the son of the slave woman,\nI will make a great nation of him also,\nsince he too is your offspring.\"\n\nEarly the next morning Abraham got some bread and a skin of water\nand gave them to Hagar.\nThen, placing the child on her back, he sent her away.\nAs she roamed aimlessly in the wilderness of Beer-sheba,\nthe water in the skin was used up.\nSo she put the child down under a shrub,\nand then went and sat down opposite him, about a bowshot away;\nfor she said to herself, \"Let me not watch to see the child die.\"\nAs she sat opposite Ishmael, he began to cry.\nGod heard the boy's cry,\nand God's messenger called to Hagar from heaven:\n\"What is the matter, Hagar?\nDon't be afraid; God has heard the boy's cry in this plight of his.\nArise, lift up the boy and hold him by the hand;\nfor I will make of him a great nation.\"\nThen God opened her eyes, and she saw a well of water.\nShe went and filled the skin with water, and then let the boy drink.\n\nGod was with the boy as he grew up."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 34:7-8, 10-11, 12-13",
              "response": "R. (7a) The Lord hears the cry of the poor.",
              "content": "When the poor one called out, the LORD heard,\n\nand from all his distress he saved him.\n\nThe angel of the LORD encamps\n\naround those who fear him, and delivers them.\n\nR. The Lord hears the cry of the poor.\n\nFear the LORD, you his holy ones,\n\nfor nought is lacking to those who fear him.\n\nThe great grow poor and hungry;\n\nbut those who seek the LORD want for no good thing.\n\nR. The Lord hears the cry of the poor.\n\nCome, children, hear me;\n\nI will teach you the fear of the LORD.\n\nWhich of you desires life,\n\nand takes delight in prosperous days?\n\nR. The Lord hears the cry of the poor."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Father willed to give us birth by the word of truth\nthat we may be a kind of firstfruits of his creatures.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 8:28-34",
              "content": "When Jesus came to the territory of the Gadarenes,\ntwo demoniacs who were coming from the tombs met him.\nThey were so savage that no one could travel by that road.\nThey cried out, \"What have you to do with us, Son of God?\nHave you come here to torment us before the appointed time?\"\nSome distance away a herd of many swine was feeding.\nThe demons pleaded with him,\n\"If you drive us out, send us into the herd of swine.\"\nAnd he said to them, \"Go then!\"\nThey came out and entered the swine,\nand the whole herd rushed down the steep bank into the sea\nwhere they drowned.\nThe swineherds ran away,\nand when they came to the town they reported everything,\nincluding what had happened to the demoniacs.\nThereupon the whole town came out to meet Jesus,\nand when they saw him they begged him to leave their district."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-03": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:41.972Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-03": {
          "date": "2025-07-03",
          "liturgical_date": "Feast of Saint Thomas, Apostle",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ephesians 2:19-22",
              "content": "Brothers and sisters:\nYou are no longer strangers and sojourners,\nbut you are fellow citizens with the holy ones\nand members of the household of God,\nbuilt upon the foundation of the Apostles and prophets,\nwith Christ Jesus himself as the capstone.\nThrough him the whole structure is held together\nand grows into a temple sacred in the Lord;\nin him you also are being built together\ninto a dwelling place of God in the Spirit."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 117:1bc, 2",
              "response": "R. (Mark 16:15) Go out to all the world and tell the Good News.",
              "content": "Praise the LORD, all you nations;\n\nglorify him, all you peoples!\n\nR. Go out to all the world and tell the Good News.\n\nFor steadfast is his kindness for us,\n\nand the fidelity of the LORD endures forever.\n\nR. Go out to all the world and tell the Good News."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYou believe in me, Thomas, because you have seen me, says the Lord;\nblessed are those who have not seen, but still believe!\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 20:24-29",
              "content": "Thomas, called Didymus, one of the Twelve,\nwas not with them when Jesus came.\nSo the other disciples said to him, \"We have seen the Lord.\"\nBut Thomas said to them,\n\"Unless I see the mark of the nails in his hands\nand put my finger into the nailmarks\nand put my hand into his side, I will not believe.\"\nNow a week later his disciples were again inside\nand Thomas was with them.\nJesus came, although the doors were locked,\nand stood in their midst and said, \"Peace be with you.\"\nThen he said to Thomas, \"Put your finger here and see my hands,\nand bring your hand and put it into my side,\nand do not be unbelieving, but believe.\"\nThomas answered and said to him, \"My Lord and my God!\"\nJesus said to him, \"Have you come to believe because you have seen me?\nBlessed are those who have not seen and have believed.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-04": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:41.981Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-04": {
          "date": "2025-07-04",
          "liturgical_date": "Friday of the Thirteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 23:1-4, 19; 24:1-8, 62-67",
              "content": "The span of Sarah's life was one hundred and twenty-seven years.\nShe died in Kiriatharba (that is, Hebron)\nin the land of Canaan,\nand Abraham performed the customary mourning rites for her.\nThen he left the side of his dead one and addressed the Hittites:\n\"Although I am a resident alien among you,\nsell me from your holdings a piece of property for a burial ground,\nthat I may bury my dead wife.\"\n\nAfter the transaction, Abraham buried his wife Sarah\nin the cave of the field of Machpelah,\nfacing Mamre (that is, Hebron) in the land of Canaan.\n\nAbraham had now reached a ripe old age,\nand the LORD had blessed him in every way.\nAbraham said to the senior servant of his household,\nwho had charge of all his possessions:\n\"Put your hand under my thigh,\nand I will make you swear by the LORD,\nthe God of heaven and the God of earth,\nthat you will not procure a wife for my son\nfrom the daughters of the Canaanites among whom I live,\nbut that you will go to my own land and to my kindred\nto get a wife for my son Isaac.\"\nThe servant asked him:\n\"What if the woman is unwilling to follow me to this land?\nShould I then take your son back to the land from which you migrated?\"\n\"Never take my son back there for any reason,\" Abraham told him.\n\"The LORD, the God of heaven,\nwho took me from my father's house and the land of my kin,\nand who confirmed by oath the promise he then made to me,\n'I will give this land to your descendants'–\nhe will send his messenger before you,\nand you will obtain a wife for my son there.\nIf the woman is unwilling to follow you,\nyou will be released from this oath.\nBut never take my son back there!\"\n\nA long time later, Isaac went to live in the region of the Negeb.\nOne day toward evening he went out . . . in the field,\nand as he looked around, he noticed that camels were approaching.\nRebekah, too, was looking about, and when she saw him,\nshe alighted from her camel and asked the servant,\n\"Who is the man out there, walking through the fields toward us?\"\n\"That is my master,\" replied the servant.\nThen she covered herself with her veil.\n\nThe servant recounted to Isaac all the things he had done.\nThen Isaac took Rebekah into his tent;\nhe married her, and thus she became his wife.\nIn his love for her, Isaac found solace\nafter the death of his mother Sarah."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 106:1b-2, 3-4a, 4b-5",
              "response": "R. (1b) Give thanks to the Lord, for he is good.",
              "content": "Give thanks to the LORD, for he is good,\n\nfor his mercy endures forever.\n\nWho can tell the mighty deeds of the LORD,\n\nor proclaim all his praises?\n\nR. Give thanks to the Lord, for he is good.\n\nBlessed are they who observe what is right,\n\nwho do always what is just.\n\nRemember us, O LORD, as you favor your people.\n\nR. Give thanks to the Lord, for he is good.\n\nVisit me with your saving help,\n\nThat I may see the prosperity of your chosen ones,\n\nrejoice in the joy of your people,\n\nand glory with your inheritance.\n\nR. Give thanks to the Lord, for he is good."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nCome to me, all you who labor and are burdened,\nand I will give you rest, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 9:9-13",
              "content": "As Jesus passed by,\nhe saw a man named Matthew sitting at the customs post.\nHe said to him, \"\"Follow me.\"\"\nAnd he got up and followed him.\nWhile he was at table in his house,\nmany tax collectors and sinners came\nand sat with Jesus and his disciples.\nThe Pharisees saw this and said to his disciples,\n\"\"Why does your teacher eat with tax collectors and sinners?\"\"\nHe heard this and said,\n\"\"Those who are well do not need a physician, but the sick do.\nGo and learn the meaning of the words,\nI desire mercy, not sacrifice.\nI did not come to call the righteous but sinners.\"\""
            }
          },
          "saint_of_day": {
            "name": "Independence Day",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-05": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:42.001Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-05": {
          "date": "2025-07-05",
          "liturgical_date": "Saturday of the Thirteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 27:1-5, 15-29",
              "content": "When Isaac was so old that his eyesight had failed him,\nhe called his older son Esau and said to him, \"Son!\"\n\"Yes father!\" he replied.\nIsaac then said, \"As you can see, I am so old\nthat I may now die at any time.\nTake your gear, therefore–your quiver and bow–\nand go out into the country to hunt some game for me.\nWith your catch prepare an appetizing dish for me, such as I like,\nand bring it to me to eat,\nso that I may give you my special blessing before I die.\"\n\nRebekah had been listening\nwhile Isaac was speaking to his son Esau.\nSo, when Esau went out into the country\nto hunt some game for his father,\nRebekah [then] took the best clothes of her older son Esau\nthat she had in the house,\nand gave them to her younger son Jacob to wear;\nand with the skins of the kids she covered up his hands\nand the hairless parts of his neck.\nThen she handed her son Jacob the appetizing dish\nand the bread she had prepared.\n\nBringing them to his father, Jacob said, \"Father!\"\n\"Yes?\" replied Isaac.  \"Which of my sons are you?\"\nJacob answered his father:  \"I am Esau, your first-born.\nI did as you told me.\nPlease sit up and eat some of my game,\nso that you may give me your special blessing.\"\nBut Isaac asked, \"How did you succeed so quickly, son?\"\nHe answered,\n\"The LORD, your God, let things turn out well with me.\"\nIsaac then said to Jacob,\n\"Come closer, son, that I may feel you,\nto learn whether you really are my son Esau or not.\"\nSo Jacob moved up closer to his father.\nWhen Isaac felt him, he said,\n\"Although the voice is Jacob's, the hands are Esau's.\"\n(He failed to identify him because his hands were hairy,\nlike those of his brother Esau;\nso in the end he gave him his blessing.)\nAgain he asked Jacob, \"Are you really my son Esau?\"\n\"Certainly,\" Jacob replied.\nThen Isaac said, \"Serve me your game, son, that I may eat of it\nand then give you my blessing.\"\nJacob served it to him, and Isaac ate;\nhe brought him wine, and he drank.\n\nFinally his father Isaac said to Jacob,\n\"Come closer, son, and kiss me.\"\nAs Jacob went up and kissed him,\nIsaac smelled the fragrance of his clothes.\nWith that, he blessed him saying,\n\n\"Ah, the fragrance of my son\nis like the fragrance of a field\nthat the LORD has blessed!\n\n\"May God give to you\nof the dew of the heavens\nAnd of the fertility of the earth\nabundance of grain and wine.\n\n\"Let peoples serve you,\nand nations pay you homage;\nBe master of your brothers,\nand may your mother's sons bow down to you.\nCursed be those who curse you,\nand blessed be those who bless you.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 135:1b-2, 3-4, 5-6",
              "response": "R.(3a) Praise the Lord for the Lord is good!",
              "content": "or:\n\nR. Alleluia.\n\nPraise the name of the LORD;\n\nPraise, you servants of the LORD\n\nWho stand in the house of the LORD,\n\nin the courts of the house of our God.\n\nR. Praise the Lord for the Lord is good!\n\nor:\n\nR. Alleluia.\n\nPraise the LORD, for the LORD is good;\n\nsing praise to his name, which we love;\n\nFor the LORD has chosen Jacob for himself,\n\nIsrael for his own possession.\n\nR. Praise the Lord for the Lord is good!\n\nor:\n\nR. Alleluia.\n\nFor I know that the LORD is great;\n\nour LORD is greater than all gods.\n\nAll that the LORD wills he does\n\nin heaven and on earth,\n\nin the seas and in all the deeps.\n\nR. Praise the Lord for the Lord is good!\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 9:14-17",
              "content": "The disciples of John approached Jesus and said,\n\"Why do we and the Pharisees fast much,\nbut your disciples do not fast?\"\nJesus answered them, \"Can the wedding guests mourn\nas long as the bridegroom is with them?\nThe days will come when the bridegroom is taken away from them,\nand then they will fast.\nNo one patches an old cloak with a piece of unshrunken cloth,\nfor its fullness pulls away from the cloak and the tear gets worse.\nPeople do not put new wine into old wineskins.\nOtherwise the skins burst, the wine spills out, and the skins are ruined.\nRather, they pour new wine into fresh wineskins, and both are preserved.\""
            }
          },
          "saint_of_day": {
            "name": "Anthony Zaccaria",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-06": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.307Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-06": {
          "date": "2025-07-06",
          "liturgical_date": "Fourteenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Isaiah 66:10-14c",
              "content": "Thus says the LORD:\n Rejoice with Jerusalem and be glad because of her,\n all you who love her;\n exult, exult with her,\n all you who were mourning over her!\n Oh, that you may suck fully\n of the milk of her comfort,\n that you may nurse with delight\n at her abundant breasts!\n For thus says the LORD:\n Lo, I will spread prosperity over Jerusalem like a river,\n and the wealth of the nations like an overflowing torrent.\n As nurslings, you shall be carried in her arms,\n and fondled in her lap;\n as a mother comforts her child,\n so will I comfort you;\n in Jerusalem you shall find your comfort.\n\n When you see this, your heart shall rejoice\n and your bodies flourish like the grass;\n the LORD's power shall be known to his servants."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 66:1-3, 4-5, 6-7, 16, 20",
              "response": "R. (1) Let all the earth cry out to God with joy.",
              "content": "Shout joyfully to God, all the earth,\n\nsing praise to the glory of his name;\n\nproclaim his glorious praise.\n\nSay to God, \"How tremendous are your deeds!\"\n\nR. Let all the earth cry out to God with joy.\n\n\"Let all on earth worship and sing praise to you,\n\nsing praise to your name!\"\n\nCome and see the works of God,\n\nhis tremendous deeds among the children of Adam.\n\nR. Let all the earth cry out to God with joy.\n\nHe has changed the sea into dry land;\n\nthrough the river they passed on foot;\n\ntherefore let us rejoice in him.\n\nHe rules by his might forever.\n\nR. Let all the earth cry out to God with joy.\n\nHear now, all you who fear God, while I declare\n\nwhat he has done for me.\n\nBlessed be God who refused me not\n\nmy prayer or his kindness!\n\nR. Let all the earth cry out to God with joy."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nLet the peace of Christ control your hearts;\nlet the word of Christ dwell in you richly.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 10:1-12, 17-20",
              "content": "At that time the Lord appointed seventy-two others\nwhom he sent ahead of him in pairs\nto every town and place he intended to visit.\nHe said to them,\n\"The harvest is abundant but the laborers are few;\nso ask the master of the harvest\nto send out laborers for his harvest.\nGo on your way;\nbehold, I am sending you like lambs among wolves.\nCarry no money bag, no sack, no sandals;\nand greet no one along the way.\nInto whatever house you enter, first say,\n'Peace to this household.'\nIf a peaceful person lives there,\nyour peace will rest on him;\nbut if not, it will return to you.\nStay in the same house and eat and drink what is offered to you,\nfor the laborer deserves his payment.\nDo not move about from one house to another.\nWhatever town you enter and they welcome you,\neat what is set before you,\ncure the sick in it and say to them,\n'The kingdom of God is at hand for you.'\nWhatever town you enter and they do not receive you,\ngo out into the streets and say,\n'The dust of your town that clings to our feet,\neven that we shake off against you.'\nYet know this: the kingdom of God is at hand.\nI tell you,\nit will be more tolerable for Sodom on that day than for that town.\"\n\nThe seventy-two returned rejoicing, and said,\n\"Lord, even the demons are subject to us because of your name.\"\nJesus said, \"I have observed Satan fall like lightning from the sky.\nBehold, I have given you the power to 'tread upon serpents' and  scorpions\nand upon the full force of the enemy and nothing will harm you.  Nevertheless, do not rejoice because the spirits are subject to you,\nbut rejoice because your names are written in heaven.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-07": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:41.978Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-07": {
          "date": "2025-07-07",
          "liturgical_date": "Monday of the Fourteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 28:10-22a",
              "content": "Jacob departed from Beer-sheba and proceeded toward Haran.When he came upon a certain shrine, as the sun had already set,he stopped there for the night.Taking one of the stones at the shrine, he put it under his headand lay down to sleep at that spot.Then he had a dream: a stairway rested on the ground,with its top reaching to the heavens;and God's messengers were going up and down on it.And there was the LORD standing beside him and saying:\"I, the LORD, am the God of your forefather Abrahamand the God of Isaac;the land on which you are lyingI will give to you and your descendants.These shall be as plentiful as the dust of the earth,and through them you shall spread out east and west, north and south.In you and your descendantsall the nations of the earth shall find blessing.Know that I am with you;I will protect you wherever you go,and bring you back to this land.I will never leave you until I have done what I promised you.\"When Jacob awoke from his sleep, he exclaimed,\"Truly, the LORD is in this spot, although I did not know it!\"In solemn wonder he cried out: \"How awesome is this shrine!This is nothing else but an abode of God,and that is the gateway to heaven!\"Early the next morning Jacob took the stonethat he had put under his head,set it up as a memorial stone, and poured oil on top of it.He called the site Bethel,whereas the former name of the town had been Luz.Jacob then made this vow: \"If God remains with me,to protect me on this journey I am makingand to give me enough bread to eat and clothing to wear,and I come back safe to my father's house, the LORD shall be my God.This stone that I have set up as a memorial stone shall be God's abode.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 91:1-2, 3-4, 14-15ab",
              "response": "R.(see 2b) In you, my God, I place my trust.",
              "content": "You who dwell in the shelter of the Most High,\n\nwho abide in the shadow of the Almighty,\n\nSay to the LORD, \"My refuge and my fortress,\n\nmy God, in whom I trust.\"\n\nR. In you, my God, I place my trust.\n\nFor he will rescue you from the snare of the fowler,\n\nfrom the destroying pestilence.\n\nWith his pinions he will cover you,\n\nand under his wings you shall take refuge.\n\nR. In you, my God, I place my trust.\n\nBecause he clings to me, I will deliver him;\n\nI will set him on high because he acknowledges my name.\n\nHe shall call upon me, and I will answer him;\n\nI will be with him in distress.\n\nR. In you, my God, I place my trust."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOur Savior Jesus Christ has destroyed death\nand brought life to light through the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 9:18-26",
              "content": "While Jesus was speaking, an official came forward,knelt down before him, and said,\"My daughter has just died.But come, lay your hand on her, and she will live.\"Jesus rose and followed him, and so did his disciples.A woman suffering hemorrhages for twelve years came up behind himand touched the tassel on his cloak.She said to herself, \"If only I can touch his cloak, I shall be cured.\"Jesus turned around and saw her, and said,\"Courage, daughter!  Your faith has saved you.\"And from that hour the woman was cured.When Jesus arrived at the official's houseand saw the flute players and the crowd who were making a commotion,he said, \"Go away! The girl is not dead but sleeping.\"And they ridiculed him.When the crowd was put out, he came and took her by the hand,and the little girl arose.And news of this spread throughout all that land."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-08": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.239Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-08": {
          "date": "2025-07-08",
          "liturgical_date": "Tuesday of the Fourteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 17:1b, 2-3, 6-7ab, 8b and 15",
              "response": "R.    (15a)  In justice, I shall behold your face, O Lord.",
              "content": "Hear, O LORD, a just suit;\n\nattend to my outcry;\n\nhearken to my prayer from lips without deceit.\n\nR.    In justice, I shall behold your face, O Lord.\n\nFrom you let my judgment come;\n\nyour eyes behold what is right.\n\nThough you test my heart, searching it in the night,\n\nthough you try me with fire, you shall find no malice in me.\n\nR.    In justice, I shall behold your face, O Lord.\n\nI call upon you, for you will answer me, O God;\n\nincline your ear to me; hear my word.\n\nShow your wondrous mercies,\n\nO savior of those who flee from their foes.\n\nR.    In justice, I shall behold your face, O Lord.\n\nHide me in the shadow of your wings.\n\nI in justice shall behold your face;\n\non waking, I shall be content in your presence.\n\nR.    In justice, I shall behold your face, O Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the good shepherd, says the Lord;\nI know my sheep, and mine know me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 9:32-38",
              "content": "A demoniac who could not speak was brought to Jesus,\nand when the demon was driven out the mute man spoke.\nThe crowds were amazed and said,\n“Nothing like this has ever been seen in Israel.”\nBut the Pharisees said,\n“He drives out demons by the prince of demons.”\n\nJesus went around to all the towns and villages,\nteaching in their synagogues,\nproclaiming the Gospel of the Kingdom,\nand curing every disease and illness.\nAt the sight of the crowds, his heart was moved with pity for them\nbecause they were troubled and abandoned,\nlike sheep without a shepherd.\nThen he said to his disciples,\n“The harvest is abundant but the laborers are few;\nso ask the master of the harvest\nto send out laborers for his harvest.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-09": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.494Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-09": {
          "date": "2025-07-09",
          "liturgical_date": "Wednesday of the Fourteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 41:55-57; 42:5-7a, 17-24a",
              "content": "When hunger came to be felt throughout the land of Egypt\nand the people cried to Pharaoh for bread,\nPharaoh directed all the Egyptians to go to Joseph\nand do whatever he told them.\nWhen the famine had spread throughout the land,\nJoseph opened all the cities that had grain\nand rationed it to the Egyptians,\nsince the famine had gripped the land of Egypt.\nIn fact, all the world came to Joseph to obtain rations of grain,\nfor famine had gripped the whole world.\n\nThe sons of Israel were among those\nwho came to procure rations.\n\nIt was Joseph, as governor of the country,\nwho dispensed the rations to all the people.\nWhen Joseph's brothers came and knelt down before him\nwith their faces to the ground,\nhe recognized them as soon as he saw them.\nBut Joseph concealed his own identity from them\nand spoke sternly to them.\n\nWith that, he locked them up in the guardhouse for three days.\n\nOn the third day Joseph said to his brothers:\n\"Do this, and you shall live; for I am a God-fearing man.\nIf you have been honest,\nonly one of your brothers need be confined in this prison,\nwhile the rest of you may go\nand take home provisions for your starving families.\nBut you must come back to me with your youngest brother.\nYour words will thus be verified, and you will not die.\"\nTo this they agreed.\nTo one another, however, they said:\n\"Alas, we are being punished because of our brother.\nWe saw the anguish of his heart when he pleaded with us,\nyet we paid no heed;\nthat is why this anguish has now come upon us.\"\nReuben broke in,\n\"Did I not tell you not to do wrong to the boy?\nBut you would not listen!\nNow comes the reckoning for his blood.\"\nThe brothers did not know, of course,\nthat Joseph understood what they said,\nsince he spoke with them through an interpreter.\nBut turning away from them, he wept."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 33:2-3, 10-11, 18-19",
              "response": "R. (22) Lord, let your mercy be on us, as we place our trust in you.",
              "content": "Give thanks to the LORD on the harp;\n\nwith the ten-stringed lyre chant his praises.\n\nSing to him a new song;\n\npluck the strings skillfully, with shouts of gladness.\n\nR. Lord, let your mercy be on us, as we place our trust in you.\n\nThe LORD brings to nought the plans of nations;\n\nhe foils the designs of peoples.\n\nBut the plan of the LORD stands forever;\n\nthe design of his heart, through all generations.\n\nR. Lord, let your mercy be on us, as we place our trust in you.\n\nBut see, the eyes of the LORD are upon those who fear him,\n\nupon those who hope for his kindness,\n\nTo deliver them from death\n\nand preserve them in spite of famine.\n\nR. Lord, let your mercy be on us, as we place our trust in you."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Kingdom of God is at hand:\nrepent and believe in the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 10:1-7",
              "content": "Jesus summoned his Twelve disciples\nand gave them authority over unclean spirits to drive them out\nand to cure every disease and every illness.\nThe names of the Twelve Apostles are these:\nfirst, Simon called Peter, and his brother Andrew;\nJames, the son of Zebedee, and his brother John;\nPhilip and Bartholomew,\nThomas and Matthew the tax collector;\nJames, the son of Alphaeus, and Thaddeus;\nSimon the Cananean, and Judas Iscariot\nwho betrayed Jesus.\n\nJesus sent out these Twelve after instructing them thus,\n\"Do not go into pagan territory or enter a Samaritan town.\nGo rather to the lost sheep of the house of Israel.\nAs you go, make this proclamation: 'The Kingdom of heaven is at hand.'\""
            }
          },
          "saint_of_day": {
            "name": "Augustine Zhao Rong",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-10": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.606Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-10": {
          "date": "2025-07-10",
          "liturgical_date": "Thursday of the Fourteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 44:18-21, 23b-29; 45:1-5",
              "content": "Judah approached Joseph and said: \"I beg you, my lord,\nlet your servant speak earnestly to my lord,\nand do not become angry with your servant,\nfor you are the equal of Pharaoh.\nMy lord asked your servants, 'Have you a father, or another brother?'\nSo we said to my lord, 'We have an aged father,\nand a young brother, the child of his old age.\nThis one's full brother is dead,\nand since he is the only one by that mother who is left,\nhis father dotes on him.'\nThen you told your servants,\n'Bring him down to me that my eyes may look on him.\nUnless your youngest brother comes back with you,\nyou shall not come into my presence again.'\nWhen we returned to your servant our father,\nwe reported to him the words of my lord.\n\n\"Later, our father told us to come back and buy some food for the family.\nSo we reminded him, 'We cannot go down there;\nonly if our youngest brother is with us can we go,\nfor we may not see the man if our youngest brother is not with us.'\nThen your servant our father said to us,\n'As you know, my wife bore me two sons.\nOne of them, however, disappeared, and I had to conclude\nthat he must have been torn to pieces by wild beasts;\nI have not seen him since.\nIf you now take this one away from me, too,\nand some disaster befalls him,\nyou will send my white head down to the nether world in grief.'\"\n\nJoseph could no longer control himself\nin the presence of all his attendants,\nso he cried out, \"Have everyone withdraw from me!\"\nThus no one else was about when he made himself known to his brothers.\nBut his sobs were so loud that the Egyptians heard him,\nand so the news reached Pharaoh's palace.\n\"I am Joseph,\" he said to his brothers.\n\"Is my father still in good health?\"\nBut his brothers could give him no answer,\nso dumbfounded were they at him.\n\n\"Come closer to me,\" he told his brothers.\nWhen they had done so, he said:\n\"I am your brother Joseph, whom you once sold into Egypt.\nBut now do not be distressed,\nand do not reproach yourselves for having sold me here.\nIt was really for the sake of saving lives\nthat God sent me here ahead of you.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 105:16-17, 18-19, 20-21",
              "response": "R. (5a) Remember the marvels the Lord has done.",
              "content": "or:\n\nR. Alleluia.\n\nWhen the LORD called down a famine on the land\n\nand ruined the crop that sustained them,\n\nHe sent a man before them,\n\nJoseph, sold as a slave.\n\nR. Remember the marvels the Lord has done.\n\nor:\n\nR. Alleluia.\n\nThey had weighed him down with fetters,\n\nand he was bound with chains,\n\nTill his prediction came to pass\n\nand the word of the LORD proved him true.\n\nR. Remember the marvels the Lord has done.\n\nor:\n\nR. Alleluia.\n\nThe king sent and released him,\n\nthe ruler of the peoples set him free.\n\nHe made him lord of his house\n\nand ruler of all his possessions.\n\nR. Remember the marvels the Lord has done.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Kingdom of God is at hand:\nrepent and believe in the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 10:7-15",
              "content": "Jesus said to his Apostles:\n\"As you go, make this proclamation:\n'The Kingdom of heaven is at hand.'\nCure the sick, raise the dead,\ncleanse the lepers, drive out demons.\nWithout cost you have received; without cost you are to give.\nDo not take gold or silver or copper for your belts;\nno sack for the journey, or a second tunic,\nor sandals, or walking stick.\nThe laborer deserves his keep.\nWhatever town or village you enter, look for a worthy person in it,\nand stay there until you leave.\nAs you enter a house, wish it peace.\nIf the house is worthy,\nlet your peace come upon it;\nif not, let your peace return to you.\nWhoever will not receive you or listen to your words—\ngo outside that house or town and shake the dust from your feet.\nAmen, I say to you, it will be more tolerable\nfor the land of Sodom and Gomorrah on the day of judgment\nthan for that town.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-11": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.654Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-11": {
          "date": "2025-07-11",
          "liturgical_date": "Memorial of Saint Benedict, Abbot",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 46:1-7, 28-30",
              "content": "Israel set out with all that was his.\nWhen he arrived at Beer-sheba,\nhe offered sacrifices to the God of his father Isaac.\nThere God, speaking to Israel in a vision by night, called,\n\"Jacob! Jacob!\"\nHe answered, \"Here I am.\"\nThen he said: \"I am God, the God of your father.\nDo not be afraid to go down to Egypt,\nfor there I will make you a great nation.\nNot only will I go down to Egypt with you;\nI will also bring you back here, after Joseph has closed your eyes.\"\n\nSo Jacob departed from Beer-sheba,\nand the sons of Israel\nput their father and their wives and children\non the wagons that Pharaoh had sent for his transport.\nThey took with them their livestock\nand the possessions they had acquired in the land of Canaan.\nThus Jacob and all his descendants migrated to Egypt.\nHis sons and his grandsons, his daughters and his granddaughters—\nall his descendants—he took with him to Egypt.\n\nIsrael had sent Judah ahead to Joseph,\nso that he might meet him in Goshen.\nOn his arrival in the region of Goshen,\nJoseph hitched the horses to his chariot\nand rode to meet his father Israel in Goshen.\nAs soon as Joseph saw him, he flung himself on his neck\nand wept a long time in his arms.\nAnd Israel said to Joseph, \"At last I can die,\nnow that I have seen for myself that Joseph is still alive.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 37:3-4, 18-19, 27-28, 39-40",
              "response": "R. (39a) The salvation of the just comes from the Lord.",
              "content": "Trust in the LORD and do good,\n\nthat you may dwell in the land and be fed in security.\n\nTake delight in the LORD,\n\nand he will grant you your heart's requests.\n\nR. The salvation of the just comes from the Lord.\n\nThe LORD watches over the lives of the wholehearted;\n\ntheir inheritance lasts forever.\n\nThey are not put to shame in an evil time;\n\nin days of famine they have plenty.\n\nR. The salvation of the just comes from the Lord.\n\nTurn from evil and do good,\n\nthat you may abide forever;\n\nFor the LORD loves what is right,\n\nand forsakes not his faithful ones.\n\nR. The salvation of the just comes from the Lord.\n\nThe salvation of the just is from the LORD;\n\nhe is their refuge in time of distress.\n\nAnd the LORD helps them and delivers them;\n\nhe delivers them from the wicked and saves them,\n\nbecause they take refuge in him.\n\nR. The salvation of the just comes from the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhen the Spirit of truth comes,\nhe will guide you to all truth\nand remind you of all I told you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 10:16-23",
              "content": "Jesus said to his Apostles:\n\"Behold, I am sending you like sheep in the midst of wolves;\nso be shrewd as serpents and simple as doves.\nBut beware of men,\nfor they will hand you over to courts\nand scourge you in their synagogues,\nand you will be led before governors and kings for my sake\nas a witness before them and the pagans.\nWhen they hand you over,\ndo not worry about how you are to speak\nor what you are to say.\nYou will be given at that moment what you are to say.\nFor it will not be you who speak\nbut the Spirit of your Father speaking through you.\nBrother will hand over brother to death,\nand the father his child;\nchildren will rise up against parents and have them put to death.\nYou will be hated by all because of my name,\nbut whoever endures to the end will be saved.\nWhen they persecute you in one town, flee to another.\nAmen, I say to you, you will not finish the towns of Israel\nbefore the Son of Man comes.\""
            }
          },
          "saint_of_day": {
            "name": "Benedict",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-12": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.820Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-12": {
          "date": "2025-07-12",
          "liturgical_date": "Saturday of the Fourteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 105:1-2, 3-4, 6-7",
              "response": "R.    (see Psalm 69:33) Be glad you lowly ones; may your hearts be glad!",
              "content": "Give thanks to the LORD, invoke his name;\n\nmake known among the nations his deeds.\n\nSing to him, sing his praise,\n\nproclaim all his wondrous deeds.\n\nR.    Be glad you lowly ones; may your hearts be glad!\n\nGlory in his holy name;\n\nrejoice, O hearts that seek the LORD!\n\nLook to the LORD in his strength;\n\nseek to serve him constantly.\n\nR.    Be glad you lowly ones; may your hearts be glad!\n\nYou descendants of Abraham, his servants,\n\nsons of Jacob, his chosen ones!\n\nHe, the LORD, is our God;\n\nthroughout the earth his judgments prevail.\n\nR.    Be glad you lowly ones; may your hearts be glad!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf you are insulted for the name of Christ, blessed are you,\nfor the Spirit of God rests upon you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 10:24-33",
              "content": "Jesus said to his Apostles: \n“No disciple is above his teacher,\nno slave above his master.\nIt is enough for the disciple that he become like his teacher,\nfor the slave that he become like his master.\nIf they have called the master of the house Beelzebul,\nhow much more those of his household!\n\n“Therefore do not be afraid of them.\nNothing is concealed that will not be revealed,\nnor secret that will not be known.\nWhat I say to you in the darkness, speak in the light;\nwhat you hear whispered, proclaim on the housetops.\nAnd do not be afraid of those who kill the body but cannot kill the soul;\nrather, be afraid of the one who can destroy\nboth soul and body in Gehenna.\nAre not two sparrows sold for a small coin?\nYet not one of them falls to the ground without your Father’s knowledge.\nEven all the hairs of your head are counted.\nSo do not be afraid; you are worth more than many sparrows.\nEveryone who acknowledges me before others\nI will acknowledge before my heavenly Father.\nBut whoever denies me before others,\nI will deny before my heavenly Father.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-13": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.654Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-13": {
          "date": "2025-07-13",
          "liturgical_date": "Fifteenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Deuteronomy 30:10-14",
              "content": "Moses said to the people:\n\"If only you would heed the voice of the LORD, your God,\nand keep his commandments and statutes\nthat are written in this book of the law,\nwhen you return to the LORD, your God,\nwith all your heart and all your soul.\n\n\"For this command that I enjoin on you today\nis not too mysterious and remote for you.\nIt is not up in the sky, that you should say,\n'Who will go up in the sky to get it for us\nand tell us of it, that we may carry it out?'\nNor is it across the sea, that you should say,\n'Who will cross the sea to get it for us\nand tell us of it, that we may carry it out?'\nNo, it is something very near to you,\nalready in your mouths and in your hearts;\nyou have only to carry it out.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 69:14, 17, 30-31, 33-34, 36, 37",
              "response": "R. (cf. 33)  Turn to the Lord in your need, and you will live.I pray to you, O LORD, for the time of your favor, O God!In your great kindness answer me with your constant help.Answer me, O LORD, for bounteous is your kindness: in your great mercy turn toward me.R. Turn to the Lord in your need, and you will live.I am afflicted and in pain; let your saving help, O God, protect me.I will praise the name of God in song, and I will glorify him with thanksgiving.R. Turn to the Lord in your need, and you will live.\"See, you lowly ones, and be glad; you who seek God, may your hearts revive!For the LORD hears the poor, and his own who are in bonds he spurns not.\"R. Turn to the Lord in your need, and you will live.For God will save Zion and rebuild the cities of Judah.The descendants of his servants shall inherit it, and those who love his name shall inhabit it.R. Turn to the Lord in your need, and you will live.",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life;\nyou have the words of everlasting life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 10:25-37",
              "content": "There was a scholar of the law who stood up to test Jesus and said,\"Teacher, what must I do to inherit eternal life?\"Jesus said to him, \"What is written in the law?How do you read it?\"He said in reply,\"You shall love the Lord, your God,with all your heart,with all your being,with all your strength,and with all your mind,and your neighbor as yourself.\"He replied to him, \"You have answered correctly;do this and you will live.\"But because he wished to justify himself, he said to Jesus,\"And who is my neighbor?\"Jesus replied,\"A man fell victim to robbersas he went down from Jerusalem to Jericho.They stripped and beat him and went off leaving him half-dead.A priest happened to be going down that road,but when he saw him, he passed by on the opposite side.Likewise a Levite came to the place,and when he saw him, he passed by on the opposite side.But a Samaritan traveler who came upon himwas moved with compassion at the sight.He approached the victim,poured oil and wine over his wounds and bandaged them.Then he lifted him up on his own animal,took him to an inn, and cared for him.The next day he took out two silver coinsand gave them to the innkeeper with the instruction,'Take care of him.If you spend more than what I have given you,I shall repay you on my way back.'Which of these three, in your opinion,was neighbor to the robbers' victim?\"He answered, \"The one who treated him with mercy.\"Jesus said to him, \"Go and do likewise.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-14": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.879Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-14": {
          "date": "2025-07-14",
          "liturgical_date": "Memorial of Saint Kateri Tekakwitha, Virgin [In the Dioceses of the United States]",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 1:8-14, 22",
              "content": "A new king, who knew nothing of Joseph, came to power in Egypt.\nHe said to his subjects, \"Look how numerous and powerful\nthe people of the children of Israel are growing, more so than we ourselves!\nCome, let us deal shrewdly with them to stop their increase;\notherwise, in time of war they too may join our enemies\nto fight against us, and so leave our country.\"\n\nAccordingly, taskmasters were set over the children of Israel\nto oppress them with forced labor.\nThus they had to build for Pharaoh\nthe supply cities of Pithom and Raamses.\nYet the more they were oppressed,\nthe more they multiplied and spread.\nThe Egyptians, then, dreaded the children of Israel\nand reduced them to cruel slavery,\nmaking life bitter for them with hard work in mortar and brick\nand all kinds of field work—the whole cruel fate of slaves.\n\nPharaoh then commanded all his subjects,\n\"Throw into the river every boy that is born to the Hebrews,\nbut you may let all the girls live.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 124:1b-3, 4-6, 7-8",
              "response": "R. (8a) Our help is in the name of the Lord.",
              "content": "Had not the LORD been with us–\n\nlet Israel say, had not the LORD been with us–\n\nWhen men rose up against us,\n\nthen would they have swallowed us alive,\n\nWhen their fury was inflamed against us.\n\nR. Our help is in the name of the Lord.\n\nThen would the waters have overwhelmed us;\n\nThe torrent would have swept over us;\n\nover us then would have swept\n\nthe raging waters.\n\nBlessed be the LORD, who did not leave us\n\na prey to their teeth.\n\nR. Our help is in the name of the Lord.\n\nWe were rescued like a bird\n\nfrom the fowlers' snare;\n\nBroken was the snare,\n\nand we were freed.\n\nOur help is in the name of the LORD,\n\nwho made heaven and earth.\n\nR. Our help is in the name of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who are persecuted for the sake of righteousness,\nfor theirs is the Kingdom of heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 10:34—11:1",
              "content": "Jesus said to his Apostles:\n\"Do not think that I have come to bring peace upon the earth.\nI have come to bring not peace but the sword.\nFor I have come to set\na man against his father,\na daughter against her mother,\nand a daughter-in-law against her mother-in-law;\nand one's enemies will be those of his household.\n\n\"Whoever loves father or mother more than me is not worthy of me,\nand whoever loves son or daughter more than me is not worthy of me;\nand whoever does not take up his cross\nand follow after me is not worthy of me.\nWhoever finds his life will lose it,\nand whoever loses his life for my sake will find it.\n\n\"Whoever receives you receives me,\nand whoever receives me receives the one who sent me.\nWhoever receives a prophet because he is a prophet\nwill receive a prophet's reward,\nand whoever receives a righteous man\nbecause he is righteous\nwill receive a righteous man's reward.\nAnd whoever gives only a cup of cold water\nto one of these little ones to drink\nbecause he is a disciple–\namen, I say to you, he will surely not lose his reward.\"\n\nWhen Jesus finished giving these commands to his Twelve disciples,\nhe went away from that place to teach and to preach in their towns."
            }
          },
          "saint_of_day": {
            "name": "Kateri Tekakwitha",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-15": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.480Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-15": {
          "date": "2025-07-15",
          "liturgical_date": "Memorial of Saint Bonaventure, Bishop and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 2:1-15a",
              "content": "A certain man of the house of Levi married a Levite woman,\nwho conceived and bore a son.\nSeeing that he was a goodly child, she hid him for three months.\nWhen she could hide him no longer, she took a papyrus basket,\ndaubed it with bitumen and pitch,\nand putting the child in it,\nplaced it among the reeds on the river bank.\nHis sister stationed herself at a distance\nto find out what would happen to him.\n\nPharaoh's daughter came down to the river to bathe,\nwhile her maids walked along the river bank.\nNoticing the basket among the reeds, she sent her handmaid to fetch it.\nOn opening it, she looked, and lo, there was a baby boy, crying!\nShe was moved with pity for him and said,\n\"It is one of the Hebrews' children.\"\nThen his sister asked Pharaoh's daughter,\n\"Shall I go and call one of the Hebrew women\nto nurse the child for you?\"\n\"Yes, do so,\" she answered.\nSo the maiden went and called the child's own mother.\nPharaoh's daughter said to her,\n\"Take this child and nurse it for me, and I will repay you.\"\nThe woman therefore took the child and nursed it.\nWhen the child grew, she brought him to Pharaoh's daughter,\nwho adopted him as her son and called him Moses;\nfor she said, \"I drew him out of the water.\"\n\nOn one occasion, after Moses had grown up,\nwhen he visited his kinsmen and witnessed their forced labor,\nhe saw an Egyptian striking a Hebrew, one of his own kinsmen.\nLooking about and seeing no one,\nhe slew the Egyptian and hid him in the sand.\nThe next day he went out again, and now two Hebrews were fighting!\nSo he asked the culprit,\n\"Why are you striking your fellow Hebrew?\"\nBut the culprit replied,\n\"Who has appointed you ruler and judge over us?\nAre you thinking of killing me as you killed the Egyptian?\"\nThen Moses became afraid and thought,\n\"The affair must certainly be known.\"\n\nPharaoh, too, heard of the affair and sought to put Moses to death.\nBut Moses fled from him and stayed in the land of Midian."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 69:3, 14, 30-31, 33-34",
              "response": "R. (see 33) Turn to the Lord in your need, and you will live.",
              "content": "I am sunk in the abysmal swamp\n\nwhere there is no foothold;\n\nI have reached the watery depths;\n\nthe flood overwhelms me.\n\nR. Turn to the Lord in your need, and you will live.\n\nBut I pray to you, O LORD,\n\nfor the time of your favor, O God!\n\nIn your great kindness answer me\n\nwith your constant help.\n\nR. Turn to the Lord in your need, and you will live.\n\nBut I am afflicted and in pain;\n\nlet your saving help, O God, protect me;\n\nI will praise the name of God in song,\n\nand I will glorify him with thanksgiving.\n\nR. Turn to the Lord in your need, and you will live.\n\n\"See, you lowly ones, and be glad;\n\nyou who seek God, may your hearts revive!\n\nFor the LORD hears the poor,\n\nand his own who are in bonds he spurns not.\"\n\nR. Turn to the Lord in your need, and you will live."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf today you hear his voice,\nharden not your hearts.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 11:20-24",
              "content": "Jesus began to reproach the towns\nwhere most of his mighty deeds had been done,\nsince they had not repented.\n\"Woe to you, Chorazin! Woe to you, Bethsaida!\nFor if the mighty deeds done in your midst\nhad been done in Tyre and Sidon,\nthey would long ago have repented in sackcloth and ashes.\nBut I tell you, it will be more tolerable\nfor Tyre and Sidon on the day of judgment than for you.\nAnd as for you, Capernaum:\n\nWill you be exalted to heaven?\nYou will go down to the netherworld.\n\nFor if the mighty deeds done in your midst had been done in Sodom,\nit would have remained until this day.\nBut I tell you, it will be more tolerable\nfor the land of Sodom on the day of judgment than for you.\""
            }
          },
          "saint_of_day": {
            "name": "Bonaventure",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-16": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.870Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-16": {
          "date": "2025-07-16",
          "liturgical_date": "Wednesday of the Fifteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 3:1-6, 9-12",
              "content": "Moses was tending the flock of his father-in-law Jethro, the priest of Midian.\nLeading the flock across the desert, he came to Horeb,\nthe mountain of God.\nThere an angel of the LORD appeared to him in fire\nflaming out of a bush.\nAs he looked on, he was surprised to see that the bush,\nthough on fire, was not consumed.\nSo Moses decided,\n\"I must go over to look at this remarkable sight,\nand see why the bush is not burned.\"\n\nWhen the LORD saw him coming over to look at it more closely,\nGod called out to him from the bush, \"Moses! Moses!\"\nHe answered, \"Here I am.\"\nGod said, \"Come no nearer!\nRemove the sandals from your feet,\nfor the place where you stand is holy ground.\nI am the God of your father,\" he continued,\n\"the God of Abraham, the God of Isaac, the God of Jacob.\nThe cry of the children of Israel has reached me,\nand I have truly noted that the Egyptians are oppressing them.\nCome, now! I will send you to Pharaoh to lead my people,\nthe children of Israel, out of Egypt.\"\n\nBut Moses said to God,\n\"Who am I that I should go to Pharaoh\nand lead the children of Israel out of Egypt?\"\nHe answered, \"I will be with you;\nand this shall be your proof that it is I who have sent you:\nwhen you bring my people out of Egypt,\nyou will worship God on this very mountain.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 103:1b-2, 3-4, 6-7",
              "response": "R. (8a) The Lord is kind and merciful.",
              "content": "Bless the LORD, O my soul;\n\nand all my being, bless his holy name.\n\nBless the LORD, O my soul,\n\nand forget not all his benefits.\n\nR. The Lord is kind and merciful.\n\nHe pardons all your iniquities,\n\nhe heals all your ills.\n\nHe redeems your life from destruction,\n\nhe crowns you with kindness and compassion.\n\nR. The Lord is kind and merciful.\n\nThe LORD secures justice\n\nand the rights of all the oppressed.\n\nHe has made known his ways to Moses,\n\nand his deeds to the children of Israel.\n\nR. The Lord is kind and merciful."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, Father, Lord of heaven and earth;\nyou have revealed to little ones the mysteries of the Kingdom.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 11:25-27",
              "content": "At that time Jesus exclaimed:\n\"I give praise to you, Father, Lord of heaven and earth,\nfor although you have hidden these things\nfrom the wise and the learned\nyou have revealed them to the childlike.\nYes, Father, such has been your gracious will.\nAll things have been handed over to me by my Father.\nNo one knows the Son except the Father,\nand no one knows the Father except the Son\nand anyone to whom the Son wishes to reveal him.\""
            }
          },
          "saint_of_day": {
            "name": "Our Lady Mount Carmel",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-17": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.820Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-17": {
          "date": "2025-07-17",
          "liturgical_date": "Thursday of the Fifteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 3:13-20",
              "content": "Moses, hearing the voice of the LORD from the burning bush, said to him,\"When I go to the children of Israel and say to them,'The God of your fathers has sent me to you,'if they ask me, 'What is his name?' what am I to tell them?\"God replied, \"I am who am.\"Then he added, \"This is what you shall tell the children of Israel:I AM sent me to you.\"God spoke further to Moses, \"Thus shall you say to the children of Israel:The LORD, the God of your fathers,the God of Abraham, the God of Isaac, the God of Jacob,has sent me to you.\"This is my name forever;this my title for all generations.\"Go and assemble the elders of Israel, and tell them:The LORD, the God of your fathers,the God of Abraham, Isaac, and Jacob,has appeared to me and said:I am concerned about youand about the way you are being treated in Egypt;so I have decided to lead you up out of the misery of Egyptinto the land of the Canaanites, Hittites, Amorites,Perizzites, Hivites, and Jebusites,a land flowing with milk and honey.\"Thus they will heed your message.Then you and the elders of Israelshall go to the king of Egypt and say to him:\"The LORD, the God of the Hebrews, has sent us word.Permit us, then, to go a three-days' journey in the desert,that we may offer sacrifice to the LORD, our God.\"Yet I know that the king of Egypt will not allow you to gounless he is forced.I will stretch out my hand, therefore,and smite Egypt by doing all kinds of wondrous deeds there.After that he will send you away.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 105:1 and 5, 8-9, 24-25, 26-27",
              "response": "R.(8a) The Lord remembers his covenant for ever.",
              "content": "or:\n\nR. Alleluia.\n\nGive thanks to the LORD, invoke his name;\n\nmake known among the nations his deeds.\n\nRecall the wondrous deeds that he has wrought,\n\nhis portents, and the judgments he has uttered.\n\nR. The Lord remembers his covenant for ever.\n\nor:\n\nR. Alleluia.\n\nHe remembers forever his covenant\n\nwhich he made binding for a thousand generations--\n\nWhich he entered into with Abraham\n\nand by his oath to Isaac.\n\nR. The Lord remembers his covenant for ever.\n\nor:\n\nR. Alleluia.\n\nHe greatly increased his people\n\nand made them stronger than their foes,\n\nWhose hearts he changed, so that they hated his people,\n\nand dealt deceitfully with his servants.\n\nR. The Lord remembers his covenant for ever.\n\nor:\n\nR. Alleluia.\n\nHe sent Moses his servant;\n\nAaron, whom he had chosen.\n\nThey wrought his signs among them,\n\nand wonders in the land of Ham.\n\nR. The Lord remembers his covenant for ever.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nCome to me, all you who labor and are burdened,\nand I will give you rest, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 11:28-30",
              "content": "Jesus said:\n\"Come to me, all you who labor and are burdened,\nand I will give you rest.\nTake my yoke upon you and learn from me,\nfor I am meek and humble of heart;\nand you will find rest for yourselves.\nFor my yoke is easy, and my burden light.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-18": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.878Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-18": {
          "date": "2025-07-18",
          "liturgical_date": "Friday of the Fifteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 11:10—12:14",
              "content": "Although Moses and Aaron performed various wonders\nin Pharaoh's presence,\nthe LORD made Pharaoh obstinate,\nand he would not let the children of Israel leave his land.\n\nThe LORD said to Moses and Aaron in the land of Egypt,\n\"This month shall stand at the head of your calendar;\nyou shall reckon it the first month of the year.\nTell the whole community of Israel: On the tenth of this month\nevery one of your families must procure for itself a lamb,\none apiece for each household.\nIf a family is too small for a whole lamb,\nit shall join the nearest household in procuring one\nand shall share in the lamb\nin proportion to the number of persons who partake of it.\nThe lamb must be a year-old male and without blemish.\nYou may take it from either the sheep or the goats.\nYou shall keep it until the fourteenth day of this month, and then,\nwith the whole assembly of Israel present,\nit shall be slaughtered during the evening twilight.\nThey shall take some of its blood\nand apply it to the two doorposts and the lintel\nof every house in which they partake of the lamb.\nThat same night they shall eat its roasted flesh\nwith unleavened bread and bitter herbs.\nIt shall not be eaten raw or boiled, but roasted whole,\nwith its head and shanks and inner organs.\nNone of it must be kept beyond the next morning;\nwhatever is left over in the morning shall be burned up.\n\n\"This is how you are to eat it:\nwith your loins girt, sandals on your feet and your staff in hand,\nyou shall eat like those who are in flight.\nIt is the Passover of the LORD.\nFor on this same night I will go through Egypt,\nstriking down every first born of the land, both man and beast,\nand executing judgment on all the gods of Egypt—I, the LORD!\nBut the blood will mark the houses where you are.\nSeeing the blood, I will pass over you;\nthus, when I strike the land of Egypt,\nno destructive blow will come upon you.\n\n\"This day shall be a memorial feast for you,\nwhich all your generations shall celebrate\nwith pilgrimage to the LORD, as a perpetual institution.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 116:12-13, 15 and 16bc, 17-18",
              "response": "R. (13) I will take the cup of salvation, and call on the name of the Lord.",
              "content": "How shall I make a return to the LORD\n\nfor all the good he has done for me?\n\nThe cup of salvation I will take up,\n\nand I will call upon the name of the LORD.\n\nR. I will take the cup of salvation, and call on the name of the Lord.\n\nPrecious in the eyes of the LORD\n\nis the death of his faithful ones.\n\nI am your servant, the son of your handmaid;\n\nyou have loosed my bonds.\n\nR. I will take the cup of salvation, and call on the name of the Lord.\n\nTo you will I offer sacrifice of thanksgiving,\n\nand I will call upon the name of the LORD.\n\nMy vows to the LORD I will pay\n\nin the presence of all his people.\n\nR. I will take the cup of salvation, and call on the name of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord,\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 12:1-8",
              "content": "Jesus was going through a field of grain on the sabbath.\nHis disciples were hungry\nand began to pick the heads of grain and eat them.\nWhen the Pharisees saw this, they said to him,\n\"See, your disciples are doing what is unlawful to do on the sabbath.\"\nHe said to them, \"Have you not read what David did\nwhen he and his companions were hungry,\nhow he went into the house of God and ate the bread of offering,\nwhich neither he nor his companions\nbut only the priests could lawfully eat?\nOr have you not read in the law that on the sabbath\nthe priests serving in the temple violate the sabbath\nand are innocent?\nI say to you, something greater than the temple is here.\nIf you knew what this meant, I desire mercy, not sacrifice,\nyou would not have condemned these innocent men.\nFor the Son of Man is Lord of the sabbath.\""
            }
          },
          "saint_of_day": {
            "name": "Camillus De Lellis",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-19": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.775Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-19": {
          "date": "2025-07-19",
          "liturgical_date": "Saturday of the Fifteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 136:1 and 23-24, 10-12, 13-15",
              "response": "R.    His mercy endures forever.",
              "content": "or:\n\nR.    Alleluia.\n\nGive thanks to the LORD, for he is good,\n\nfor his mercy endures forever;\n\nWho remembered us in our abjection,\n\nfor his mercy endures forever;\n\nAnd freed us from our foes,\n\nfor his mercy endures forever.\n\nR.    His mercy endures forever.\n\nor:\n\nR.    Alleluia.\n\nWho smote the Egyptians in their first-born,\n\nfor his mercy endures forever;\n\nAnd brought out Israel from their midst,\n\nfor his mercy endures forever;\n\nWith a mighty hand and an outstretched arm,\n\nfor his mercy endures forever.\n\nR.    His mercy endures forever.\n\nor:\n\nR.    Alleluia.\n\nWho split the Red Sea in twain,\n\nfor his mercy endures forever;\n\nAnd led Israel through its midst,\n\nfor his mercy endures forever;\n\nBut swept Pharaoh and his army into the Red Sea,\n\nfor his mercy endures forever.\n\nR.    His mercy endures forever.\n\nor:\n\nR.    Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nGod was reconciling the world to himself in Christ,\nand entrusting to us the message of reconciliation.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 12:14-21",
              "content": "The Pharisees went out and took counsel against Jesus\nto put him to death.\n\nWhen Jesus realized this, he withdrew from that place.\nMany people followed him, and he cured them all,\nbut he warned them not to make him known.\nThis was to fulfill what had been spoken through Isaiah the prophet:\n\nBehold, my servant whom I have chosen,\n        my beloved in whom I delight;\n    I shall place my Spirit upon him,\n        and he will proclaim justice to the Gentiles.\n    He will not contend or cry out,\n        nor will anyone hear his voice in the streets.\n    A bruised reed he will not break,\n        a smoldering wick he will not quench,\n    until he brings justice to victory.\n        And in his name the Gentiles will hope."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-20": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.874Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-20": {
          "date": "2025-07-20",
          "liturgical_date": "Sixteenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 18:1-10a",
              "content": "The LORD appeared to Abraham by the terebinth of Mamre,\nas he sat in the entrance of his tent,\nwhile the day was growing hot.\nLooking up, Abraham saw three men standing nearby.\nWhen he saw them, he ran from the entrance of the tent to greet them;\nand bowing to the ground, he said:\n\"Sir, if I may ask you this favor,\nplease do not go on past your servant.\nLet some water be brought, that you may bathe your feet,\nand then rest yourselves under the tree.\nNow that you have come this close to your servant,\nlet me bring you a little food, that you may refresh yourselves;\nand afterward you may go on your way.\"\nThe men replied, \"Very well, do as you have said.\"\n\nAbraham hastened into the tent and told Sarah,\n\"Quick, three measures of fine flour! Knead it and make rolls.\"\nHe ran to the herd, picked out a tender, choice steer,\nand gave it to a servant, who quickly prepared it.\nThen Abraham got some curds and milk,\nas well as the steer that had been prepared,\nand set these before the three men;\nand he waited on them under the tree while they ate.\n\nThey asked Abraham, \"Where is your wife Sarah?\"\nHe replied, \"There in the tent.\"\nOne of them said, \"I will surely return to you about this time next year,\nand Sarah will then have a son.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 15:2-3, 3-4, 5",
              "response": "R.(1a) He who does justice will live in the presence of the Lord.",
              "content": "One who walks blamelessly and does justice;\n\nwho thinks the truth in his heart\n\nand slanders not with his tongue.\n\nR. He who does justice will live in the presence of the Lord.\n\nWho harms not his fellow man,\n\nnor takes up a reproach against his neighbor;\n\nby whom the reprobate is despised,\n\nwhile he honors those who fear the LORD.\n\nR. He who does justice will live in the presence of the Lord.\n\nWho lends not his money at usury\n\nand accepts no bribe against the innocent.\n\nOne who does these things\n\nshall never be disturbed.\n\nR. He who does justice will live in the presence of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who have kept the word with a generous heart\nand yield a harvest through perseverance.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 10:38-42",
              "content": "Jesus entered a village\nwhere a woman whose name was Martha welcomed him.\nShe had a sister named Mary\nwho sat beside the Lord at his feet listening to him speak.\nMartha, burdened with much serving, came to him and said,\n\"Lord, do you not care\nthat my sister has left me by myself to do the serving?\nTell her to help me.\"\nThe Lord said to her in reply,\n\"Martha, Martha, you are anxious and worried about many things.\nThere is need of only one thing.\nMary has chosen the better part\nand it will not be taken from her.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-21": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.878Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-21": {
          "date": "2025-07-21",
          "liturgical_date": "Monday of the Sixteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 14:5-18",
              "content": "When it was reported to the king of Egypt\nthat the people had fled,\nPharaoh and his servants changed their minds about them.\nThey exclaimed, \"What have we done!\nWhy, we have released Israel from our service!\"\nSo Pharaoh made his chariots ready and mustered his soldiers—\nsix hundred first-class chariots\nand all the other chariots of Egypt, with warriors on them all.\nSo obstinate had the LORD made Pharaoh\nthat he pursued the children of Israel\neven while they were marching away in triumph.\nThe Egyptians, then, pursued them;\nPharaoh's whole army, his horses, chariots and charioteers,\ncaught up with them as they lay encamped by the sea,\nat Pi-hahiroth, in front of Baal-zephon.\n\nPharaoh was already near when the children of Israel looked up\nand saw that the Egyptians were on the march in pursuit of them.\nIn great fright they cried out to the LORD.\nAnd they complained to Moses,\n\"Were there no burial places in Egypt\nthat you had to bring us out here to die in the desert?\nWhy did you do this to us?\nWhy did you bring us out of Egypt?\nDid we not tell you this in Egypt, when we said,\n'Leave us alone. Let us serve the Egyptians'?\nFar better for us to be the slaves of the Egyptians\nthan to die in the desert.\"\nBut Moses answered the people,\n\"Fear not! Stand your ground,\nand you will see the victory the LORD will win for you today.\nThese Egyptians whom you see today you will never see again.\nThe LORD himself will fight for you; you have only to keep still.\"\n\nThen the LORD said to Moses, \"Why are you crying out to me?\nTell the children of Israel to go forward.\nAnd you, lift up your staff and, with hand outstretched over the sea,\nsplit the sea in two,\nthat the children of Israel may pass through it on dry land.\nBut I will make the Egyptians so obstinate\nthat they will go in after them.\nThen I will receive glory through Pharaoh and all his army,\nhis chariots and charioteers.\nThe Egyptians shall know that I am the LORD,\nwhen I receive glory through Pharaoh\nand his chariots and charioteers.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Exodus 15:1bc-2, 3-4, 5-6",
              "response": "R. (1b) Let us sing to the Lord; he has covered himself in glory.",
              "content": "I will sing to the LORD, for he is gloriously triumphant;\n\nhorse and chariot he has cast into the sea.\n\nMy strength and my courage is the LORD,\n\nand he has been my savior.\n\nHe is my God, I praise him;\n\nthe God of my father, I extol him.\n\nR. Let us sing to the Lord; he has covered himself in glory.\n\nThe LORD is a warrior,\n\nLORD is his name!\n\nPharaoh's chariots and army he hurled into the sea;\n\nthe elite of his officers were submerged in the Red Sea.\n\nR. Let us sing to the Lord; he has covered himself in glory.\n\nThe flood waters covered them,\n\nthey sank into the depths like a stone.\n\nYour right hand, O LORD, magnificent in power,\n\nyour right hand, O LORD, has shattered the enemy.\n\nR. Let us sing to the Lord; he has covered himself in glory."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf today you hear his voice,\nharden not your hearts.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 12:38-42",
              "content": "Some of the scribes and Pharisees said to Jesus,\n\"Teacher, we wish to see a sign from you.\"\nHe said to them in reply,\n\"An evil and unfaithful generation seeks a sign,\nbut no sign will be given it\nexcept the sign of Jonah the prophet.\nJust as Jonah was in the belly of the whale three days and three nights,\nso will the Son of Man be in the heart of the earth\nthree days and three nights.\nAt the judgment, the men of Nineveh will arise with this generation\nand condemn it, because they repented at the preaching of Jonah;\nand there is something greater than Jonah here.\nAt the judgment the queen of the south will arise with this generation\nand condemn it, because she came from the ends of the earth\nto hear the wisdom of Solomon;\nand there is something greater than Solomon here.\""
            }
          },
          "saint_of_day": {
            "name": "Lawrence Brindisi",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-22": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.879Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-22": {
          "date": "2025-07-22",
          "liturgical_date": "Feast of Saint Mary Magdalene",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Song of Songs 3:1-4b",
              "content": "The Bride says:\nOn my bed at night I sought him\nwhom my heart loves–\nI sought him but I did not find him.\nI will rise then and go about the city;\nin the streets and crossings I will seek\nHim whom my heart loves.\nI sought him but I did not find him.\nThe watchmen came upon me,\nas they made their rounds of the city:\nHave you seen him whom my heart loves?\nI had hardly left them\nwhen I found him whom my heart loves."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 63:2, 3-4, 5-6, 8-9",
              "response": "R. (2) My soul is thirsting for you, O Lord my God.",
              "content": "O God, you are my God whom I seek;\n\nfor you my flesh pines and my soul thirsts\n\nlike the earth, parched, lifeless and without water.\n\nR. My soul is thirsting for you, O Lord my God.\n\nThus have I gazed toward you in the sanctuary\n\nto see your power and your glory,\n\nFor your kindness is a greater good than life;\n\nmy lips shall glorify you.\n\nR. My soul is thirsting for you, O Lord my God.\n\nThus will I bless you while I live;\n\nlifting up my hands, I will call upon your name.\n\nAs with the riches of a banquet shall my soul be satisfied,\n\nand with exultant lips my mouth shall praise you.\n\nR. My soul is thirsting for you, O Lord my God.\n\nYou are my help,\n\nand in the shadow of your wings I shout for joy.\n\nMy soul clings fast to you;\n\nyour right hand upholds me.\n\nR. My soul is thirsting for you, O Lord my God."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nTell us, Mary, what did you see on the way?\nI saw the glory of the risen Christ, I saw his empty tomb.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 20:1-2, 11-18",
              "content": "On the first day of the week,\nMary Magdalene came to the tomb early in the morning,\nwhile it was still dark,\nand saw the stone removed from the tomb.\nSo she ran and went to Simon Peter\nand to the other disciple whom Jesus loved, and told them,\n\"They have taken the Lord from the tomb,\nand we don't know where they put him.\"\n\nMary stayed outside the tomb weeping.\nAnd as she wept, she bent over into the tomb\nand saw two angels in white sitting there,\none at the head and one at the feet\nwhere the Body of Jesus had been.\nAnd they said to her, \"Woman, why are you weeping?\"\nShe said to them, \"They have taken my Lord,\nand I don't know where they laid him.\"\nWhen she had said this, she turned around and saw Jesus there,\nbut did not know it was Jesus.\nJesus said to her, \"Woman, why are you weeping?\nWhom are you looking for?\"\nShe thought it was the gardener and said to him,\n\"Sir, if you carried him away,\ntell me where you laid him,\nand I will take him.\"\nJesus said to her, \"Mary!\"\nShe turned and said to him in Hebrew,\n\"Rabbouni,\" which means Teacher.\nJesus said to her,\n\"Stop holding on to me, for I have not yet ascended to the Father.\nBut go to my brothers and tell them,\n'I am going to my Father and your Father,\nto my God and your God.'\"\nMary Magdalene went and announced to the disciples,\n\"I have seen the Lord,\"\nand then reported what he told her."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-23": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.883Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-23": {
          "date": "2025-07-23",
          "liturgical_date": "Wednesday of the Sixteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 78:18-19, 23-24, 25-26, 27-28",
              "response": "R.    (24b)  The Lord gave them bread from heaven.",
              "content": "They tempted God in their hearts\n\nby demanding the food they craved.\n\nYes, they spoke against God, saying,\n\n“Can God spread a table in the desert?”\n\nR.    The Lord gave them bread from heaven.\n\nYet he commanded the skies above\n\nand the doors of heaven he opened;\n\nHe rained manna upon them for food\n\nand gave them heavenly bread.\n\nR.    The Lord gave them bread from heaven.\n\nMan ate the bread of angels,\n\nfood he sent them in abundance.\n\nHe stirred up the east wind in the heavens,\n\nand by his power brought on the south wind.\n\nR.    The Lord gave them bread from heaven.\n\nAnd he rained meat upon them like dust,\n\nand, like the sand of the sea, winged fowl,\n\nWhich fell in the midst of their camp\n\nround about their tents.\n\nR.    The Lord gave them bread from heaven."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe seed is the word of God, Christ is the sower;\nall who come to him will live for ever.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:1-9",
              "content": "On that day, Jesus went out of the house and sat down by the sea.\nSuch large crowds gathered around him\nthat he got into a boat and sat down,\nand the whole crowd stood along the shore.\nAnd he spoke to them at length in parables, saying:\n“A sower went out to sow.\nAnd as he sowed, some seed fell on the path,\nand birds came and ate it up.\n\nSome fell on rocky ground, where it had little soil.\nIt sprang up at once because the soil was not deep,\nand when the sun rose it was scorched,\nand it withered for lack of roots.\nSome seed fell among thorns, and the thorns grew up and choked it.\nBut some seed fell on rich soil, and produced fruit,\na hundred or sixty or thirtyfold.\nWhoever has ears ought to hear.”"
            }
          },
          "saint_of_day": {
            "name": "Bridget",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-24": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.879Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-24": {
          "date": "2025-07-24",
          "liturgical_date": "Thursday of the Sixteenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 19:1-2, 9-11, 16-20b",
              "content": "In the third month after their departure from the land of Egypt,\non its first day, the children of Israel came to the desert of Sinai.\nAfter the journey from Rephidim to the desert of Sinai,\nthey pitched camp.\n\nWhile Israel was encamped here in front of the mountain,\nthe LORD told Moses,\n\"I am coming to you in a dense cloud,\nso that when the people hear me speaking with you,\nthey may always have faith in you also.\"\nWhen Moses, then, had reported to the LORD the response of the people,\nthe LORD added, \"Go to the people\nand have them sanctify themselves today and tomorrow.\nMake them wash their garments and be ready for the third day;\nfor on the third day the LORD will come down on Mount Sinai\nbefore the eyes of all the people.\"\n\nOn the morning of the third day\nthere were peals of thunder and lightning,\nand a heavy cloud over the mountain,\nand a very loud trumpet blast,\nso that all the people in the camp trembled.\nBut Moses led the people out of the camp to meet God,\nand they stationed themselves at the foot of the mountain.\nMount Sinai was all wrapped in smoke,\nfor the LORD came down upon it in fire.\nThe smoke rose from it as though from a furnace,\nand the whole mountain trembled violently.\nThe trumpet blast grew louder and louder, while Moses was speaking\nand God answering him with thunder.\n\nWhen the LORD came down to the top of Mount Sinai,\nhe summoned Moses to the top of the mountain."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Daniel 3:52, 53, 54, 55, 56",
              "response": "R. (52b) Glory and praise for ever!",
              "content": "\"Blessed are you, O Lord, the God of our fathers,\n\npraiseworthy and exalted above all forever;\n\nAnd blessed is your holy and glorious name,\n\npraiseworthy and exalted above all for all ages.\"\n\nR. Glory and praise for ever!\n\n\"Blessed are you in the temple of your holy glory,\n\npraiseworthy and glorious above all forever.\"\n\nR. Glory and praise for ever!\n\n\"Blessed are you on the throne of your Kingdom,\n\npraiseworthy and exalted above all forever.\"\n\nR. Glory and praise for ever!\n\n\"Blessed are you who look into the depths\n\nfrom your throne upon the cherubim,\n\npraiseworthy and exalted above all forever.\"\n\nR. Glory and praise for ever!\n\n\"Blessed are you in the firmament of heaven,\n\npraiseworthy and glorious forever.\"\n\nR. Glory and praise for ever!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, Father, Lord of heaven and earth;\nyou have revealed to little ones the mysteries of the Kingdom.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:10-17",
              "content": "The disciples approached Jesus and said,\n\"Why do you speak to the crowd in parables?\"\nHe said to them in reply,\n\"Because knowledge of the mysteries of the Kingdom of heaven\nhas been granted to you, but to them it has not been granted.\nTo anyone who has, more will be given and he will grow rich;\nfrom anyone who has not, even what he has will be taken away.\nThis is why I speak to them in parables, because\nthey look but do not see and hear but do not listen or understand.\nIsaiah's prophecy is fulfilled in them, which says:\n\nYou shall indeed hear but not understand,\nyou shall indeed look but never see.\nGross is the heart of this people,\nthey will hardly hear with their ears,\nthey have closed their eyes,\nlest they see with their eyes\nand hear with their ears\nand understand with their hearts and be converted\nand I heal them.\n\n\"But blessed are your eyes, because they see,\nand your ears, because they hear.\nAmen, I say to you, many prophets and righteous people\nlonged to see what you see but did not see it,\nand to hear what you hear but did not hear it.\""
            }
          },
          "saint_of_day": {
            "name": "Sharbel Makhluf",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-25": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.879Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-25": {
          "date": "2025-07-25",
          "liturgical_date": "Feast of Saint James, Apostle",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 2 Corinthians 4:7-15",
              "content": "Brothers and sisters:\nWe hold this treasure in earthen vessels,\nthat the surpassing power may be of God and not from us.\nWe are afflicted in every way, but not constrained;\nperplexed, but not driven to despair;\npersecuted, but not abandoned;\nstruck down, but not destroyed;\nalways carrying about in the body the dying of Jesus,\nso that the life of Jesus may also be manifested in our body.\nFor we who live are constantly being given up to death\nfor the sake of Jesus,\nso that the life of Jesus may be manifested in our mortal flesh.\n\nSo death is at work in us, but life in you.\nSince, then, we have the same spirit of faith,\naccording to what is written, I believed, therefore I spoke,\nwe too believe and therefore speak,\nknowing that the one who raised the Lord Jesus\nwill raise us also with Jesus\nand place us with you in his presence.\nEverything indeed is for you,\nso that the grace bestowed in abundance on more and more people\nmay cause the thanksgiving to overflow for the glory of God."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 126:1bc-2ab, 2cd-3, 4-5, 6",
              "response": "R. (5) Those who sow in tears shall reap rejoicing.",
              "content": "When the LORD brought back the captives of Zion,\n\nwe were like men dreaming.\n\nThen our mouth was filled with laughter,\n\nand our tongue with rejoicing.\n\nR. Those who sow in tears shall reap rejoicing.\n\nThen they said among the nations,\n\n\"The LORD has done great things for them.\"\n\nThe LORD has done great things for us;\n\nwe are glad indeed.\n\nR. Those who sow in tears shall reap rejoicing.\n\nRestore our fortunes, O LORD,\n\nlike the torrents in the southern desert.\n\nThose that sow in tears\n\nshall reap rejoicing.\n\nR. Those who sow in tears shall reap rejoicing.\n\nAlthough they go forth weeping,\n\ncarrying the seed to be sown,\n\nThey shall come back rejoicing,\n\ncarrying their sheaves.\n\nR. Those who sow in tears shall reap rejoicing."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI chose you from the world,\nto go and bear fruit that will last, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 20:20-28",
              "content": "The mother of the sons of Zebedee approached Jesus with her sons\nand did him homage, wishing to ask him for something.\nHe said to her,\n\"What do you wish?\"\nShe answered him,\n\"Command that these two sons of mine sit,\none at your right and the other at your left, in your Kingdom.\"\nJesus said in reply,\n\"You do not know what you are asking.\nCan you drink the chalice that I am going to drink?\"\nThey said to him, \"We can.\"\nHe replied,\n\"My chalice you will indeed drink,\nbut to sit at my right and at my left, this is not mine to give\nbut is for those for whom it has been prepared by my Father.\"\nWhen the ten heard this,\nthey became indignant at the two brothers.\nBut Jesus summoned them and said,\n\"You know that the rulers of the Gentiles lord it over them,\nand the great ones make their authority over them felt.\nBut it shall not be so among you.\nRather, whoever wishes to be great among you shall be your servant;\nwhoever wishes to be first among you shall be your slave.\nJust so, the Son of Man did not come to be served\nbut to serve and to give his life as a ransom for many.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-26": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.871Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-26": {
          "date": "2025-07-26",
          "liturgical_date": "Memorial of Saints Joachim and Anne, Parents of the Blessed Virgin Mary",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 50:1b-2, 5-6, 14-15",
              "response": "R.     (14a)  Offer to God a sacrifice of praise.",
              "content": "God the LORD has spoken and summoned the earth,\n\nfrom the rising of the sun to its setting.\n\nFrom Zion, perfect in beauty,\n\nGod shines forth.\n\nR.    Offer to God a sacrifice of praise.\n\n“Gather my faithful ones before me,\n\nthose who have made a covenant with me by sacrifice.”\n\nAnd the heavens proclaim his justice;\n\nfor God himself is the judge.\n\nR.    Offer to God a sacrifice of praise.\n\n“Offer to God praise as your sacrifice\n\nand fulfill your vows to the Most High;\n\nThen call upon me in time of distress;\n\nI will rescue you, and you shall glorify me.”\n\nR.    Offer to God a sacrifice of praise."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nHumbly welcome the word that has been planted in you\nand is able to save your souls.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:24-30",
              "content": "Jesus proposed a parable to the crowds.\n“The Kingdom of heaven may be likened to a man\nwho sowed good seed in his field.\nWhile everyone was asleep his enemy came\nand sowed weeds all through the wheat, and then went off.\nWhen the crop grew and bore fruit, the weeds appeared as well.\nThe slaves of the householder came to him and said,\n‘Master, did you not sow good seed in your field?\nWhere have the weeds come from?’\nHe answered, ‘An enemy has done this.’\nHis slaves said to him, ‘Do you want us to go and pull them up?’\nHe replied, ‘No, if you pull up the weeds\nyou might uproot the wheat along with them.\nLet them grow together until harvest;\nthen at harvest time I will say to the harvesters,\n“First collect the weeds and tie them in bundles for burning;\nbut gather the wheat into my barn.”’”"
            }
          },
          "saint_of_day": {
            "name": "Joachim Anne",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-27": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.782Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-27": {
          "date": "2025-07-27",
          "liturgical_date": "Seventeenth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 18:20-32",
              "content": "In those days, the LORD said: \"The outcry against Sodom and Gomorrah is so great,\nand their sin so grave,\nthat I must go down and see whether or not their actions\nfully correspond to the cry against them that comes to me.\nI mean to find out.\"\n\nWhile Abraham's visitors walked on farther toward Sodom,\nthe LORD remained standing before Abraham.\nThen Abraham drew nearer and said:\n\"Will you sweep away the innocent with the guilty?\nSuppose there were fifty innocent people in the city;\nwould you wipe out the place, rather than spare it\nfor the sake of the fifty innocent people within it?\nFar be it from you to do such a thing,\nto make the innocent die with the guilty\nso that the innocent and the guilty would be treated alike!\nShould not the judge of all the world act with justice?\"\nThe LORD replied,\n\"If I find fifty innocent people in the city of Sodom,\nI will spare the whole place for their sake.\"\nAbraham spoke up again:\n\"See how I am presuming to speak to my Lord,\nthough I am but dust and ashes!\nWhat if there are five less than fifty innocent people?\nWill you destroy the whole city because of those five?\"\nHe answered, \"I will not destroy it, if I find forty-five there.\"\nBut Abraham persisted, saying \"What if only forty are found there?\"\nHe replied, \"I will forbear doing it for the sake of the forty.\"\nThen Abraham said, \"Let not my Lord grow impatient if I go on.\nWhat if only thirty are found there?\"\nHe replied, \"I will forbear doing it if I can find but thirty there.\"\nStill Abraham went on,\n\"Since I have thus dared to speak to my Lord,\nwhat if there are no more than twenty?\"\nThe LORD answered, \"I will not destroy it, for the sake of the twenty.\"\nBut he still persisted:\n\"Please, let not my Lord grow angry if I speak up this last time.\nWhat if there are at least ten there?\"\nHe replied, \"For the sake of those ten, I will not destroy it.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 138:1-2, 2-3, 6-7, 7-8",
              "response": "R.(3a) Lord, on the day I called for help, you answered me.",
              "content": "I will give thanks to you, O LORD, with all my heart,\n\nfor you have heard the words of my mouth;\n\nin the presence of the angels I will sing your praise;\n\nI will worship at your holy temple\n\nand give thanks to your name.\n\nR. Lord, on the day I called for help, you answered me.\n\nBecause of your kindness and your truth;\n\nfor you have made great above all things\n\nyour name and your promise.\n\nWhen I called you answered me;\n\nyou built up strength within me.\n\nR. Lord, on the day I called for help, you answered me.\n\nThe LORD is exalted, yet the lowly he sees,\n\nand the proud he knows from afar.\n\nThough I walk amid distress, you preserve me;\n\nagainst the anger of my enemies you raise your hand.\n\nR. Lord, on the day I called for help, you answered me.\n\nYour right hand saves me.\n\nThe LORD will complete what he has done for me;\n\nyour kindness, O LORD, endures forever;\n\nforsake not the work of your hands.\n\nR. Lord, on the day I called for help, you answered me."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYou have received a Spirit of adoption,\nthrough which we cry, Abba, Father.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 11:1-13",
              "content": "Jesus was praying in a certain place, and when he had finished,\none of his disciples said to him,\n\"Lord, teach us to pray just as John taught his disciples.\"\nHe said to them, \"When you pray, say:\nFather, hallowed be your name,\nyour kingdom come.\nGive us each day our daily bread\nand forgive us our sins\nfor we ourselves forgive everyone in debt to us,\nand do not subject us to the final test.\"\n\nAnd he said to them, \"Suppose one of you has a friend\nto whom he goes at midnight and says,\n'Friend, lend me three loaves of bread,\nfor a friend of mine has arrived at my house from a journey\nand I have nothing to offer him,'\nand he says in reply from within,\n'Do not bother me; the door has already been locked\nand my children and I are already in bed.\nI cannot get up to give you anything.'\nI tell you,\nif he does not get up to give the visitor the loaves\nbecause of their friendship,\nhe will get up to give him whatever he needs\nbecause of his persistence.\n\n\"And I tell you, ask and you will receive;\nseek and you will find;\nknock and the door will be opened to you.\nFor everyone who asks, receives;\nand the one who seeks, finds;\nand to the one who knocks, the door will be opened.\nWhat father among you would hand his son a snake\nwhen he asks for a fish?\nOr hand him a scorpion when he asks for an egg?\nIf you then, who are wicked,\nknow how to give good gifts to your children,\nhow much more will the Father in heaven\ngive the Holy Spirit to those who ask him?\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-28": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.885Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-28": {
          "date": "2025-07-28",
          "liturgical_date": "Monday of the Seventeenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 32:15-24, 30-34",
              "content": "Moses turned and came down the mountain\nwith the two tablets of the commandments in his hands,\ntablets that were written on both sides, front and back;\ntablets that were made by God,\nhaving inscriptions on them that were engraved by God himself.\nNow, when Joshua heard the noise of the people shouting,\nhe said to Moses, “That sounds like a battle in the camp.”\nBut Moses answered, “It does not sound like cries of victory,\nnor does it sound like cries of defeat;\nthe sounds that I hear are cries of revelry.”\nAs he drew near the camp, he saw the calf and the dancing.\nWith that, Moses’ wrath flared up, so that he threw the tablets down\nand broke them on the base of the mountain.\nTaking the calf they had made, he fused it in the fire\nand then ground it down to powder,\nwhich he scattered on the water and made the children of Israel drink.\n\nMoses asked Aaron, “What did this people ever do to you\nthat you should lead them into so grave a sin?”\nAaron replied, “Let not my lord be angry.\nYou know well enough how prone the people are to evil.\nThey said to me, ‘Make us a god to be our leader;\nas for the man Moses who brought us out of the land of Egypt,\nwe do not know what has happened to him.’\nSo I told them, ‘Let anyone who has gold jewelry take it off.’\nThey gave it to me, and I threw it into the fire, and this calf came out.”\n\nOn the next day Moses said to the people,\n“You have committed a grave sin.\nI will go up to the LORD, then;\nperhaps I may be able to make atonement for your sin.”\nSo Moses went back to the LORD and said,\n“Ah, this people has indeed committed a grave sin\nin making a god of gold for themselves!\nIf you would only forgive their sin!\nIf you will not, then strike me out of the book that you have written.”\nThe LORD answered, “Him only who has sinned against me\nwill I strike out of my book.\nNow, go and lead the people to the place I have told you.\nMy angel will go before you.\nWhen it is time for me to punish, I will punish them for their sin.”"
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 106:19-20, 21-22, 23",
              "response": "R. (1a) Give thanks to the Lord, for he is good.",
              "content": "Our fathers made a calf in Horeb\n\nand adored a molten image;\n\nThey exchanged their glory\n\nfor the image of a grass-eating bullock.\n\nR. Give thanks to the Lord, for he is good.\n\nThey forgot the God who had saved them,\n\nwho had done great deeds in Egypt,\n\nWondrous deeds in the land of Ham,\n\nterrible things at the Red Sea.\n\nR. Give thanks to the Lord, for he is good.\n\nThen he spoke of exterminating them,\n\nbut Moses, his chosen one,\n\nWithstood him in the breach\n\nto turn back his destructive wrath.\n\nR. Give thanks to the Lord, for he is good."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Father willed to give us birth by the word of truth\nthat we may be a kind of firstfruits of his creatures.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:31-35",
              "content": "Jesus proposed a parable to the crowds.\n“The Kingdom of heaven is like a mustard seed\nthat a person took and sowed in a field.\nIt is the smallest of all the seeds,\nyet when full-grown it is the largest of plants.\nIt becomes a large bush,\nand the birds of the sky come and dwell in its branches.”\n\nHe spoke to them another parable.\n“The Kingdom of heaven is like yeast\nthat a woman took and mixed with three measures of wheat flour\nuntil the whole batch was leavened.”\n\nAll these things Jesus spoke to the crowds in parables.\nHe spoke to them only in parables,\nto fulfill what had been said through the prophet:\n\nI will open my mouth in parables,\nI will announce what has lain hidden from the foundation of the world."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-29": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:25:43.883Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-29": {
          "date": "2025-07-29",
          "liturgical_date": "Memorial of Saints Martha, Mary, and Lazarus",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 103:6-7, 8-9, 10-11, 12-13",
              "response": "R.     (8a)  The Lord is kind and merciful.",
              "content": "The LORD secures justice\n\nand the rights of all the oppressed.\n\nHe has made known his ways to Moses,\n\nand his deeds to the children of Israel.\n\nR.     The Lord is kind and merciful.\n\nMerciful and gracious is the LORD,\n\nslow to anger and abounding in kindness.\n\nHe will not always chide,\n\nnor does he keep his wrath forever.\n\nR.     The Lord is kind and merciful.\n\nNot according to our sins does he deal with us,\n\nnor does he requite us according to our crimes.\n\nFor as the heavens are high above the earth,\n\nso surpassing is his kindness toward those who fear him.\n\nR.     The Lord is kind and merciful.\n\nAs far as the east is from the west,\n\nso far has he put our transgressions from us.\n\nAs a father has compassion on his children,\n\nso the LORD has compassion on those who fear him.\n\nR.     The Lord is kind and merciful."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the light of the world, says the Lord;\nwhoever follows me will have the light of life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 11:19-27",
              "content": "Many of the Jews had come to Martha and Mary\nto comfort them about their brother [Lazarus, who had died].\nWhen Martha heard that Jesus was coming,\nshe went to meet him;\nbut Mary sat at home.\nMartha said to Jesus,\n“Lord, if you had been here,\nmy brother would not have died.\nBut even now I know that whatever you ask of God,\nGod will give you.”\nJesus said to her,\n“Your brother will rise.”\nMartha said to him,\n“I know he will rise,\nin the resurrection on the last day.”\nJesus told her,\n“I am the resurrection and the life;\nwhoever believes in me, even if he dies, will live,\nand anyone who lives and believes in me will never die.\nDo you believe this?”\nShe said to him, “Yes, Lord.\nI have come to believe that you are the Christ, the Son of God,\nthe one who is coming into the world.”"
            }
          },
          "saint_of_day": {
            "name": "Martha",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-30": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.931Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-30": {
          "date": "2025-07-30",
          "liturgical_date": "Wednesday of the Seventeenth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 34:29-35",
              "content": "As Moses came down from Mount Sinai\nwith the two tablets of the commandments in his hands,\nhe did not know that the skin of his face had become radiant\nwhile he conversed with the LORD.\nWhen Aaron, then, and the other children of Israel saw Moses\nand noticed how radiant the skin of his face had become,\nthey were afraid to come near him.\nOnly after Moses called to them did Aaron\nand all the rulers of the community come back to him.\nMoses then spoke to them.\nLater on, all the children of Israel came up to him,\nand he enjoined on them all that the LORD\nhad told him on Mount Sinai.\nWhen he finished speaking with them,\nhe put a veil over his face.\nWhenever Moses entered the presence of the LORD to converse with him,\nhe removed the veil until he came out again.\nOn coming out, he would tell the children of Israel\nall that had been commanded.\nThen the children of Israel would see\nthat the skin of Moses' face was radiant;\nso he would again put the veil over his face\nuntil he went in to converse with the LORD."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 99:5, 6, 7, 9",
              "response": "R. (see 9c) Holy is the Lord our God.",
              "content": "Extol the LORD, our God,\n\nand worship at his footstool;\n\nholy is he!\n\nR. Holy is the Lord our God.\n\nMoses and Aaron were among his priests,\n\nand Samuel, among those who called upon his name;\n\nthey called upon the LORD, and he answered them.\n\nR. Holy is the Lord our God.\n\nFrom the pillar of cloud he spoke to them;\n\nthey heard his decrees and the law he gave them.\n\nR. Holy is the Lord our God.\n\nExtol the LORD, our God,\n\nand worship at his holy mountain;\n\nfor holy is the LORD, our God.\n\nR. Holy is the Lord our God."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI call you my friends, says the Lord,\nfor I have made known to you all that the Father has told me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:44-46",
              "content": "Jesus said to his disciples:\n\"The Kingdom of heaven is like a treasure buried in a field,\nwhich a person finds and hides again,\nand out of joy goes and sells all that he has and buys that field.\nAgain, the Kingdom of heaven is like a merchant\nsearching for fine pearls.\nWhen he finds a pearl of great price,\nhe goes and sells all that he has and buys it.\""
            }
          },
          "saint_of_day": {
            "name": "Peter Chrysologus",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-07-31": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:26:46.966Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-07-31": {
          "date": "2025-07-31",
          "liturgical_date": "Memorial of Saint Ignatius of Loyola, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Exodus 40:16-21, 34-38",
              "content": "Moses did exactly as the LORD had commanded him.\nOn the first day of the first month of the second year\nthe Dwelling was erected.\nIt was Moses who erected the Dwelling.\nHe placed its pedestals, set up its boards, put in its bars,\nand set up its columns.\nHe spread the tent over the Dwelling\nand put the covering on top of the tent,\nas the LORD had commanded him.\nHe took the commandments and put them in the ark;\nhe placed poles alongside the ark and set the propitiatory upon it.\nHe brought the ark into the Dwelling and hung the curtain veil,\nthus screening off the ark of the commandments,\nas the LORD had commanded him.\n\nThen the cloud covered the meeting tent,\nand the glory of the LORD filled the Dwelling.\nMoses could not enter the meeting tent,\nbecause the cloud settled down upon it\nand the glory of the LORD filled the Dwelling.\nWhenever the cloud rose from the Dwelling,\nthe children of Israel would set out on their journey.\nBut if the cloud did not lift, they would not go forward;\nonly when it lifted did they go forward.\nIn the daytime the cloud of the LORD was seen over the Dwelling;\nwhereas at night, fire was seen in the cloud\nby the whole house of Israel\nin all the stages of their journey."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 84:3, 4, 5-6a and 8a, 11",
              "response": "R. (2) How lovely is your dwelling place, O Lord, mighty God!",
              "content": "My soul yearns and pines\n\nfor the courts of the LORD.\n\nMy heart and my flesh\n\ncry out for the living God.\n\nR. How lovely is your dwelling place, O Lord, mighty God!\n\nEven the sparrow finds a home,\n\nand the swallow a nest\n\nin which she puts her young–\n\nYour altars, O LORD of hosts,\n\nmy king and my God!\n\nR. How lovely is your dwelling place, O Lord, mighty God!\n\nBlessed they who dwell in your house!\n\ncontinually they praise you.\n\nBlessed the men whose strength you are!\n\nThey go from strength to strength.\n\nR. How lovely is your dwelling place, O Lord, mighty God!\n\nI had rather one day in your courts\n\nthan a thousand elsewhere;\n\nI had rather lie at the threshold of the house of my God\n\nthan dwell in the tents of the wicked.\n\nR. How lovely is your dwelling place, O Lord, mighty God!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOpen our hearts, O Lord,\nto listen to the words of your Son.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 13:47-53",
              "content": "Jesus said to the disciples:\n\"The Kingdom of heaven is like a net thrown into the sea,\nwhich collects fish of every kind.\nWhen it is full they haul it ashore\nand sit down to put what is good into buckets.\nWhat is bad they throw away.\nThus it will be at the end of the age.\nThe angels will go out and separate the wicked from the righteous\nand throw them into the fiery furnace,\nwhere there will be wailing and grinding of teeth.\"\n\n\"Do you understand all these things?\"\nThey answered, \"Yes.\"\nAnd he replied,\n\"Then every scribe who has been instructed in the Kingdom of heaven\nis like the head of a household who brings from his storeroom\nboth the new and the old.\"\nWhen Jesus finished these parables, he went away from there."
            }
          },
          "saint_of_day": {
            "name": "Ignatius Loyola",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    }
  }
}