{
  "meta": {
    "version": "1.0",
    "month": 2,
    "month_name": "february",
    "year": 2025,
    "total_days": 28
  },
  "daily_readings": {
    "2025-02-01": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.192Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-01": {
          "date": "2025-02-01",
          "liturgical_date": "Saturday of the Third Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Luke 1:69-70, 71-72, 73-75",
              "response": "R. (see 68) Blessed be the Lord the God of Israel; he has come to his people.",
              "content": "He has raised up for us a mighty savior,\n\nborn of the house of his servant David.\n\nR. Blessed be the Lord the God of Israel; he has come to his people.\n\nThrough his holy prophets he promised of old.\n\nthat he would save us from our sins\n\nfrom the hands of all who hate us.\n\nHe promised to show mercy to our fathers\n\nand to remember his holy covenant.\n\nR. Blessed be the Lord the God of Israel; he has come to his people.\n\nThis was the oath he swore to our father Abraham:\n\nto set us free from the bonds of our enemies,\n\nfree to worship him without fear,\n\nholy and righteous in his sight\n\nall the days of our life.\n\nR. Blessed be the Lord the God of Israel; he has come to his people."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nGod so loved the world that he gave his only-begotten Son,\nso that everyone who believes in him might have eternal life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 4:35-41",
              "content": "On that day, as evening drew on, Jesus said to his disciples:\n“Let us cross to the other side.”\nLeaving the crowd, they took Jesus with them in the boat just as he was.\nAnd other boats were with him.\nA violent squall came up and waves were breaking over the boat,\nso that it was already filling up.\nJesus was in the stern, asleep on a cushion.\nThey woke him and said to him,\n“Teacher, do you not care that we are perishing?”\nHe woke up,\nrebuked the wind, and said to the sea, “Quiet! Be still!”\nThe wind ceased and there was great calm.\nThen he asked them, “Why are you terrified?\nDo you not yet have faith?”\nThey were filled with great awe and said to one another,\n“Who then is this whom even wind and sea obey?”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-02": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.823Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-02": {
          "date": "2025-02-02",
          "liturgical_date": "Feast of the Presentation of the Lord",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 24:7, 8, 9, 10",
              "response": "R.    (8) Who is this king of glory?  It is the Lord!",
              "content": "Lift up, O gates, your lintels;\n\nreach up, you ancient portals,\n\nthat the king of glory may come in!\n\nR.    Who is this king of glory?  It is the Lord!\n\nWho is this king of glory?\n\nThe LORD, strong and mighty,\n\nthe LORD, mighty in battle.\n\nR.    Who is this king of glory?  It is the Lord!\n\nLift up, O gates, your lintels;\n\nreach up, you ancient portals,\n\nthat the king of glory may come in!\n\nR.    Who is this king of glory?  It is the Lord!\n\nWho is this king of glory?\n\nThe LORD of hosts; he is the king of glory.\n\nR.    Who is this king of glory?  It is the Lord!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nA light of revelation to the Gentiles,\nand glory for your people Israel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 2:22-40 or 2:22-32",
              "content": "When the days were completed for their purification\naccording to the law of Moses,\nMary and Joseph took Jesus up to Jerusalem\nto present him to the Lord,\njust as it is written in the law of the Lord,\nEvery male that opens the womb shall be consecrated to the Lord,\nand to offer the sacrifice of\na pair of turtledoves or two young pigeons,\nin accordance with the dictate in the law of the Lord.\n\nNow there was a man in Jerusalem whose name was Simeon.\nThis man was righteous and devout,\nawaiting the consolation of Israel,\nand the Holy Spirit was upon him.\nIt had been revealed to him by the Holy Spirit\nthat he should not see death\nbefore he had seen the Christ of the Lord. \nHe came in the Spirit into the temple;\nand when the parents brought in the child Jesus\nto perform the custom of the law in regard to him,\nhe took him into his arms and blessed God, saying:\n\n“Now, Master, you may let your servant go \n        in peace, according to your word,\n    for my eyes have seen your salvation,\n        which you prepared in the sight of all the peoples:\n    a light for revelation to the Gentiles,\n        and glory for your people Israel.”\n\nThe child’s father and mother were amazed at what was said about him;\nand Simeon blessed them and said to Mary his mother,\n“Behold, this child is destined\nfor the fall and rise of many in Israel,\nand to be a sign that will be contradicted\n-and you yourself a sword will pierce-\nso that the thoughts of many hearts may be revealed.”\nThere was also a prophetess, Anna,\nthe daughter of Phanuel, of the tribe of Asher.\nShe was advanced in years,\nhaving lived seven years with her husband after her marriage,\nand then as a widow until she was eighty-four.\nShe never left the temple,\nbut worshiped night and day with fasting and prayer.\nAnd coming forward at that very time,\nshe gave thanks to God and spoke about the child\nto all who were awaiting the redemption of Jerusalem.\n\nWhen they had fulfilled all the prescriptions\nof the law of the Lord,\nthey returned to Galilee, to their own town of Nazareth.\nThe child grew and became strong, filled with wisdom;\nand the favor of God was upon him.\n\nOR:\n\nWhen the days were completed for their purification\naccording to the law of Moses,\nMary and Joseph took Jesus up to Jerusalem\nto present him to the Lord,\njust as it is written in the law of the Lord,\nEvery male that opens the womb shall be consecrated to the Lord,\nand to offer the sacrifice of\na pair of turtledoves or two young pigeons,\nin accordance with the dictate in the law of the Lord.\n\nNow there was a man in Jerusalem whose name was Simeon.\nThis man was righteous and devout,\nawaiting the consolation of Israel,\nand the Holy Spirit was upon him.\nIt had been revealed to him by the Holy Spirit\nthat he should not see death\nbefore he had seen the Christ of the Lord. \nHe came in the Spirit into the temple;\nand when the parents brought in the child Jesus\nto perform the custom of the law in regard to him,\nhe took him into his arms and blessed God, saying:\n\n“Now, Master, you may let your servant go \n        in peace, according to your word,\n    for my eyes have seen your salvation,\n        which you prepared in the sight of all the peoples:\n    a light for revelation to the Gentiles,\n        and glory for your people Israel.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-03": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.132Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-03": {
          "date": "2025-02-03",
          "liturgical_date": "Monday of the Fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 11:32-40",
              "content": "Brothers and sisters:\nWhat more shall I say?\nI have not time to tell of Gideon, Barak, Samson, Jephthah,\nof David and Samuel and the prophets,\nwho by faith conquered kingdoms, \ndid what was righteous, obtained the promises;\nthey closed the mouths of lions, put out raging fires,\nescaped the devouring sword;\nout of weakness they were made powerful, became strong in battle,\nand turned back foreign invaders.\nWomen received back their dead through resurrection.\nSome were tortured and would not accept deliverance,\nin order to obtain a better resurrection.\nOthers endured mockery, scourging, even chains and imprisonment.\nThey were stoned, sawed in two, put to death at sword’s point;\nthey went about in skins of sheep or goats,\nneedy, afflicted, tormented.\nThe world was not worthy of them.\nThey wandered about in deserts and on mountains,\nin caves and in crevices in the earth.\n\nYet all these, though approved because of their faith,\ndid not receive what had been promised.\nGod had foreseen something better for us,\nso that without us they should not be made perfect."
            },
            "responsorial_psalm": {
              "citation": "",
              "response": "",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nA great prophet has arisen in our midst\nand God has visited his people.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 5:1-20",
              "content": "Jesus and his disciples came to the other side of the sea,\nto the territory of the Gerasenes.\nWhen he got out of the boat,\nat once a man from the tombs who had an unclean spirit met him.\nThe man had been dwelling among the tombs,\nand no one could restrain him any longer, even with a chain.\nIn fact, he had frequently been bound with shackles and chains,\nbut the chains had been pulled apart by him and the shackles smashed,\nand no one was strong enough to subdue him.\nNight and day among the tombs and on the hillsides\nhe was always crying out and bruising himself with stones.\nCatching sight of Jesus from a distance,\nhe ran up and prostrated himself before him,\ncrying out in a loud voice,\n“What have you to do with me, Jesus, Son of the Most High God?\nI adjure you by God, do not torment me!”\n(He had been saying to him, “Unclean spirit, come out of the man!”)\nHe asked him, “What is your name?”\nHe  replied, “Legion is my name.  There are many of us.”\nAnd he pleaded earnestly with him\nnot to drive them away from that territory.\n\nNow a large herd of swine was feeding there on the hillside.\nAnd they pleaded with him,\n“Send us into the swine.  Let us enter them.”\nAnd he let them, and the unclean spirits came out and entered the swine.\nThe herd of about two thousand rushed down a steep bank into the sea,\nwhere they were drowned.\nThe swineherds ran away and reported the incident in the town\nand throughout the countryside.\nAnd people came out to see what had happened.\nAs they approached Jesus,\nthey caught sight of the man who had been possessed by Legion,\nsitting there clothed and in his right mind.\nAnd they were seized with fear.\nThose who witnessed the incident explained to them what had happened\nto the possessed man and to the swine.\nThen they began to beg him to leave their district.\nAs he was getting into the boat,\nthe man who had been possessed pleaded to remain with him.\nBut Jesus would not permit him but told him instead,\n“Go home to your family and announce to them\nall that the Lord in his pity has done for you.”\nThen the man went off and began to proclaim in the Decapolis\nwhat Jesus had done for him; and all were amazed."
            }
          },
          "saint_of_day": {
            "name": "Ansgar",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-04": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.192Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-04": {
          "date": "2025-02-04",
          "liturgical_date": "Tuesday of the Fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 12:1-4",
              "content": "Brothers and sisters:\nSince we are surrounded by so great a cloud of witnesses,\nlet us rid ourselves of every burden and sin that clings to us\nand persevere in running the race that lies before us\nwhile keeping our eyes fixed on Jesus,\nthe leader and perfecter of faith.\nFor the sake of the joy that lay before him\nJesus endured the cross, despising its shame,\nand has taken his seat at the right of the throne of God.\nConsider how he endured such opposition from sinners,\nin order that you may not grow weary and lose heart.\nIn your struggle against sin\nyou have not yet resisted to the point of shedding blood."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 22:26b-27, 28 and 30, 31-32",
              "response": "R. (see 27b) They will praise you, Lord, who long for you.",
              "content": "I will fulfill my vows before those who fear him.\n\nThe lowly shall eat their fill;\n\nthey who seek the LORD shall praise him:\n\n“May your hearts be ever merry!”\n\nR. They will praise you, Lord, who long for you.\n\nAll the ends of the earth\n\nshall remember and turn to the LORD;\n\nAll the families of the nations\n\nshall bow down before him.\n\nTo him alone shall bow down\n\nall who sleep in the earth;\n\nBefore him shall bend\n\nall who go down into the dust.\n\nR. They will praise you, Lord, who long for you.\n\nAnd to him my soul shall live;\n\nmy descendants shall serve him.\n\nLet the coming generation be told of the LORD\n\nthat they may proclaim to a people yet to be born\n\nthe justice he has shown.\n\nR. They will praise you, Lord, who long for you."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nChrist took away our infirmities\nand bore our diseases.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 5:21-43",
              "content": "When Jesus had crossed again in the boat to the other side,\na large crowd gathered around him, and he stayed close to the sea.\nOne of the synagogue officials, named Jairus, came forward.\nSeeing him he fell at his feet and pleaded earnestly with him, saying,\n“My daughter is at the point of death.\nPlease, come lay your hands on her\nthat she may get well and live.”\nHe went off with him\nand a large crowd followed him.\n\nThere was a woman afflicted with hemorrhages for twelve years.\nShe had suffered greatly at the hands of many doctors\nand had spent all that she had.\nYet she was not helped but only grew worse.\nShe had heard about Jesus and came up behind him in the crowd\nand touched his cloak.\nShe said, “If I but touch his clothes, I shall be cured.”\nImmediately her flow of blood dried up.\nShe felt in her body that she was healed of her affliction.\nJesus, aware at once that power had gone out from him,\nturned around in the crowd and asked, “Who has touched my clothes?”\nBut his disciples said to him,\n“You see how the crowd is pressing upon you,\nand yet you ask, Who touched me?”\nAnd he looked around to see who had done it.\nThe woman, realizing what had happened to her,\napproached in fear and trembling.\nShe fell down before Jesus and told him the whole truth.\nHe said to her, “Daughter, your faith has saved you.\nGo in peace and be cured of your affliction.”\n\nWhile he was still speaking,\npeople from the synagogue official’s house arrived and said,\n“Your daughter has died; why trouble the teacher any longer?”\nDisregarding the message that was reported,\nJesus said to the synagogue official,\n“Do not be afraid; just have faith.”\nHe did not allow anyone to accompany him inside\nexcept Peter, James, and John, the brother of James.\nWhen they arrived at the house of the synagogue official,\nhe caught sight of a commotion,\npeople weeping and wailing loudly.\nSo he went in and said to them,\n“Why this commotion and weeping?\nThe child is not dead but asleep.”\nAnd they ridiculed him.\nThen he put them all out.\nHe took along the child’s father and mother\nand those who were with him\nand entered the room where the child was.\nHe took the child by the hand and said to her, “Talitha koum,”\nwhich means, “Little girl, I say to you, arise!”\nThe girl, a child of twelve, arose immediately and walked around.\nAt that they were utterly astounded.\nHe gave strict orders that no one should know this\nand said that she should be given something to eat."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-05": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.823Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-05": {
          "date": "2025-02-05",
          "liturgical_date": "Memorial of Saint Agatha, Virgin and Martyr",
          "liturgical_color": "red",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 12:4-7, 11-15",
              "content": "Brothers and sisters:\nIn your struggle against sin\nyou have not yet resisted to the point of shedding blood.\nYou have also forgotten the exhortation addressed to you as children:\n\nMy son, do not disdain the discipline of the Lord\n        or lose heart when reproved by him;\n    for whom the Lord loves, he disciplines;\n        he scourges every son he acknowledges.\n\nEndure your trials as “discipline”;\nGod treats you as his sons.\nFor what \"son” is there whom his father does not discipline?\nAt the time, all discipline seems a cause not for joy but for pain,\nyet later it brings the peaceful fruit of righteousness\nto those who are trained by it.\n\nSo strengthen your drooping hands and your weak knees.\nMake straight paths for your feet,\nthat what is lame may not be dislocated but healed.\n\nStrive for peace with everyone,\nand for that holiness without which no one will see the Lord.\nSee to it that no one be deprived of the grace of God,\nthat no bitter root spring up and cause trouble,\nthrough which many may become defiled."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 103:1-2, 13-14, 17-18a",
              "response": "R.    (see 17)  The Lord’s kindness is everlasting to those who fear him.",
              "content": "Bless the LORD, O my soul;\n\nand all my being, bless his holy name.\n\nBless the LORD, O my soul,\n\nand forget not all his benefits.\n\nR.    The Lord’s kindness is everlasting to those who fear him.\n\nAs a father has compassion on his children,\n\nso the LORD has compassion on those who fear him,\n\nFor he knows how we are formed;\n\nhe remembers that we are dust.\n\nR.    The Lord’s kindness is everlasting to those who fear him.\n\nBut the kindness of the LORD is from eternity\n\nto eternity toward those who fear him,\n\nAnd his justice toward children’s children\n\namong those who keep his covenant.\n\nR.    The Lord’s kindness is everlasting to those who fear him."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:1-6",
              "content": "Jesus departed from there and came to his native place,\naccompanied by his disciples.\nWhen the sabbath came he began to teach in the synagogue,\nand many who heard him were astonished.\nThey said, “Where did this man get all this?\nWhat kind of wisdom has been given him?\nWhat mighty deeds are wrought by his hands!\nIs he not the carpenter, the son of Mary,\nand the brother of James and Joseph and Judas and Simon?\nAnd are not his sisters here with us?”\nAnd they took offense at him.\nJesus said to them,\n“A prophet is not without honor except in his native place\nand among his own kin and in his own house.”\nSo he was not able to perform any mighty deed there,\napart from curing a few sick people by laying his hands on them.\nHe was amazed at their lack of faith."
            }
          },
          "saint_of_day": {
            "name": "Agatha",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-06": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.771Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-06": {
          "date": "2025-02-06",
          "liturgical_date": "Memorial of Saint Paul Miki and Companions, Martyrs",
          "liturgical_color": "red",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 12:18-19, 21-24",
              "content": "Brothers and sisters:\nYou have not approached that which could be touched\nand a blazing fire and gloomy darkness\nand storm and a trumpet blast\nand a voice speaking words such that those who heard\nbegged that no message be further addressed to them.\nIndeed, so fearful was the spectacle that Moses said,\n“I am terrified and trembling.”\nNo, you have approached Mount Zion\nand the city of the living God, the heavenly Jerusalem,\nand countless angels in festal gathering,\nand the assembly of the firstborn enrolled in heaven,\nand God the judge of all,\nand the spirits of the just made perfect,\nand Jesus, the mediator of a new covenant,\nand the sprinkled Blood that speaks more eloquently\nthan that of Abel."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 48:2-3ab, 3cd-4, 9, 10-11",
              "response": "R.    (see 10)  O God, we ponder your mercy within your temple.",
              "content": "Great is the LORD and wholly to be praised\n\nin the city of our God.\n\nHis holy mountain, fairest of heights,\n\nis the joy of all the earth.\n\nR.    O God, we ponder your mercy within your temple.\n\nMount Zion, “the recesses of the North,”\n\nthe city of the great King.\n\nGod is with her castles;\n\nrenowned is he as a stronghold.\n\nR.    O God, we ponder your mercy within your temple.\n\nAs we had heard, so have we seen\n\nin the city of the LORD of hosts,\n\nIn the city of our God;\n\nGod makes it firm forever.\n\nR.    O God, we ponder your mercy within your temple.\n\nO God, we ponder your mercy\n\nwithin your temple.\n\nAs your name, O God, so also your praise\n\nreaches to the ends of the earth.\n\nOf justice your right hand is full.\n\nR.    O God, we ponder your mercy within your temple."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Kingdom of God is at hand;\nrepent and believe in the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:7-13",
              "content": "Jesus summoned the Twelve and began to send them out two by two\nand gave them authority over unclean spirits.\nHe instructed them to take nothing for the journey but a walking stick\n–no food, no sack, no money in their belts.\nThey were, however, to wear sandals but not a second tunic.\nHe said to them,\n“Wherever you enter a house, stay there until you leave from there.\nWhatever place does not welcome you or listen to you,\nleave there and shake the dust off your feet\nin testimony against them.”\nSo they went off and preached repentance.\nThe Twelve drove out many demons,\nand they anointed with oil many who were sick and cured them."
            }
          },
          "saint_of_day": {
            "name": "Paul Miki",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-07": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.489Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-07": {
          "date": "2025-02-07",
          "liturgical_date": "Friday of the Fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 13:1-8",
              "content": "Let brotherly love continue.\nDo not neglect hospitality,\nfor through it some have unknowingly entertained angels.\nBe mindful of prisoners as if sharing their imprisonment,\nand of the ill-treated as of yourselves,\nfor you also are in the body.\nLet marriage be honored among all\nand the marriage bed be kept undefiled,\nfor God will judge the immoral and adulterers.\nLet your life be free from love of money\nbut be content with what you have,\nfor he has said, I will never forsake you or abandon you.\nThus we may say with confidence:\n\nThe Lord is my helper,\nand I will not be afraid.\nWhat can anyone do to me?\n\nRemember your leaders who spoke the word of God to you.\nConsider the outcome of their way of life and imitate their faith.\nJesus Christ is the same yesterday, today, and forever."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 27:1, 3, 5, 8b-9abc",
              "response": "R. (1a)  The Lord is my light and my salvation.",
              "content": "The LORD is my light and my salvation;\n\nwhom should I fear?\n\nThe LORD is my life's refuge;\n\nof whom should I be afraid?\n\nR. The Lord is my light and my salvation.\n\nThough an army encamp against me,\n\nmy heart will not fear;\n\nThough war be waged upon me,\n\neven then will I trust.\n\nR. The Lord is my light and my salvation.\n\nFor he will hide me in his abode\n\nin the day of trouble;\n\nHe will conceal me in the shelter of his tent,\n\nhe will set me high upon a rock.\n\nR. The Lord is my light and my salvation.\n\nYour presence, O LORD, I seek.\n\nHide not your face from me;\n\ndo not in anger repel your servant.\n\nYou are my helper: cast me not off.\n\nR. The Lord is my light and my salvation."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who have kept the word with a generous heart,\nand yield a harvest through perseverance.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:14-29",
              "content": "King Herod heard about Jesus, for his fame had become widespread,\nand people were saying,\n\"John the Baptist has been raised from the dead;\nThat is why mighty powers are at work in him.\"\nOthers were saying, \"He is Elijah\";\nstill others, \"He is a prophet like any of the prophets.\"\nBut when Herod learned of it, he said,\n\"It is John whom I beheaded. He has been raised up.\"\n\nHerod was the one who had John arrested and bound in prison\non account of Herodias,\nthe wife of his brother Philip, whom he had married.\nJohn had said to Herod,\n\"It is not lawful for you to have your brother's wife.\"\nHerodias harbored a grudge against him\nand wanted to kill him but was unable to do so.\nHerod feared John, knowing him to be a righteous and holy man,\nand kept him in custody.\nWhen he heard him speak he was very much perplexed,\nyet he liked to listen to him.\nHerodias had an opportunity one day when Herod, on his birthday,\ngave a banquet for his courtiers, his military officers,\nand the leading men of Galilee.\nHis own daughter came in and performed a dance\nthat delighted Herod and his guests.\nThe king said to the girl,\n\"Ask of me whatever you wish and I will grant it to you.\"\nHe even swore many things to her,\n\"I will grant you whatever you ask of me,\neven to half of my kingdom.\"\n\nShe went out and said to her mother,\n\"What shall I ask for?\"\nHer mother replied, \"The head of John the Baptist.\"\nThe girl hurried back to the king's presence and made her request,\n\"I want you to give me at once on a platter\nthe head of John the Baptist.\"\nThe king was deeply distressed,\nbut because of his oaths and the guests\nhe did not wish to break his word to her.\nSo he promptly dispatched an executioner\nwith orders to bring back his head.\nHe went off and beheaded him in the prison.\nHe brought in the head on a platter\nand gave it to the girl.\nThe girl in turn gave it to her mother.\nWhen his disciples heard about it,\nthey came and took his body and laid it in a tomb."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-08": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.946Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-08": {
          "date": "2025-02-08",
          "liturgical_date": "Saturday of the Fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Hebrews 13:15-17, 20-21",
              "content": "Brothers and sisters:\nThrough Jesus, let us continually offer God a sacrifice of praise,\nthat is, the fruit of lips that confess his name.\nDo not neglect to do good and to share what you have;\nGod is pleased by sacrifices of that kind.\n\nObey your leaders and defer to them,\nfor they keep watch over you and will have to give an account,\nthat they may fulfill their task with joy and not with sorrow,\nfor that would be of no advantage to you.\n\nMay the God of peace, who brought up from the dead\nthe great shepherd of the sheep\nby the Blood of the eternal covenant,\nfurnish you with all that is good, that you may do his will.\nMay he carry out in you what is pleasing to him through Jesus Christ,\nto whom be glory forever and ever.  Amen."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 23:1-3a, 3b-4, 5, 6",
              "response": "R. (1)  The Lord is my shepherd; there is nothing I shall want.",
              "content": "The LORD is my shepherd; I shall not want.\n\nIn verdant pastures he gives me repose.\n\nBeside restful waters he leads me;\n\nhe refreshes my soul.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nHe guides me in right paths\n\nfor his name's sake.\n\nEven though I walk in the dark valley\n\nI fear no evil; for you are at my side\n\nWith your rod and your staff\n\nthat give me courage.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nYou spread the table before me\n\nin the sight of my foes;\n\nYou anoint my head with oil;\n\nmy cup overflows.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nOnly goodness and kindness follow me\n\nall the days of my life;\n\nAnd I shall dwell in the house of the LORD\n\nfor years to come.\n\nR. The Lord is my shepherd; there is nothing I shall want."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:30-34",
              "content": "The Apostles gathered together with Jesus\nand reported all they had done and taught.\nHe said to them,\n\"Come away by yourselves to a deserted place and rest a while.\"\nPeople were coming and going in great numbers,\nand they had no opportunity even to eat.\nSo they went off in the boat by themselves to a deserted place.\nPeople saw them leaving and many came to know about it.\nThey hastened there on foot from all the towns\nand arrived at the place before them.\n\nWhen Jesus disembarked and saw the vast crowd,\nhis heart was moved with pity for them,\nfor they were like sheep without a shepherd;\nand he began to teach them many things."
            }
          },
          "saint_of_day": {
            "name": "Jerome Emiliani",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-09": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.321Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-09": {
          "date": "2025-02-09",
          "liturgical_date": "Fifth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Isaiah 6:1-2a, 3-8",
              "content": "In the year King Uzziah died,\nI saw the Lord seated on a high and lofty throne,\nwith the train of his garment filling the temple.\nSeraphim were stationed above.\n\nThey cried one to the other,\n\"Holy, holy, holy is the LORD of hosts!\nAll the earth is filled with his glory!\"\nAt the sound of that cry, the frame of the door shook\nand the house was filled with smoke.\n\nThen I said, \"Woe is me, I am doomed!\nFor I am a man of unclean lips,\nliving among a people of unclean lips;\nyet my eyes have seen the King, the LORD of hosts!\"\nThen one of the seraphim flew to me,\nholding an ember that he had taken with tongs from the altar.\n\nHe touched my mouth with it, and said,\n\"See, now that this has touched your lips,\nyour wickedness is removed, your sin purged.\"\n\nThen I heard the voice of the Lord saying,\n\"Whom shall I send?  Who will go for us?\"\n\"Here I am,\" I said; \"send me!\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 138:1-2, 2-3, 4-5, 7-8",
              "response": "R. (1c) In the sight of the angels I will sing your praises, Lord.",
              "content": "I will give thanks to you, O LORD, with all my heart,\n\nfor you have heard the words of my mouth;\n\nin the presence of the angels I will sing your praise;\n\nI will worship at your holy temple\n\nand give thanks to your name.\n\nR. In the sight of the angels I will sing your praises, Lord.\n\nBecause of your kindness and your truth;\n\nfor you have made great above all things\n\nyour name and your promise.\n\nWhen I called, you answered me;\n\nyou built up strength within me.\n\nR. In the sight of the angels I will sing your praises, Lord.\n\nAll the kings of the earth shall give thanks to you, O LORD,\n\nwhen they hear the words of your mouth;\n\nand they shall sing of the ways of the LORD:\n\n\"Great is the glory of the LORD.\"\n\nR. In the sight of the angels I will sing your praises, Lord.\n\nYour right hand saves me.\n\nThe LORD will complete what he has done for me;\n\nyour kindness, O LORD, endures forever;\n\nforsake not the work of your hands.\n\nR. In the sight of the angels I will sing your praises, Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nCome after me\nand I will make you fishers of men.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 5:1-11",
              "content": "While the crowd was pressing in on Jesus and listening\nto the word of God,\nhe was standing by the Lake of Gennesaret.\nHe saw two boats there alongside the lake;\nthe fishermen had disembarked and were washing their nets.\nGetting into one of the boats, the one belonging to Simon,\nhe asked him to put out a short distance from the shore.\nThen he sat down and taught the crowds from the boat.\nAfter he had finished speaking, he said to Simon,\n\"Put out into deep water and lower your nets for a catch.\"\nSimon said in reply,\n\"Master, we have worked hard all night and have caught nothing,\nbut at your command I will lower the nets.\"\nWhen they had done this, they caught a great number of fish\nand their nets were tearing.\nThey signaled to their partners in the other boat\nto come to help them.\nThey came and filled both boats\nso that the boats were in danger of sinking.\nWhen Simon Peter saw this, he fell at the knees of Jesus and said,\n\"Depart from me, Lord, for I am a sinful man.\"\nFor astonishment at the catch of fish they had made seized him\nand all those with him,\nand likewise James and John, the sons of Zebedee,\nwho were partners of Simon.\nJesus said to Simon, \"Do not be afraid;\nfrom now on you will be catching men.\"\nWhen they brought their boats to the shore,\nthey left everything and followed him."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-10": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.552Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-10": {
          "date": "2025-02-10",
          "liturgical_date": "Memorial of Saint Scholastica, Virgin",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 1:1-19",
              "content": "In the beginning, when God created the heavens and the earth,\nthe earth was a formless wasteland, and darkness covered the abyss,\nwhile a mighty wind swept over the waters.\n\nThen God said,\n“Let there be light,” and there was light.\nGod saw how good the light was.\nGod then separated the light from the darkness.\nGod called the light “day,” and the darkness he called “night.”\nThus evening came, and morning followed–the first day.\n\nThen God said,\n“Let there be a dome in the middle of the waters,\nto separate one body of water from the other.”\nAnd so it happened:\nGod made the dome,\nand it separated the water above the dome from the water below it.\nGod called the dome “the sky.”\nEvening came, and morning followed–the second day.\n\nThen God said,\n“Let the water under the sky be gathered into a single basin,\nso that the dry land may appear.” \nAnd so it happened:\nthe water under the sky was gathered into its basin,\nand the dry land appeared.\nGod called the dry land “the earth,”\nand the basin of the water he called “the sea.”\nGod saw how good it was.\nThen God said,\n“Let the earth bring forth vegetation:\nevery kind of plant that bears seed\nand every kind of fruit tree on earth\nthat bears fruit with its seed in it.”\nAnd so it happened:\nthe earth brought forth every kind of plant that bears seed\nand every kind of fruit tree on earth that\nbears fruit with its seed in it.\nGod saw how good it was.\nEvening came, and morning followed–the third day.\n\nThen God said:\n“Let there be lights in the dome of the sky,\nto separate day from night.\nLet them mark the fixed times, the days and the years,\n\nand serve as luminaries in the dome of the sky,\nto shed light upon the earth.”\nAnd so it happened:\nGod made the two great lights,\nthe greater one to govern the day,\nand the lesser one to govern the night;\nand he made the stars.\nGod set them in the dome of the sky,\nto shed light upon the earth,\nto govern the day and the night,\nand to separate the light from the darkness.\nGod saw how good it was.\nEvening came, and morning followed–the fourth day."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 104:1-2a, 5-6, 10, 12, 24, 35c",
              "response": "R.    (31b)  May the Lord be glad in his works.",
              "content": "Bless the LORD, O my soul!\n\nO LORD, my God, you are great indeed!\n\nYou are clothed with majesty and glory,\n\nrobed in light as with a cloak.\n\nR.    May the Lord be glad in his works.\n\nYou fixed the earth upon its foundation,\n\nnot to be moved forever;\n\nWith the ocean, as with a garment, you covered it;\n\nabove the mountains the waters stood.\n\nR.    May the Lord be glad in his works.\n\nYou send forth springs into the watercourses\n\nthat wind among the mountains.\n\nBeside them the birds of heaven dwell;\n\nfrom among the branches they send forth their song.\n\nR.    May the Lord be glad in his works.\n\nHow manifold are your works, O LORD!\n\nIn wisdom you have wrought them all—\n\nthe earth is full of your creatures;\n\nBless the LORD, O my soul! Alleluia.\n\nR.    May the Lord be glad in his works."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nJesus preached the Gospel of the Kingdom\nand cured every disease among the people.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 6:53-56",
              "content": "After making the crossing to the other side of the sea,\nJesus and his disciples came to land at Gennesaret\nand tied up there.\nAs they were leaving the boat, people immediately recognized him.\nThey scurried about the surrounding country    \nand began to bring in the sick on mats\nto wherever they heard he was.\nWhatever villages or towns or countryside he entered,\nthey laid the sick in the marketplaces\nand begged him that they might touch only the tassel on his cloak;\nand as many as touched it were healed."
            }
          },
          "saint_of_day": {
            "name": "Scholastica",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-11": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.795Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-11": {
          "date": "2025-02-11",
          "liturgical_date": "Tuesday of the Fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 1:20—2:4a",
              "content": "God said,\n\"Let the water teem with an abundance of living creatures,\nand on the earth let birds fly beneath the dome of the sky.\"\nand so it happened:\nGod created the great sea monsters\nand all kinds of swimming creatures with which the water teems,\nand all kinds of winged birds.\nGod saw how good it was, and God blessed them, saying,\n\"Be fertile, multiply, and fill the water of the seas;\nand let the birds multiply on the earth.\"\nEvening came, and morning followed–the fifth day.\n\nThen God said,\n\"Let the earth bring forth all kinds of living creatures:\ncattle, creeping things, and wild animals of all kinds.\"\nand so it happened:\nGod made all kinds of wild animals, all kinds of cattle,\nand all kinds of creeping things of the earth.\nGod saw how good it was.\nThen God said:\n\"Let us make man in our image, after our likeness.\nLet them have dominion over the fish of the sea,\nthe birds of the air, and the cattle,\nand over all the wild animals\nand all the creatures that crawl on the ground.\"\n\nGod created man in his image;\nin the divine image he created him;\nmale and female he created them.\n\nGod blessed them, saying:\n\"Be fertile and multiply;\nfill the earth and subdue it.\nHave dominion over the fish of the sea, the birds of the air,\nand all the living things that move on the earth.\"\nGod also said:\n\"See, I give you every seed-bearing plant all over the earth\nand every tree that has seed-bearing fruit on it to be your food;\nand to all the animals of the land, all the birds of the air,\nand all the living creatures that crawl on the ground,\nI give all the green plants for food.\"\nAnd so it happened.\nGod looked at everything he had made, and he found it very good.\nEvening came, and morning followed–the sixth day.\n\nThus the heavens and the earth and all their array were completed.\nSince on the seventh day God was finished with the work he had been doing,\nhe rested on the seventh day from all the work he had undertaken.\nSo God blessed the seventh day and made it holy,\nbecause on it he rested from all the work he had done in creation.\n\nSuch is the story of the heavens and the earth at their creation."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 8:4-5, 6-7, 8-9",
              "response": "R. (2ab) O Lord, our God, how wonderful your name in all the earth!",
              "content": "When I behold your heavens, the work of your fingers,\n\nthe moon and the stars which you set in place—\n\nWhat is man that you should be mindful of him,\n\nor the son of man that you should care for him?\n\nR. O Lord, our God, how wonderful your name in all the earth!\n\nYou have made him little less than the angels,\n\nand crowned him with glory and honor.\n\nYou have given him rule over the works of your hands,\n\nputting all things under his feet.\n\nR. O Lord, our God, how wonderful your name in all the earth!\n\nAll sheep and oxen,\n\nyes, and the beasts of the field,\n\nThe birds of the air, the fishes of the sea,\n\nand whatever swims the paths of the seas.\n\nR. O Lord, our God, how wonderful your name in all the earth!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIncline my heart, O God, to your decrees;\nAnd favor me with your law.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 7:1-13",
              "content": "When the Pharisees with some scribes who had come from Jerusalem\ngathered around Jesus,\nthey observed that some of his disciples ate their meals\nwith unclean, that is, unwashed, hands.\n(For the Pharisees and, in fact, all Jews,\ndo not eat without carefully washing their hands,\nkeeping the tradition of the elders.\nAnd on coming from the marketplace\nthey do not eat without purifying themselves.\nAnd there are many other things that they have traditionally observed,\nthe purification of cups and jugs and kettles and beds.)\nSo the Pharisees and scribes questioned him,\n\"Why do your disciples not follow the tradition of the elders\nbut instead eat a meal with unclean hands?\"  \nHe responded,\n\"Well did Isaiah prophesy about you hypocrites,\nas it is written:\n\nThis people honors me with their lips,\nbut their hearts are far from me;\nin vain do they worship me,\nteaching as doctrines human precepts.\n\nYou disregard God's commandment but cling to human tradition.\"\nHe went on to say,\n\"How well you have set aside the commandment of God\nin order to uphold your tradition!\nFor Moses said,\nHonor your father and your mother,\nand Whoever curses father or mother shall die.\nYet you say,\n'If someone says to father or mother,\n\"Any support you might have had from me is qorban\"'\n(meaning, dedicated to God),\nyou allow him to do nothing more for his father or mother.\nYou nullify the word of God\nin favor of your tradition that you have handed on.\nAnd you do many such things.\""
            }
          },
          "saint_of_day": {
            "name": "Our Lady Lourdes",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-12": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.493Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-12": {
          "date": "2025-02-12",
          "liturgical_date": "Wednesday of the Fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 2:4b-9, 15-17",
              "content": "At the time when the LORD God made the earth and the heavens --\nwhile as yet there was no field shrub on earth\nand no grass of the field had sprouted,\nfor the LORD God had sent no rain upon the earth\nand there was no man to till the soil,\nbut a stream was welling up out of the earth\nand was watering all the surface of the ground --\nthe LORD God formed man out of the clay of the ground\nand blew into his nostrils the breath of life,\nand so man became a living being.\n\nThen the LORD God planted a garden in Eden, in the east,\nand he placed there the man whom he had formed.\nOut of the ground the LORD God made various trees grow\nthat were delightful to look at and good for food,\nwith the tree of life in the middle of the garden\nand the tree of the knowledge of good and evil.\n\nThe LORD God then took the man\nand settled him in the garden of Eden,\nto cultivate and care for it.\nThe LORD God gave man this order:\n\"You are free to eat from any of the trees of the garden\nexcept the tree of knowledge of good and evil.\nFrom that tree you shall not eat;\nthe moment you eat from it you are surely doomed to die.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 104:1-2a, 27-28, 29bc-30",
              "response": "R. (1a) O bless the Lord, my soul!",
              "content": "Bless the LORD, O my soul!\n\nO LORD, my God, you are great indeed!\n\nYou are clothed with majesty and glory,\n\nrobed in light as with a cloak.\n\nR. O bless the Lord, my soul!\n\nAll creatures look to you\n\nto give them food in due time.\n\nWhen you give it to them, they gather it;\n\nwhen you open your hand, they are filled with good things.\n\nR. O bless the Lord, my soul!\n\nIf you take away their breath, they perish\n\nand return to their dust.\n\nWhen you send forth your spirit, they are created,\n\nand you renew the face of the earth.\n\nR. O bless the Lord, my soul!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour word, O Lord, is truth:\nconsecrate us in the truth.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 7:14-23",
              "content": "Jesus summoned the crowd again and said to them,\n“Hear me, all of you, and understand.\nNothing that enters one from outside can defile that person;\nbut the things that come out from within are what defile.”\n\nWhen he got home away from the crowd\nhis disciples questioned him about the parable.\nHe said to them,\n“Are even you likewise without understanding?\nDo you not realize that everything\nthat goes into a person from outside cannot defile,\nsince it enters not the heart but the stomach\nand passes out into the latrine?”\n(Thus he declared all foods clean.)\n“But what comes out of the man, that is what defiles him.\nFrom within the man, from his heart,\ncome evil thoughts, unchastity, theft, murder,\nadultery, greed, malice, deceit,\nlicentiousness, envy, blasphemy, arrogance, folly.\nAll these evils come from within and they defile.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-13": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.548Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-13": {
          "date": "2025-02-13",
          "liturgical_date": "Thursday of the Fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 2:18-25",
              "content": "The LORD God said:\n\"It is not good for the man to be alone.\nI will make a suitable partner for him.\"\nSo the LORD God formed out of the ground\nvarious wild animals and various birds of the air,\nand he brought them to the man to see what he would call them;\nwhatever the man called each of them would be its name.\nThe man gave names to all the cattle,\nall the birds of the air, and all the wild animals;\nbut none proved to be the suitable partner for the man.\n\nSo the LORD God cast a deep sleep on the man,\nand while he was asleep, he took out one of his ribs\nand closed up its place with flesh.\nThe LORD God then built up into a woman\nthe rib that he had taken from the man.\nWhen he brought her to the man, the man said:\n\n\"This one, at last, is bone of my bones\nand flesh of my flesh;\nthis one shall be called 'woman,'\nfor out of 'her man' this one has been taken.\"\n\nThat is why a man leaves his father and mother\nand clings to his wife,\nand the two of them become one flesh.\n\nThe man and his wife were both naked, yet they felt no shame."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 128:1-2, 3, 4-5",
              "response": "R. (see 1a) Blessed are those who fear the Lord.",
              "content": "Blessed are you who fear the LORD,\n\nwho walk in his ways!\n\nFor you shall eat the fruit of your handiwork;\n\nblessed shall you be, and favored.\n\nR. Blessed are those who fear the Lord.\n\nYour wife shall be like a fruitful vine\n\nin the recesses of your home;\n\nYour children like olive plants\n\naround your table.\n\nR. Blessed are those who fear the Lord.\n\nBehold, thus is the man blessed\n\nwho fears the LORD.\n\nThe LORD bless you from Zion:\n\nmay you see the prosperity of Jerusalem\n\nall the days of your life.\n\nR. Blessed are those who fear the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nHumbly welcome the word that has been planted in you\nand is able to save your souls.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 7:24-30",
              "content": "Jesus went to the district of Tyre.\nHe entered a house and wanted no one to know about it,\nbut he could not escape notice.\nSoon a woman whose daughter had an unclean spirit heard about him.\nShe came and fell at his feet.\nThe woman was a Greek, a Syrophoenician by birth,\nand she begged him to drive the demon out of her daughter.\nHe said to her, \"Let the children be fed first.\nFor it is not right to take the food of the children\nand throw it to the dogs.\"\nShe replied and said to him,\n\"Lord, even the dogs under the table eat the children's scraps.\"\nThen he said to her, \"For saying this, you may go.\nThe demon has gone out of your daughter.\"\nWhen the woman went home, she found the child lying in bed\nand the demon gone."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-14": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.761Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-14": {
          "date": "2025-02-14",
          "liturgical_date": "Memorial of Saints Cyril, Monk, and Methodius, Bishop",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 3:1-8",
              "content": "Now the serpent was the most cunning of all the animals\nthat the LORD God had made.\nThe serpent asked the woman,\n“Did God really tell you not to eat\nfrom any of the trees in the garden?”\nThe woman answered the serpent:\n“We may eat of the fruit of the trees in the garden;\nit is only about the fruit of the tree\nin the middle of the garden that God said,\n‘You shall not eat it or even touch it, lest you die.’”\nBut the serpent said to the woman:\n“You certainly will not die!\nNo, God knows well that the moment you eat of it\nyour eyes will be opened and you will be like gods\nwho know what is good and what is evil.”\nThe woman saw that the tree was good for food,\npleasing to the eyes, and desirable for gaining wisdom.\nSo she took some of its fruit and ate it;\nand she also gave some to her husband, who was with her,\nand he ate it.\nThen the eyes of both of them were opened,\nand they realized that they were naked;\nso they sewed fig leaves together\nand made loincloths for themselves.\n\nWhen they heard the sound of the LORD God moving about in the garden\nat the breezy time of the day,\nthe man and his wife hid themselves from the LORD God\namong the trees of the garden."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 32:1-2, 5, 6, 7",
              "response": "R.    (1a) Blessed are those whose sins are forgiven.",
              "content": "Blessed is he whose fault is taken away,\n\nwhose sin is covered.\n\nBlessed the man to whom the LORD imputes not guilt,\n\nin whose spirit there is no guile.\n\nR.    Blessed are those whose sins are forgiven.\n\nThen I acknowledged my sin to you,\n\nmy guilt I covered not.\n\nI said, “I confess my faults to the LORD,”\n\nand you took away the guilt of my sin.\n\nR.    Blessed are those whose sins are forgiven.\n\nFor this shall every faithful man pray to you\n\nin time of stress.\n\nThough deep waters overflow,\n\nthey shall not reach him.\n\nR.    Blessed are those whose sins are forgiven.\n\nYou are my shelter; from distress you will preserve me;\n\nwith glad cries of freedom you will ring me round.\n\nR.    Blessed are those whose sins are forgiven."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOpen our hearts, O Lord,\nto listen to the words of your Son.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 7:31-37",
              "content": "Jesus left the district of Tyre\nand went by way of Sidon to the Sea of Galilee,\ninto the district of the Decapolis.\nAnd people brought to him a deaf man who had a speech impediment\nand begged him to lay his hand on him.\nHe took him off by himself away from the crowd.\nHe put his finger into the man’s ears\nand, spitting, touched his tongue;\nthen he looked up to heaven and groaned, and said to him,\n“Ephphatha!” (that is, “Be opened!”)\nAnd immediately the man’s ears were opened,\nhis speech impediment was removed,\nand he spoke plainly.\nHe ordered them not to tell anyone.\nBut the more he ordered them not to,\nthe more they proclaimed it.\nThey were exceedingly astonished and they said,\n“He has done all things well.\nHe makes the deaf hear and the mute speak.”"
            }
          },
          "saint_of_day": {
            "name": "Cyril Methodius",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-15": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.385Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-15": {
          "date": "2025-02-15",
          "liturgical_date": "Saturday of the Fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 3:9-24",
              "content": "The LORD God called to Adam and asked him, \"Where are you?\"\nHe answered, \"I heard you in the garden;\nbut I was afraid, because I was naked,\nso I hid myself.\"\nThen he asked, \"Who told you that you were naked?\nYou have eaten, then,\nfrom the tree of which I had forbidden you to eat!\"\nThe man replied, \"The woman whom you put here with me—\nshe gave me fruit from the tree, and so I ate it.\"\nThe LORD God then asked the woman,\n\"Why did you do such a thing?\"\nThe woman answered, \"The serpent tricked me into it, so I ate it.\"\n\nThen the LORD God said to the serpent:\n\n\"Because you have done this, you shall be banned\nfrom all the animals\nand from all the wild creatures;\nOn your belly shall you crawl,\nand dirt shall you eat\nall the days of your life.\nI will put enmity between you and the woman,\nand between your offspring and hers;\nHe will strike at your head,\nwhile you strike at his heel.\"\n\nTo the woman he said:\n\n\"I will intensify the pangs of your childbearing;\nin pain shall you bring forth children.\nYet your urge shall be for your husband,\nand he shall be your master.\"\n\nTo the man he said: \"Because you listened to your wife\nand ate from the tree of which I had forbidden you to eat,\n\n\"Cursed be the ground because of you!\nIn toil shall you eat its yield\nall the days of your life.\nThorns and thistles shall it bring forth to you,\nas you eat of the plants of the field.\nBy the sweat of your face\nshall you get bread to eat,\nUntil you return to the ground,\nfrom which you were taken;\nFor you are dirt,\nand to dirt you shall return.\"\nThe man called his wife Eve,\nbecause she became the mother of all the living.\n\nFor the man and his wife the LORD God made leather garments,\nwith which he clothed them.\nThen the LORD God said: \"See! The man has become like one of us,\nknowing what is good and what is evil!\nTherefore, he must not be allowed to put out his hand\nto take fruit from the tree of life also,\nand thus eat of it and live forever.\"\nThe LORD God therefore banished him from the garden of Eden,\nto till the ground from which he had been taken.\nWhen he expelled the man,\nhe settled him east of the garden of Eden;\nand he stationed the cherubim and the fiery revolving sword,\nto guard the way to the tree of life."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 90:2, 3-4abc, 5-6, 12-13",
              "response": "R. (1) In every age, O Lord, you have been our refuge.",
              "content": "Before the mountains were begotten\n\nand the earth and the world were brought forth,\n\nfrom everlasting to everlasting you are God.\n\nR. In every age, O Lord, you have been our refuge.\n\nYou turn man back to dust,\n\nsaying, \"Return, O children of men.\"\n\nFor a thousand years in your sight\n\nare as yesterday, now that it is past,\n\nor as a watch of the night.\n\nR. In every age, O Lord, you have been our refuge.\n\nYou make an end of them in their sleep;\n\nthe next morning they are like the changing grass,\n\nWhich at dawn springs up anew,\n\nbut by evening wilts and fades.\n\nR. In every age, O Lord, you have been our refuge.\n\nTeach us to number our days aright,\n\nthat we may gain wisdom of heart.\n\nReturn, O LORD! How long?\n\nHave pity on your servants!\n\nR. In every age, O Lord, you have been our refuge."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOne does not live on bread alone,\nbut on every word that comes forth from the mouth of God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:1-10",
              "content": "In those days when there again was a great crowd without anything to eat,\nJesus summoned the disciples and said,\n\"My heart is moved with pity for the crowd,\nbecause they have been with me now for three days\nand have nothing to eat.\nIf I send them away hungry to their homes,\nthey will collapse on the way,\nand some of them have come a great distance.\"\nHis disciples answered him, \"Where can anyone get enough bread\nto satisfy them here in this deserted place?\"\nStill he asked them, \"How many loaves do you have?\"\nThey replied, \"Seven.\"\nHe ordered the crowd to sit down on the ground.\nThen, taking the seven loaves he gave thanks, broke them,\nand gave them to his disciples to distribute,\nand they distributed them to the crowd.\nThey also had a few fish.\nHe said the blessing over them\nand ordered them distributed also.\nThey ate and were satisfied.\nThey picked up the fragments left over–seven baskets.\nThere were about four thousand people.\n\nHe dismissed the crowd and got into the boat with his disciples\nand came to the region of Dalmanutha."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-16": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.794Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-16": {
          "date": "2025-02-16",
          "liturgical_date": "Sixth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 1:1-2, 3, 4 & 6",
              "response": "",
              "content": "R (40:5a) Blessed are they who hope in the Lord.\nBlessed the man who follows not\n            the counsel of the wicked,\nnor walks in the way of sinners,\n            nor sits in the company of the insolent,\nbut delights in the law of the LORD\n            and meditates on his law day and night.\nR Blessed are they who hope in the Lord.\nHe is like a tree\n            planted near running water,\nthat yields its fruit in due season,\n            and whose leaves never fade.\nWhatever he does, prospers.\nR Blessed are they who hope in the Lord.\nNot so the wicked, not so;\n            they are like chaff which the wind drives away.\nFor the LORD watches over the way of the just,\n            but the way of the wicked vanishes.\nR Blessed are they who hope in the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nRejoice and be glad;\nyour reward will be great in heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:17, 20-26",
              "content": "Jesus came down with the Twelve\nand stood on a stretch of level ground\nwith a great crowd of his disciples\nand a large number of the people\nfrom all Judea and Jerusalem\nand the coastal region of Tyre and Sidon.\nAnd raising his eyes toward his disciples he said:\n            “Blessed are you who are poor,\n                        for the kingdom of God is yours.\n            Blessed are you who are now hungry,\n                        for you will be satisfied.\n            Blessed are you who are now weeping,\n                        for you will laugh.\n            Blessed are you when people hate you,\n                        and when they exclude and insult you,\n                        and denounce your name as evil\n                        on account of the Son of Man.\nRejoice and leap for joy on that day!\nBehold, your reward will be great in heaven.\nFor their ancestors treated the prophets in the same way.\n            But woe to you who are rich,\n                        for you have received your consolation.\n            Woe to you who are filled now,\n                        for you will be hungry.\n            Woe to you who laugh now,\n                        for you will grieve and weep.\n            Woe to you when all speak well of you,\n                        for their ancestors treated the false prophets in this way.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-17": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.321Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-17": {
          "date": "2025-02-17",
          "liturgical_date": "Monday of the Sixth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 4:1-15, 25",
              "content": "The man had relations with his wife Eve,\nand she conceived and bore Cain, saying,\n“I have produced a man with the help of the LORD.”\nNext she bore his brother Abel.\nAbel became a keeper of flocks, and Cain a tiller of the soil.\nIn the course of time Cain brought an offering to the LORD\nfrom the fruit of the soil,\nwhile Abel, for his part,\nbrought one of the best firstlings of his flock.\nThe LORD looked with favor on Abel and his offering,\nbut on Cain and his offering he did not.\nCain greatly resented this and was crestfallen.\nSo the LORD said to Cain:\n“Why are you so resentful and crestfallen.\nIf you do well, you can hold up your head;\nbut if not, sin is a demon lurking at the door:\nhis urge is toward you, yet you can be his master.”\n\nCain said to his brother Abel, “Let us go out in the field.”\nWhen they were in the field,\nCain attacked his brother Abel and killed him.\nThen the LORD asked Cain, “Where is your brother Abel?”\nHe answered, “I do not know.\nAm I my brother’s keeper?”\nThe LORD then said:  “What have you done!\nListen: your brother’s blood cries out to me from the soil!\nTherefore you shall be banned from the soil\nthat opened its mouth to receive\nyour brother’s blood from your hand.\nIf you till the soil, it shall no longer give you its produce.\nYou shall become a restless wanderer on the earth.”\nCain said to the LORD:  “My punishment is too great to bear.\nSince you have now banished me from the soil,\nand I must avoid your presence\nand become a restless wanderer on the earth,\nanyone may kill me at sight.”\n“Not so!” the LORD said to him.\n“If anyone kills Cain, Cain shall be avenged sevenfold.”\nSo the LORD put a mark on Cain, lest anyone should kill him at sight.\n\nAdam again had relations with his wife,\nand she gave birth to a son whom she called Seth.\n“God has granted me more offspring in place of Abel,” she said,\n“because Cain slew him.”"
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 50:1,8, 16bc-17, 20-21",
              "response": "R. (14a)  Offer to God a sacrifice of praise.",
              "content": "God the LORD has spoken and summoned the earth,\n\nfrom the rising of the sun to its setting.\n\n“Not for your sacrifices do I rebuke you,\n\nfor your burnt offerings are before me always.”\n\nR. Offer to God a sacrifice of praise.\n\n“Why do you recite my statutes,\n\nand profess my covenant with your mouth\n\nThough you hate discipline\n\nand cast my words behind you?”\n\nR. Offer to God a sacrifice of praise.\n\n“You sit speaking against your brother;\n\nagainst your mother’s son you spread rumors.\n\nWhen you do these things, shall I be deaf to it?\n\nOr do you think that I am like yourself?\n\nI will correct you by drawing them up before your eyes.”\n\nR. Offer to God a sacrifice of praise."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way and the truth and the life, says the Lord;\nno one comes to the Father except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:11-13",
              "content": "The Pharisees came forward and began to argue with Jesus,\nseeking from him a sign from heaven to test him.\nHe sighed from the depth of his spirit and said,\n“Why does this generation seek a sign?\nAmen, I say to you, no sign will be given to this generation.”\nThen he left them, got into the boat again,\nand went off to the other shore."
            }
          },
          "saint_of_day": {
            "name": "Seven Founders Order Servites",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-18": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.431Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-18": {
          "date": "2025-02-18",
          "liturgical_date": "Tuesday of the Sixth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 29:1a, 2, 3ac-4, 3b & 9c-10",
              "response": "R.    (11b)  The Lord will bless his people with peace.",
              "content": "Give to the LORD, you sons of God,\n\ngive to the LORD glory and praise,\n\nGive to the LORD the glory due his name;\n\nadore the LORD in holy attire.\n\nR.    The Lord will bless his people with peace.\n\nThe voice of the LORD is over the waters,\n\nthe LORD, over vast waters.\n\nThe voice of the LORD is mighty;\n\nthe voice of the LORD is majestic.\n\nR.    The Lord will bless his people with peace.\n\nThe God of glory thunders,\n\nand in his temple all say, “Glory!”\n\nThe LORD is enthroned above the flood;\n\nthe LORD is enthroned as king forever.\n\nR.    The Lord will bless his people with peace."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhoever loves me will keep my word, says the Lord;\nand my Father will love him\nand we will come to him.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:14-21",
              "content": "The disciples had forgotten to bring bread,\nand they had only one loaf with them in the boat.\nJesus enjoined them, “Watch out,\nguard against the leaven of the Pharisees\nand the leaven of Herod.” \nThey concluded among themselves that\nit was because they had no bread.\nWhen he became aware of this he said to them,\n“Why do you conclude that it is because you have no bread?\nDo you not yet understand or comprehend?\nAre your hearts hardened?\nDo you have eyes and not see, ears and not hear?\nAnd do you not remember,\nwhen I broke the five loaves for the five thousand,\nhow many wicker baskets full of fragments you picked up?”\nThey answered him, “Twelve.”\n“When I broke the seven loaves for the four thousand,\nhow many full baskets of fragments did you pick up?”\nThey answered him, “Seven.”\nHe said to them, “Do you still not understand?”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-19": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.249Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-19": {
          "date": "2025-02-19",
          "liturgical_date": "Wednesday of the Sixth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 8:6-13, 20-22",
              "content": "At the end of forty days Noah opened the hatch he had made in the ark,\nand he sent out a raven,\nto see if the waters had lessened on the earth.\nIt flew back and forth until the waters dried off from the earth.\nThen he sent out a dove,\nto see if the waters had lessened on the earth.\nBut the dove could find no place to alight and perch,\nand it returned to him in the ark,\nfor there was water all over the earth.\nPutting out his hand, he caught the dove\nand drew it back to him inside the ark.\nHe waited seven days more and again sent the dove out from the ark.\nIn the evening the dove came back to him,\nand there in its bill was a plucked-off olive leaf!\nSo Noah knew that the waters had lessened on the earth.\nHe waited still another seven days\nand then released the dove once more;\nand this time it did not come back.\n\nIn the six hundred and first year of Noah’s life,\nin the first month, on the first day of the month,\nthe water began to dry up on the earth.\nNoah then removed the covering of the ark\nand saw that the surface of the ground was drying up.\n\nNoah built an altar to the LORD,\nand choosing from every clean animal and every clean bird,\nhe offered burnt offerings on the altar.\nWhen the LORD smelled the sweet odor, he said to himself:\n“Never again will I doom the earth because of man\nsince the desires of man’s heart are evil from the start;\nnor will I ever again strike down all living beings, as I have done.\nAs long as the earth lasts,\nseedtime and harvest,\ncold and heat,\nSummer and winter,\nand day and night\nshall not cease.”"
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 116:12-13, 14-15, 18-19",
              "response": "R.  (17a)  To you, Lord, I will offer a sacrifice of praise.",
              "content": "or:\n\nR. Alleluia.\n\nHow shall I make a return to the LORD\n\nfor all the good he has done for me?\n\nThe cup of salvation I will take up,\n\nand I will call upon the name of the LORD.\n\nR. To you, Lord, I will offer a sacrifice of praise.\n\nor:\n\nR. Alleluia.\n\nMy vows to the LORD I will pay\n\nin the presence of all his people.\n\nPrecious in the eyes of the LORD\n\nis the death of his faithful ones.\n\nR. To you, Lord, I will offer a sacrifice of praise.\n\nor:\n\nR. Alleluia.\n\nMy vows to the LORD I will pay\n\nin the presence of all his people,\n\nIn the courts of the house of the LORD,\n\nin your midst, O Jerusalem.\n\nR. To you, Lord, I will offer a sacrifice of praise.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMay the Father of our Lord Jesus Christ\nenlighten the eyes of our hearts,\nthat we may know what is the hope\nthat belongs to his call.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:22-26",
              "content": "When Jesus and his disciples arrived at Bethsaida,\npeople brought to him a blind man and begged Jesus to touch him.\nHe took the blind man by the hand and led him outside the village.\nPutting spittle on his eyes he laid his hands on the man and asked,\n“Do you see anything?”\nLooking up the man replied, “I see people looking like trees and walking.”\nThen he laid hands on the man’s eyes a second time and he saw clearly;\nhis sight was restored and he could see everything distinctly.\nThen he sent him home and said, “Do not even go into the village.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-20": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.724Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-20": {
          "date": "2025-02-20",
          "liturgical_date": "Thursday of the Sixth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 9:1-13",
              "content": "God blessed Noah and his sons and said to them:\n“Be fertile and multiply and fill the earth.\nDread fear of you shall come upon all the animals of the earth\nand all the birds of the air,\nupon all the creatures that move about on the ground\nand all the fishes of the sea;\ninto your power they are delivered.\nEvery creature that is alive shall be yours to eat;\nI give them all to you as I did the green plants.\nOnly flesh with its lifeblood still in it you shall not eat.\nFor your own lifeblood, too, I will demand an accounting:\nfrom every animal I will demand it,\nand from one man in regard to his fellow man   \nI will demand an accounting for human life.\n\nIf anyone sheds the blood of man,\nby man shall his blood be shed;\nFor in the image of God\nhas man been made.\n\nBe fertile, then, and multiply;\nabound on earth and subdue it.”\n\nGod said to Noah and to his sons with him:\n“See, I am now establishing my covenant with you\nand your descendants after you\nand with every living creature that was with you:\nall the birds, and the various tame and wild animals\nthat were with you and came out of the ark.\nI will establish my covenant with you,\nthat never again shall all bodily creatures be destroyed\nby the waters of a flood;\nthere shall not be another flood to devastate the earth.”\nGod added:\n“This is the sign that I am giving for all ages to come,\nof the covenant between me and you\nand every living creature with you:\nI set my bow in the clouds to serve as a sign\nof the covenant between me and the earth.”"
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 102:16-18, 19-21, 29 and 22-23",
              "response": "R. (20b)  From heaven the Lord looks down on the earth.",
              "content": "The nations shall revere your name, O LORD,\n\nand all the kings of the earth your glory,\n\nWhen the LORD has rebuilt Zion\n\nand appeared in his glory;\n\nWhen he has regarded the prayer of the destitute,\n\nand not despised their prayer.\n\nR. From heaven the Lord looks down on the earth.\n\nLet this be written for the generation to come,\n\nand let his future creatures praise the LORD:\n\n“The LORD looked down from his holy height,\n\nfrom heaven he beheld the earth,\n\nTo hear the groaning of the prisoners,\n\nto release those doomed to die.”\n\nR. From heaven the Lord looks down on the earth.\n\nThe children of your servants shall abide,\n\nand their posterity shall continue in your presence,\n\nThat the name of the LORD may be declared in Zion,\n\nand his praise, in Jerusalem,\n\nWhen the peoples gather together,\n\nand the kingdoms, to serve the LORD.\n\nR. From heaven the Lord looks down on the earth."
            },
            "gospel_acclamation": {
              "citation": "Alleluia See John 6:63c, 68c",
              "content": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life;\nyou have the words of everlasting life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:27-33",
              "content": "Jesus and his disciples set out\nfor the villages of Caesarea Philippi.\nAlong the way he asked his disciples,\n“Who do people say that I am?”\nThey said in reply,\n“John the Baptist, others Elijah,\nstill others one of the prophets.”\nAnd he asked them,\n“But who do you say that I am?”\nPeter said to him in reply,\n“You are the Christ.”\n \nThen he warned them not to tell anyone about him.\n\nHe began to teach them\nthat the Son of Man must suffer greatly\nand be rejected by the elders, the chief priests, and the scribes,\nand be killed, and rise after three days.\nHe spoke this openly.\nThen Peter took him aside and began to rebuke him.\nAt this he turned around and, looking at his disciples,\nrebuked Peter and said, “Get behind me, Satan.\nYou are thinking not as God does, but as human beings do.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-21": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.249Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-21": {
          "date": "2025-02-21",
          "liturgical_date": "Friday of the Sixth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Genesis 11:1-9",
              "content": "The whole world spoke the same language, using the same words.\nWhile the people were migrating in the east,\nthey came upon a valley in the land of Shinar and settled there.\nThey said to one another,\n\"Come, let us mold bricks and harden them with fire.\"\nThey used bricks for stone, and bitumen for mortar.\nThen they said, \"Come, let us build ourselves a city\nand a tower with its top in the sky,\nand so make a name for ourselves;\notherwise we shall be scattered all over the earth.\"\n\nThe LORD came down to see the city and the tower\nthat they had built.\nThen the LORD said: \"If now, while they are one people,\nall speaking the same language,\nthey have started to do this,\nnothing will later stop them from doing whatever they presume to do.\nLet us then go down and there confuse their language,\nso that one will not understand what another says.\"\nThus the LORD scattered them from there all over the earth,\nand they stopped building the city.\nThat is why it was called Babel,\nbecause there the LORD confused the speech of all the world.\nIt was from that place that he scattered them all over the earth."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 33:10-11, 12-13, 14-15",
              "response": "R. (12) Blessed the people the Lord has chosen to be his own.",
              "content": "The LORD brings to nought the plans of nations;\n\nhe foils the designs of peoples.\n\nBut the plan of the LORD stands forever;\n\nthe design of his heart, through all generations.\n\nR. Blessed the people the Lord has chosen to be his own.\n\nBlessed the nation whose God is the LORD,\n\nthe people he has chosen for his own inheritance.\n\nFrom heaven the LORD looks down;\n\nhe sees all mankind.\n\nR. Blessed the people the Lord has chosen to be his own.\n\nFrom his fixed throne he beholds\n\nall who dwell on the earth,\n\nHe who fashioned the heart of each,\n\nhe who knows all their works.\n\nR. Blessed the people the Lord has chosen to be his own."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI call you my friends, says the Lord,\nfor I have made known to you all that the Father has told me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 8:34—9:1",
              "content": "Jesus summoned the crowd with his disciples and said to them,\n\"Whoever wishes to come after me must deny himself,\ntake up his cross, and follow me.\nFor whoever wishes to save his life will lose it,\nbut whoever loses his life for my sake\nand that of the Gospel will save it.\nWhat profit is there for one to gain the whole world\nand forfeit his life?\nWhat could one give in exchange for his life?\nWhoever is ashamed of me and of my words\nin this faithless and sinful generation,\nthe Son of Man will be ashamed of\nwhen he comes in his Father's glory with the holy angels.\"\n\nHe also said to them,\n\"Amen, I say to you,\nthere are some standing here who will not taste death\nuntil they see that the Kingdom of God has come in power.\""
            }
          },
          "saint_of_day": {
            "name": "Peter Damian",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-22": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.710Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-22": {
          "date": "2025-02-22",
          "liturgical_date": "Feast of the Chair of Saint Peter, Apostle",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Peter 5:1-4",
              "content": "Beloved:\nI exhort the presbyters among you,\nas a fellow presbyter and witness to the sufferings of Christ\nand one who has a share in the glory to be revealed.\nTend the flock of God in your midst,\noverseeing not by constraint but willingly,\nas God would have it, not for shameful profit but eagerly.\nDo not lord it over those assigned to you,\nbut be examples to the flock.\nAnd when the chief Shepherd is revealed,\nyou will receive the unfading crown of glory."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 23:1-3a, 4, 5, 6",
              "response": "R. (1) The Lord is my shepherd; there is nothing I shall want.",
              "content": "The LORD is my shepherd; I shall not want.\n\nIn verdant pastures he gives me repose;\n\nBeside restful waters he leads me;\n\nhe refreshes my soul.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nEven though I walk in the dark valley\n\nI fear no evil; for you are at my side\n\nWith your rod and your staff\n\nthat give me courage.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nYou spread the table before me\n\nin the sight of my foes;\n\nYou anoint my head with oil;\n\nmy cup overflows.\n\nR. The Lord is my shepherd; there is nothing I shall want.\n\nOnly goodness and kindness follow me\n\nall the days of my life;\n\nAnd I shall dwell in the house of the LORD\n\nfor years to come.\n\nR. The Lord is my shepherd; there is nothing I shall want."
            },
            "gospel_acclamation": {
              "citation": "",
              "content": ""
            },
            "gospel": {
              "citation": "Gospel Matthew 16:13-19",
              "content": "When Jesus went into the region of Caesarea Philippi\nhe asked his disciples,\n“Who do people say that the Son of Man is?”\nThey replied, “Some say John the Baptist, others Elijah,\nstill others Jeremiah or one of the prophets.”\nHe said to them, “But who do you say that I am?”\nSimon Peter said in reply,\n“You are the Christ, the Son of the living God.”\nJesus said to him in reply, “Blessed are you, Simon son of Jonah.\nFor flesh and blood has not revealed this to you, but my heavenly Father.\nAnd so I say to you, you are Peter,\nand upon this rock I will build my Church,\nand the gates of the netherworld shall not prevail against it.\nI will give you the keys to the Kingdom of heaven.\nWhatever you bind on earth shall be bound in heaven;\nand whatever you loose on earth shall be loosed in heaven.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-23": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:28.623Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-23": {
          "date": "2025-02-23",
          "liturgical_date": "Seventh Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 103:1-2, 3-4, 8, 10, 12-13",
              "response": "",
              "content": "R (8a) The Lord is kind and merciful.\nBless the LORD, O my soul;\n            and all my being, bless his holy name.\nBless the LORD, O my soul,\n            and forget not all his benefits.\nR The Lord is kind and merciful.\nHe pardons all your iniquities,\n            heals all your ills.\nHe redeems your life from destruction,\n            crowns you with kindness and compassion.\nR The Lord is kind and merciful.\nMerciful and gracious is the LORD,\n            slow to anger and abounding in kindness.\nNot according to our sins does he deal with us,\n            nor does he requite us according to our crimes.\nR The Lord is kind and merciful.\nAs far as the east is from the west,\n            so far has he put our transgressions from us.\nAs a father has compassion on his children,\n            so the LORD has compassion on those who fear him.\nR The Lord is kind and merciful."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI give you a new commandment, says the Lord:\nlove one another as I have loved you.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:27-38",
              "content": "Jesus said to his disciples:\n“To you who hear I say,\nlove your enemies, do good to those who hate you,\nbless those who curse you, pray for those who mistreat you.\nTo the person who strikes you on one cheek,\noffer the other one as well,\nand from the person who takes your cloak,\ndo not withhold even your tunic.\nGive to everyone who asks of you,\nand from the one who takes what is yours do not demand it back.\nDo to others as you would have them do to you.\nFor if you love those who love you,\nwhat credit is that to you?\nEven sinners love those who love them.\nAnd if you do good to those who do good to you,\nwhat credit is that to you?\nEven sinners do the same.\nIf you lend money to those from whom you expect repayment,\nwhat credit is that to you?\nEven sinners lend to sinners,\nand get back the same amount.\nBut rather, love your enemies and do good to them,\nand lend expecting nothing back;\nthen your reward will be great\nand you will be children of the Most High,\nfor he himself is kind to the ungrateful and the wicked.\nBe merciful, just as your Father is merciful.\n\n“Stop judging and you will not be judged.\nStop condemning and you will not be condemned.\nForgive and you will be forgiven.\nGive, and gifts will be given to you;\na good measure, packed together, shaken down, and overflowing,\nwill be poured into your lap.\nFor the measure with which you measure\nwill in return be measured out to you.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-24": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.321Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-24": {
          "date": "2025-02-24",
          "liturgical_date": "Monday of the Seventh Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirach 1:1-10",
              "content": "All wisdom comes from the LORD\nand with him it remains forever, and is before all time\nThe sand of the seashore, the drops of rain,\nthe days of eternity: who can number these?\nHeaven's height, earth's breadth,\nthe depths of the abyss: who can explore these?\nBefore all things else wisdom was created;\nand prudent understanding, from eternity.\nThe word of God on high is the fountain of wisdom\nand her ways are everlasting.\nTo whom has wisdom's root been revealed?\nWho knows her subtleties?\nTo whom has the discipline of wisdom been revealed?\nAnd who has understood the multiplicity of her ways?\nThere is but one, wise and truly awe-inspiring,\nseated upon his throne:\nThere is but one, Most High\nall-powerful creator-king and truly awe-inspiring one,\nseated upon his throne and he is the God of dominion.\nIt is the LORD; he created her through the Holy Spirit,\nhas seen her and taken note of her.\nHe has poured her forth upon all his works,\nupon every living thing according to his bounty;\nhe has lavished her upon his friends."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 93:1ab, 1cd-2, 5",
              "response": "R.(1a)  The Lord is king; he is robed in majesty.",
              "content": "The LORD is king, in splendor robed;\n\nrobed is the LORD and girt about with strength.\n\nR.The Lord is king; he is robed in majesty.\n\nAnd he has made the world firm,\n\nnot to be moved.\n\nYour throne stands firm from of old;\n\nfrom everlasting you are, O LORD.\n\nR.The Lord is king; he is robed in majesty.\n\nYour decrees are worthy of trust indeed:\n\nholiness befits your house,\n\nO LORD, for length of days.\n\nR.The Lord is king; he is robed in majesty."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOur Savior Jesus Christ has destroyed death\nand brought life to light through the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 9:14-29",
              "content": "As Jesus came down from the mountain with Peter, James, John\nand approached the other disciples,\nthey saw a large crowd around them and scribes arguing with them.\nImmediately on seeing him,\nthe whole crowd was utterly amazed.\nThey ran up to him and greeted him.\nHe asked them, “What are you arguing about with them?”\nSomeone from the crowd answered him,\n“Teacher, I have brought to you my son possessed by a mute spirit.\nWherever it seizes him, it throws him down;\nhe foams at the mouth, grinds his teeth, and becomes rigid.\nI asked your disciples to drive it out, but they were unable to do so.”\nHe said to them in reply,\n“O faithless generation, how long will I be with you?\nHow long will I endure you? Bring him to me.”\nThey brought the boy to him.\nAnd when he saw him,\nthe spirit immediately threw the boy into convulsions.\nAs he fell to the ground, he began to roll around   \nand foam at the mouth.\nThen he questioned his father,\n“How long has this been happening to him?”\nHe replied, “Since childhood.\nIt has often thrown him into fire and into water to kill him.\nBut if you can do anything, have compassion on us and help us.”\nJesus said to him,\n“‘If you can!’ Everything is possible to one who has faith.”\nThen the boy’s father cried out, “I do believe, help my unbelief!”\nJesus, on seeing a crowd rapidly gathering,\nrebuked the unclean spirit and said to it,\n“Mute and deaf spirit, I command you:\ncome out of him and never enter him again!”\nShouting and throwing the boy into convulsions, it came out.\nHe became like a corpse, which caused many to say, “He is dead!”\nBut Jesus took him by the hand, raised him, and he stood up.\nWhen he entered the house, his disciples asked him in private,\n“Why could we not drive the spirit out?”\nHe said to them, “This kind can only come out through prayer.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-25": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.563Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-25": {
          "date": "2025-02-25",
          "liturgical_date": "Tuesday of the Seventh Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirach 2:1-11",
              "content": "My son, when you come to serve the LORD,\nstand in justice and fear,\nprepare yourself for trials.\nBe sincere of heart and steadfast,\nincline your ear and receive the word of understanding,\nundisturbed in time of adversity.\nWait on God, with patience, cling to him, forsake him not;\nthus will you be wise in all your ways.\nAccept whatever befalls you,\nwhen sorrowful, be steadfast,\nand in crushing misfortune be patient;\nFor in fire gold and silver are tested,\nand worthy people in the crucible of humiliation.\nTrust God and God will help you;\ntrust in him, and he will direct your way;\nkeep his fear and grow old therein.\n\nYou who fear the LORD, wait for his mercy,\nturn not away lest you fall.\nYou who fear the LORD, trust him,\nand your reward will not be lost.\nYou who fear the LORD, hope for good things,\nfor lasting joy and mercy.\nYou who fear the LORD, love him,\nand your hearts will be enlightened.\nStudy the generations long past and understand;\nhas anyone hoped in the LORD and been disappointed?\nHas anyone persevered in his commandments and been forsaken?  \nhas anyone called upon him and been rebuffed?\nCompassionate and merciful is the LORD;\nhe forgives sins, he saves in time of trouble\nand he is a protector to all who seek him in truth."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 37:3-4, 18-19, 27-28, 39-40",
              "response": "R. (see 5)  Commit your life to the Lord, and he will help you.",
              "content": "Trust in the LORD and do good,\n\nthat you may dwell in the land and be fed in security.\n\nTake delight in the LORD,\n\nand he will grant you your heart's requests.\n\nR. Commit your life to the Lord, and he will help you.\n\nThe LORD watches over the lives of the wholehearted;\n\ntheir inheritance lasts forever.\n\nThey are not put to shame in an evil time;\n\nin days of famine they have plenty.\n\nR. Commit your life to the Lord, and he will help you.\n\nTurn from evil and do good,\n\nthat you may abide forever;\n\nFor the LORD loves what is right,\n\nand forsakes not his faithful ones.\n\nR. Commit your life to the Lord, and he will help you.\n\nThe salvation of the just is from the LORD;\n\nhe is their refuge in time of distress.\n\nAnd the LORD helps them and delivers them;\n\nhe delivers them from the wicked and saves them,\n\nbecause they take refuge in him.\n\nR. Commit your life to the Lord, and he will help you."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nMay I never boast except in the Cross of our Lord Jesus Christ,\nthrough which the world has been crucified to me and I to the world.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 9:30-37",
              "content": "Jesus and his disciples left from there and began a journey through Galilee,\nbut he did not wish anyone to know about it.\nHe was teaching his disciples and telling them,\n\"The Son of Man is to be handed over to men\nand they will kill him,\nand three days after his death the Son of Man will rise.\"\nBut they did not understand the saying,\nand they were afraid to question him.\n\nThey came to Capernaum and, once inside the house,\nhe began to ask them,\n\"What were you arguing about on the way?\"\nBut they remained silent.\nFor they had been discussing among themselves on the way\nwho was the greatest.\n\nThen he sat down, called the Twelve, and said to them,\n\"If anyone wishes to be first,   \nhe shall be the last of all and the servant of all.\"\nTaking a child, he placed it in their midst,   \nand putting his arms around it, he said to them,\n\"Whoever receives one child such as this in my name, receives me;\nand whoever receives me,\nreceives not me but the One who sent me.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-26": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.249Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-26": {
          "date": "2025-02-26",
          "liturgical_date": "Wednesday of the Seventh Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirach 4:11-19",
              "content": "Wisdom breathes life into her children\nand admonishes those who seek her.\nHe who loves her loves life;\nthose who seek her will be embraced by the Lord.\nHe who holds her fast inherits glory;\nwherever he dwells, the LORD bestows blessings.\nThose who serve her serve the Holy One;\nthose who love her the LORD loves.\nHe who obeys her judges nations;\nhe who hearkens to her dwells in her inmost chambers.\nIf one trusts her, he will possess her;\nhis descendants too will inherit her.\nShe walks with him as a stranger\nand at first she puts him to the test;\nFear and dread she brings upon him\nand tries him with her discipline\nuntil she try him by her laws and trust his soul.\nThen she comes back to bring him happiness\nand reveal her secrets to them\nand she will heap upon him\ntreasures of knowledge and an understanding of justice.\nBut if he fails her, she will abandon him\nand deliver him into the hands of despoilers."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 119:165, 168, 171, 172, 174, 175",
              "response": "R. (165a)  O Lord, great peace have they who love your law.",
              "content": "Those who love your law have great peace,\n\nand for them there is no stumbling block.\n\nR. O Lord, great peace have they who love your law.\n\nI keep your precepts and your decrees,\n\nfor all my ways are before you.\n\nR. O Lord, great peace have they who love your law.\n\nMy lips pour forth your praise,\n\nbecause you teach me your statutes.\n\nR. O Lord, great peace have they who love your law.\n\nMay my tongue sing of your promise,\n\nfor all your commands are just.\n\nR. O Lord, great peace have they who love your law.\n\nI long for your salvation, O LORD,\n\nand your law is my delight.\n\nR. O Lord, great peace have they who love your law.\n\nLet my soul live to praise you,\n\nand may your ordinances help me.\n\nR. O Lord, great peace have they who love your law."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way and the truth and the life, says the Lord;\nno one comes to the Father except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 9:38-40",
              "content": "John said to Jesus,\n\"Teacher, we saw someone driving out demons in your name,\nand we tried to prevent him because he does not follow us.\"\nJesus replied, \"Do not prevent him.\nThere is no one who performs a mighty deed in my name\nwho can at the same time speak ill of me.\nFor whoever is not against us is for us.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-27": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:27.559Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-27": {
          "date": "2025-02-27",
          "liturgical_date": "Thursday of the Seventh Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirarch 5:1-8",
              "content": "Rely not on your wealth;say not: \"I have the power.\"Rely not on your strengthin following the desires of your heart.Say not: \"Who can prevail against me?\"or, \"Who will subdue me for my deeds?\"for God will surely exact the punishment.Say not: \"I have sinned, yet what has befallen me?\"for the Most High bides his time.Of forgiveness be not overconfident,adding sin upon sin.Say not: \"Great is his mercy;my many sins he will forgive.\"For mercy and anger alike are with him;upon the wicked alights his wrath.Delay not your conversion to the LORD,put it not off from day to day.For suddenly his wrath flames forth;at the time of vengeance you will be destroyed.Rely not upon deceitful wealth,for it will be no help on the day of wrath."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 1:1-4, 6",
              "response": "R. (40:5a) Blessed are they who hope in the Lord.Blessed the man who follows notthe counsel of the wickedNor walks in the way of sinners,nor sits in the company of the insolent,But delights in the law of the LORDand meditates on his law day and night.R. Blessed are they who hope in the Lord.He is like a treeplanted near running water,That yields its fruit in due season,and whose leaves never fade.Whatever he does, prospers.R. Blessed are they who hope in the Lord.Not so the wicked, not so;they are like chaff which the wind drives away.For the LORD watches over the way of the just,but the way of the wicked vanishes.R. Blessed are they who hope in the Lord.",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.Receive the word of God, not as the word of men,but as it truly is, the word of God.R. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 9:41-50",
              "content": "Jesus said to his disciples:\"Anyone who gives you a cup of water to drinkbecause you belong to Christ,amen, I say to you, will surely not lose his reward.\"Whoever causes one of these little ones who believe in me to sin,   it would be better for him if a great millstonewere put around his neckand he were thrown into the sea.If your hand causes you to sin, cut it off.It is better for you to enter into life maimed   than with two hands to go into Gehenna,into the unquenchable fire.And if your foot causes you to sin, cut it off.It is better for you to enter into life crippled   than with two feet to be thrown into Gehenna.And if your eye causes you to sin, pluck it out.Better for you to enter into the Kingdom of God with one eyethan with two eyes to be thrown into Gehenna,where their worm does not die, and the fire is not quenched. \"Everyone will be salted with fire.Salt is good, but if salt becomes insipid,with what will you restore its flavor?Keep salt in yourselves and you will have peace with one another.\""
            }
          },
          "saint_of_day": {
            "name": "Optional Memorial of Saint Gregory of Narek, Abbot and Doctor of the Church",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-02-28": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:20:29.341Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-02-28": {
          "date": "2025-02-28",
          "liturgical_date": "Friday of the Seventh Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Sirach 6:5-17",
              "content": "A kind mouth multiplies friends and appeases enemies,and gracious lips prompt friendly greetings.Let your acquaintances be many,but one in a thousand your confidant.When you gain a friend, first test him,and be not too ready to trust him.For one sort is a friend when it suits him,but he will not be with you in time of distress.Another is a friend who becomes an enemy,and tells of the quarrel to your shame.Another is a friend, a boon companion,who will not be with you when sorrow comes.When things go well, he is your other self,and lords it over your servants;But if you are brought low, he turns against youand avoids meeting you.Keep away from your enemies;be on your guard with your friends.A faithful friend is a sturdy shelter;he who finds one finds a treasure.A faithful friend is beyond price,no sum can balance his worth.A faithful friend is a life-saving remedy,such as he who fears God finds;For he who fears God behaves accordingly,and his friend will be like himself."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 119:12, 16, 18, 27, 34, 35",
              "response": "R. (35a)  Guide me, Lord, in the way of your commands.Blessed are you, O LORD;teach me your statutes.R. Guide me, Lord, in the way of your commands.In your statutes I will delight;I will not forget your words.R. Guide me, Lord, in the way of your commands.Open my eyes, that I may considerthe wonders of your law.R. Guide me, Lord, in the way of your commands.Make me understand the way of your precepts,and I will meditate on your wondrous deeds.R. Guide me, Lord, in the way of your commands.Give me discernment, that I may observe your lawand keep it with all my heart.R. Guide me, Lord, in the way of your commands.Lead me in the path of your commands,for in it I delight.R. Guide me, Lord, in the way of your commands.",
              "content": ""
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour word, O Lord, is truth;\nconsecrate us in the truth.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Mark 10:1-12",
              "content": "Jesus came into the district of Judea and across the Jordan.Again crowds gathered around him and, as was his custom,he again taught them.The Pharisees approached him and asked,\"Is it lawful for a husband to divorce his wife?\"They were testing him.He said to them in reply, \"What did Moses command you?\"They replied,\"Moses permitted a husband to write a bill of divorceand dismiss her.\"But Jesus told them,\"Because of the hardness of your heartshe wrote you this commandment.But from the beginning of creation, God made them male and female.For this reason a man shall leave his father and motherand be joined to his wife,and the two shall become one flesh.So they are no longer two but one flesh.Therefore what God has joined together,no human being must separate.\"In the house the disciples again questioned Jesus about this.He said to them,“Whoever divorces his wife and marries anothercommits adultery against her;and if she divorces her husband and marries another,she commits adultery.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    }
  }
}