{
  "meta": {
    "version": "1.0",
    "month": 9,
    "month_name": "september",
    "year": 2025,
    "total_days": 30
  },
  "daily_readings": {
    "2025-09-01": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.047Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-01": {
          "date": "2025-09-01",
          "liturgical_date": "Monday of the Twenty-second Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 4:13-18",
              "content": "We do not want you to be unaware, brothers and sisters,\nabout those who have fallen asleep,\nso that you may not grieve like the rest, who have no hope.\nFor if we believe that Jesus died and rose,\nso too will God, through Jesus,\nbring with him those who have fallen asleep.\nIndeed, we tell you this, on the word of the Lord,\nthat we who are alive, who are left until the coming of the Lord,\nwill surely not precede those who have fallen asleep.\nFor the Lord himself, with a word of command,\nwith the voice of an archangel and with the trumpet of God,\nwill come down from heaven,\nand the dead in Christ will rise first.\nThen we who are alive, who are left,\nwill be caught up together with them in the clouds\nto meet the Lord in the air.\nThus we shall always be with the Lord.\nTherefore, console one another with these words."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 96:1 and 3, 4-5, 11-12, 13",
              "response": "R. (13b) The Lord comes to judge the earth.",
              "content": "Sing to the LORD a new song;\n\nsing to the LORD, all you lands.\n\nTell his glory among the nations;\n\namong all peoples, his wondrous deeds.\n\nR. The Lord comes to judge the earth.\n\nFor great is the LORD and highly to be praised;\n\nawesome is he, beyond all gods.\n\nFor all the gods of the nations are things of nought,\n\nbut the LORD made the heavens.\n\nR. The Lord comes to judge the earth.\n\nLet the heavens be glad and the earth rejoice;\n\nlet the sea and what fills it resound;\n\nlet the plains be joyful and all that is in them!\n\nThen shall all the trees of the forest exult.\n\nR. The Lord comes to judge the earth.\n\nBefore the LORD, for he comes;\n\nfor he comes to rule the earth.\n\nHe shall rule the world with justice\n\nand the peoples with his constancy.\n\nR. The Lord comes to judge the earth."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Spirit of the Lord is upon me;\nhe has sent me to bring glad tidings to the poor.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 4:16-30",
              "content": "Jesus came to Nazareth, where he had grown up,\nand went according to his custom\ninto the synagogue on the sabbath day.\nHe stood up to read and was handed a scroll of the prophet Isaiah.\nHe unrolled the scroll and found the passage where it was written:\n\nThe Spirit of the Lord is upon me,\nbecause he has anointed me\nto bring glad tidings to the poor.\nHe has sent me to proclaim liberty to captives\nand recovery of sight to the blind,\nto let the oppressed go free,\nand to proclaim a year acceptable to the Lord.\n\nRolling up the scroll,\nhe handed it back to the attendant and sat down,\nand the eyes of all in the synagogue looked intently at him.\nHe said to them,\n\"Today this Scripture passage is fulfilled in your hearing.\"\nAnd all spoke highly of him\nand were amazed at the gracious words that came from his mouth.\nThey also asked, \"Is this not the son of Joseph?\"\nHe said to them, \"Surely you will quote me this proverb,\n'Physician, cure yourself,' and say, 'Do here in your native place\nthe things that we heard were done in Capernaum.'\"\nAnd he said,\n\"Amen, I say to you, no prophet is accepted in his own native place.\nIndeed, I tell you,\nthere were many widows in Israel in the days of Elijah\nwhen the sky was closed for three and a half years\nand a severe famine spread over the entire land.\nIt was to none of these that Elijah was sent,\nbut only to a widow in Zarephath in the land of Sidon.\nAgain, there were many lepers in Israel\nduring the time of Elisha the prophet;\nyet not one of them was cleansed, but only Naaman the Syrian.\"\nWhen the people in the synagogue heard this,\nthey were all filled with fury.\nThey rose up, drove him out of the town,\nand led him to the brow of the hill\non which their town had been built, to hurl him down headlong.\nBut he passed through the midst of them and went away."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-02": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.384Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-02": {
          "date": "2025-09-02",
          "liturgical_date": "Tuesday of the Twenty-second Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Thessalonians 5:1-6, 9-11",
              "content": "Concerning times and seasons, brothers and sisters,\nyou have no need for anything to be written to you.\nFor you yourselves know very well\nthat the day of the Lord will come like a thief at night.\nWhen people are saying, \"Peace and security,\"\nthen sudden disaster comes upon them,\nlike labor pains upon a pregnant woman,\nand they will not escape.\n\nBut you, brothers and sisters, are not in darkness,\nfor that day to overtake you like a thief.\nFor all of you are children of the light\nand children of the day.\nWe are not of the night or of darkness.\nTherefore, let us not sleep as the rest do,\nbut let us stay alert and sober.\nFor God did not destine us for wrath,\nbut to gain salvation through our Lord Jesus Christ,\nwho died for us, so that whether we are awake or asleep\nwe may live together with him.\nTherefore, encourage one another and build one another up,\nas indeed you do."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 27:1, 4, 13-14",
              "response": "R. (13) I believe that I shall see the good things of the Lord in the land of the living.",
              "content": "The LORD is my light and my salvation;\n\nwhom should I fear?\n\nThe LORD is my life's refuge;\n\nof whom should I be afraid?\n\nR. I believe that I shall see the good things of the Lord in the land of the living.\n\nOne thing I ask of the LORD;\n\nthis I seek:\n\nTo dwell in the house of the LORD\n\nall the days of my life,\n\nThat I may gaze on the loveliness of the LORD\n\nand contemplate his temple.\n\nR. I believe that I shall see the good things of the Lord in the land of the living.\n\nI believe that I shall see the bounty of the LORD\n\nin the land of the living.\n\nWait for the LORD with courage;\n\nbe stouthearted, and wait for the LORD.\n\nR. I believe that I shall see the good things of the Lord in the land of the living."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nA great prophet has arisen in our midst\nand God has visited his people.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 4:31-37",
              "content": "Jesus went down to Capernaum, a town of Galilee.\nHe taught them on the sabbath,\nand they were astonished at his teaching\nbecause he spoke with authority.\nIn the synagogue there was a man with the spirit of an unclean demon,\nand he cried out in a loud voice,\n\"What have you to do with us, Jesus of Nazareth?\nHave you come to destroy us?\nI know who you are–the Holy One of God!\"\nJesus rebuked him and said, \"Be quiet! Come out of him!\"\nThen the demon threw the man down in front of them\nand came out of him without doing him any harm.\nThey were all amazed and said to one another,\n\"What is there about his word?\nFor with authority and power he commands the unclean spirits,\nand they come out.\"\nAnd news of him spread everywhere in the surrounding region."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-03": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.529Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-03": {
          "date": "2025-09-03",
          "liturgical_date": "Memorial of Saint Gregory the Great, Pope and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 1:1-8",
              "content": "Paul, an Apostle of Christ Jesus by the will of God,\nand Timothy our brother,\nto the holy ones and faithful brothers and sisters in Christ in Colossae:\ngrace to you and peace from God our Father.\n\nWe always give thanks to God, the Father of our Lord Jesus Christ,\nwhen we pray for you,\nfor we have heard of your faith in Christ Jesus\nand the love that you have for all the holy ones\nbecause of the hope reserved for you in heaven.\nOf this you have already heard\nthrough the word of truth, the Gospel, that has come to you.\nJust as in the whole world it is bearing fruit and growing,\nso also among you,\nfrom the day you heard it and came to know the grace of God in truth,\nas you learned it from Epaphras our beloved fellow slave,\nwho is a trustworthy minister of Christ on your behalf\nand who also told us of your love in the Spirit."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 52:10, 11",
              "response": "R. (10) I trust in the mercy of God for ever.",
              "content": "I, like a green olive tree\n\nin the house of God,\n\nTrust in the mercy of God\n\nforever and ever.\n\nR. I trust in the mercy of God for ever.\n\nI will thank you always for what you have done,\n\nand proclaim the goodness of your name\n\nbefore your faithful ones.\n\nR. I trust in the mercy of God for ever."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Lord sent me to bring glad tidings to the poor\nand to proclaim liberty to captives.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 4:38-44",
              "content": "After Jesus left the synagogue, he entered the house of Simon.\nSimon's mother-in-law was afflicted with a severe fever,\nand they interceded with him about her.\nHe stood over her, rebuked the fever, and it left her.\nShe got up immediately and waited on them.\n\nAt sunset, all who had people sick with various diseases brought them to him.\nHe laid his hands on each of them and cured them.\nAnd demons also came out from many, shouting, \"You are the Son of God.\"\nBut he rebuked them and did not allow them to speak\nbecause they knew that he was the Christ.\n\nAt daybreak, Jesus left and went to a deserted place.\nThe crowds went looking for him, and when they came to him,\nthey tried to prevent him from leaving them.\nBut he said to them, \"To the other towns also\nI must proclaim the good news of the Kingdom of God,\nbecause for this purpose I have been sent.\"\nAnd he was preaching in the synagogues of Judea."
            }
          },
          "saint_of_day": {
            "name": "Gregory",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-04": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.394Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-04": {
          "date": "2025-09-04",
          "liturgical_date": "Thursday of the Twenty-second Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 1:9-14",
              "content": "Brothers and sisters:\nFrom the day we heard about you, we do not cease praying for you\nand asking that you may be filled with the knowledge of God's will\nthrough all spiritual wisdom and understanding\nto walk in a manner worthy of the Lord,\nso as to be fully pleasing, in every good work bearing fruit\nand growing in the knowledge of God,\nstrengthened with every power, in accord with his glorious might,\nfor all endurance and patience,\nwith joy giving thanks to the Father, who has made you fit to share\nin the inheritance of the holy ones in light.\nHe delivered us from the power of darkness\nand transferred us to the Kingdom of his beloved Son,\nin whom we have redemption, the forgiveness of sins."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 98:2-3ab, 3cd-4, 5-6",
              "response": "R. (2) The Lord has made known his salvation.",
              "content": "The LORD has made his salvation known:\n\nin the sight of the nations he has revealed his justice.\n\nHe has remembered his kindness and his faithfulness\n\ntoward the house of Israel.\n\nR. The Lord has made known his salvation.\n\nAll the ends of the earth have seen\n\nthe salvation by our God.\n\nSing joyfully to the LORD, all you lands;\n\nbreak into song; sing praise.\n\nR. The Lord has made known his salvation.\n\nSing praise to the LORD with the harp,\n\nwith the harp and melodious song.\n\nWith trumpets and the sound of the horn\n\nsing joyfully before the King, the LORD.\n\nR. The Lord has made known his salvation."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nCome after me, says the Lord,\nand I will make you fishers of men.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 5:1-11",
              "content": "While the crowd was pressing in on Jesus and listening to the word of God,\nhe was standing by the Lake of Gennesaret.\nHe saw two boats there alongside the lake;\nthe fishermen had disembarked and were washing their nets.\nGetting into one of the boats, the one belonging to Simon,\nhe asked him to put out a short distance from the shore.\nThen he sat down and taught the crowds from the boat.\nAfter he had finished speaking, he said to Simon,\n\"Put out into deep water and lower your nets for a catch.\"\nSimon said in reply,\n\"Master, we have worked hard all night and have caught nothing,\nbut at your command I will lower the nets.\"\nWhen they had done this, they caught a great number of fish\nand their nets were tearing.\nThey signaled to their partners in the other boat\nto come to help them.\nThey came and filled both boats\nso that the boats were in danger of sinking.\nWhen Simon Peter saw this, he fell at the knees of Jesus and said,\n\"Depart from me, Lord, for I am a sinful man.\"\nFor astonishment at the catch of fish they had made seized him\nand all those with him,\nand likewise James and John, the sons of Zebedee,\nwho were partners of Simon.\nJesus said to Simon, \"Do not be afraid;\nfrom now on you will be catching men.\"\nWhen they brought their boats to the shore,\nthey left everything and followed him."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-05": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.517Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-05": {
          "date": "2025-09-05",
          "liturgical_date": "Friday of the Twenty-second Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 1:15-20",
              "content": "Brothers and sisters:\nChrist Jesus is the image of the invisible God,\nthe firstborn of all creation.\nFor in him were created all things in heaven and on earth,\nthe visible and the invisible,\nwhether thrones or dominions or principalities or powers;\nall things were created through him and for him.\nHe is before all things,\nand in him all things hold together.\nHe is the head of the Body, the Church.\nHe is the beginning, the firstborn from the dead,\nthat in all things he himself might be preeminent.\nFor in him all the fullness was pleased to dwell,\nand through him to reconcile all things for him,\nmaking peace by the Blood of his cross\nthrough him, whether those on earth or those in heaven."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 100:1b-2, 3, 4, 5",
              "response": "R. (2b) Come with joy into the presence of the Lord.",
              "content": "Sing joyfully to the LORD, all you lands;\n\nserve the LORD with gladness;\n\ncome before him with joyful song.\n\nR. Come with joy into the presence of the Lord.\n\nKnow that the LORD is God;\n\nhe made us, his we are;\n\nhis people, the flock he tends.\n\nR. Come with joy into the presence of the Lord.\n\nEnter his gates with thanksgiving,\n\nhis courts with praise;\n\nGive thanks to him; bless his name.\n\nR. Come with joy into the presence of the Lord.\n\nFor he is good,\n\nthe LORD, whose kindness endures forever,\n\nand his faithfulness, to all generations.\n\nR. Come with joy into the presence of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the light of the world, says the Lord;\nwhoever follows me will have the light of life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 5:33-39",
              "content": "The scribes and Pharisees said to Jesus,\n\"The disciples of John the Baptist fast often and offer prayers,\nand the disciples of the Pharisees do the same;\nbut yours eat and drink.\"\nJesus answered them, \"Can you make the wedding guests fast\nwhile the bridegroom is with them?\nBut the days will come, and when the bridegroom is taken away from them,\nthen they will fast in those days.\"\nAnd he also told them a parable.\n\"No one tears a piece from a new cloak to patch an old one.\nOtherwise, he will tear the new\nand the piece from it will not match the old cloak.\nLikewise, no one pours new wine into old wineskins.\nOtherwise, the new wine will burst the skins,\nand it will be spilled, and the skins will be ruined.\nRather, new wine must be poured into fresh wineskins.\nAnd no one who has been drinking old wine desires new,\nfor he says, 'The old is good.'\""
            }
          },
          "saint_of_day": {
            "name": "Saint Teresa Calcutta",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-06": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.484Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-06": {
          "date": "2025-09-06",
          "liturgical_date": "Saturday of the Twenty-second Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 54:3-4, 6 and 8",
              "response": "R.    (6) God himself is my help.",
              "content": "O God, by your name save me,\n\nand by your might defend my cause.\n\nO God, hear my prayer;\n\nhearken to the words of my mouth.\n\nR.    God himself is my help.\n\nBehold, God is my helper;\n\nthe Lord sustains my life.\n\nFreely will I offer you sacrifice;\n\nI will praise your name, O LORD, for its goodness.\n\nR.    God himself is my help."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way and the truth and the life, says the Lord;\nno one comes to the Father except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:1-5",
              "content": "While Jesus was going through a field of grain on a sabbath,\nhis disciples were picking the heads of grain,\nrubbing them in their hands, and eating them.\nSome Pharisees said,\n“Why are you doing what is unlawful on the sabbath?”\nJesus said to them in reply,\n“Have you not read what David did\nwhen he and those who were with him were hungry?\nHow he went into the house of God, took the bread of offering,\nwhich only the priests could lawfully eat,\nate of it, and shared it with his companions?”\nThen he said to them, “The Son of Man is lord of the sabbath.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-07": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.550Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-07": {
          "date": "2025-09-07",
          "liturgical_date": "Twenty-third Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Wisdom 9:13-18b",
              "content": "Who can know God’s counsel,\n or who can conceive what the LORD intends?\n For the deliberations of mortals are timid,\n and unsure are our plans.\n For the corruptible body burdens the soul\n and the earthen shelter weighs down the mind that has many concerns.\n And scarce do we guess the things on earth,\n and what is within our grasp we find with difficulty;\n but when things are in heaven, who can search them out?\n Or who ever knew your counsel, except you had given wisdom\n and sent your holy spirit from on high?\n And thus were the paths of those on earth made straight."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 90:3-4, 5-6, 12-13, 14 and 17",
              "response": "R. (1) In every age, O Lord, you have been our refuge.",
              "content": "You turn man back to dust,\n\nsaying, “Return, O children of men.”\n\nFor a thousand years in your sight\n\nare as yesterday, now that it is past,\n\nor as a watch of the night.\n\nR. In every age, O Lord, you have been our refuge.\n\nYou make an end of them in their sleep;\n\nthe next morning they are like the changing grass,\n\nWhich at dawn springs up anew,\n\nbut by evening wilts and fades.\n\nR. In every age, O Lord, you have been our refuge.\n\nTeach us to number our days aright,\n\nthat we may gain wisdom of heart.\n\nReturn, O LORD! How long?\n\nHave pity on your servants!\n\nR. In every age, O Lord, you have been our refuge.\n\nFill us at daybreak with your kindness,\n\nthat we may shout for joy and gladness all our days.\n\nAnd may the gracious care of the LORD our God be ours;\n\nprosper the work of our hands for us!\n\nProsper the work of our hands!\n\nR. In every age, O Lord, you have been our refuge."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nLet your face shine upon your servant;\nand teach me your laws.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 14:25-33",
              "content": "Great crowds were traveling with Jesus,\nand he turned and addressed them,\n“If anyone comes to me without hating his father and mother,\nwife and children, brothers and sisters,\nand even his own life,\nhe cannot be my disciple.\nWhoever does not carry his own cross and come after me\ncannot be my disciple.\nWhich of you wishing to construct a tower\ndoes not first sit down and calculate the cost\nto see if there is enough for its completion?\nOtherwise, after laying the foundation\nand finding himself unable to finish the work\nthe onlookers should laugh at him and say,\n‘This one began to build but did not have the resources to finish.’\nOr what king marching into battle would not first sit down\nand decide whether with ten thousand troops\nhe can successfully oppose another king\nadvancing upon him with twenty thousand troops?\nBut if not, while he is still far away,\nhe will send a delegation to ask for peace terms.\nIn the same way,\nanyone of you who does not renounce all his possessions\ncannot be my disciple.”"
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-08": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:48.544Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-08": {
          "date": "2025-09-08",
          "liturgical_date": "Feast of the Nativity of the Blessed Virgin Mary",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Micah 5:1-4a",
              "content": "The LORD says:\nYou, Bethlehem-Ephrathah,\ntoo small to be among the clans of Judah,\nFrom you shall come forth for me\none who is to be ruler in Israel;\nWhose origin is from of old,\nfrom ancient times.\n(Therefore the Lord will give them up, until the time\nwhen she who is to give birth has borne,\nAnd the rest of his brethren shall return\nto the children of Israel.)\nHe shall stand firm and shepherd his flock\nby the strength of the LORD,\nin the majestic name of the LORD, his God;\nAnd they shall remain, for now his greatness\nshall reach to the ends of the earth;\nhe shall be peace."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 13:6ab, 6c",
              "response": "R. (Isaiah 61:10) With delight I rejoice in the Lord.",
              "content": "Though I trusted in your mercy,\n\nlet my heart rejoice in your salvation.\n\nR. With delight I rejoice in the Lord.\n\nLet me sing of the LORD, \"He has been good to me.\"\n\nR. With delight I rejoice in the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, holy Virgin Mary, deserving of all praise;\nfrom you rose the sun of justice, Christ our God.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Matthew 1:1-16, 18-23",
              "content": "The Book of the genealogy of Jesus Christ,\nthe son of David, the son of Abraham.\n\nAbraham became the father of Isaac,\nIsaac the father of Jacob,\nJacob the father of Judah and his brothers.\nJudah became the father of Perez and Zerah,\nwhose mother was Tamar.\nPerez became the father of Hezron,\nHezron the father of Ram,\nRam the father of Amminadab.\nAmminadab became the father of Nahshon,\nNahshon the father of Salmon,\nSalmon the father of Boaz,\nwhose mother was Rahab.\nBoaz became the father of Obed,\nwhose mother was Ruth.\nObed became the father of Jesse,\nJesse the father of David the king.\n\nDavid became the father of Solomon,\nwhose mother had been the wife of Uriah.\nSolomon became the father of Rehoboam,\nRehoboam the father of Abijah,\nAbijah the father of Asaph.\nAsaph became the father of Jehoshaphat,\nJehoshaphat the father of Joram,\nJoram the father of Uzziah.\nUzziah became the father of Jotham,\nJotham the father of Ahaz,\nAhaz the father of Hezekiah.\nHezekiah became the father of Manasseh,\nManasseh the father of Amos,\nAmos the father of Josiah.\nJosiah became the father of Jechoniah and his brothers\nat the time of the Babylonian exile.\n\nAfter the Babylonian exile,\nJechoniah became the father of Shealtiel,\nShealtiel the father of Zerubbabel,\nZerubbabel the father of Abiud.\nAbiud became the father of Eliakim,\nEliakim the father of Azor,\nAzor the father of Zadok.\nZadok became the father of Achim,\nAchim the father of Eliud,\nEliud the father of Eleazar.\nEleazar became the father of Matthan,\nMatthan the father of Jacob,\nJacob the father of Joseph, the husband of Mary.\nOf her was born Jesus who is called the Christ.\n\nNow this is how the birth of Jesus Christ came about.\nWhen his mother Mary was betrothed to Joseph,\nbut before they lived together,\nshe was found with child through the Holy Spirit.\nJoseph her husband, since he was a righteous man,\nyet unwilling to expose her to shame,\ndecided to divorce her quietly.\nSuch was his intention when, behold,\nthe angel of the Lord appeared to him in a dream and said,\n\"Joseph, son of David,\ndo not be afraid to take Mary your wife into your home.\nFor it is through the Holy Spirit\nthat this child has been conceived in her.\nShe will bear a son and you are to name him Jesus,\nbecause he will save his people from their sins.\"\nAll this took place to fulfill\nwhat the Lord had said through the prophet:\n\nBehold, the virgin shall be with child and bear a son,\nand they shall name him Emmanuel,\n\nwhich means \"God is with us.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-09": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.438Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-09": {
          "date": "2025-09-09",
          "liturgical_date": "Memorial of Saint Peter Claver, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 2:6-15",
              "content": "Brothers and sisters:\nAs you received Christ Jesus the Lord, walk in him,\nrooted in him and built upon him\nand established in the faith as you were taught,\nabounding in thanksgiving.\nSee to it that no one captivate you with an empty, seductive philosophy\naccording to the tradition of men,\naccording to the elemental powers of the world\nand not according to Christ.\n\nFor in him dwells the whole fullness of the deity bodily,\nand you share in this fullness in him,\nwho is the head of every principality and power.\nIn him you were also circumcised\nwith a circumcision not administered by hand,\nby stripping off the carnal body, with the circumcision of Christ.\nYou were buried with him in baptism,\nin which you were also raised with him\nthrough faith in the power of God,\nwho raised him from the dead.\nAnd even when you were dead in transgressions\nand the uncircumcision of your flesh,\nhe brought you to life along with him,\nhaving forgiven us all our transgressions;\nobliterating the bond against us, with its legal claims,\nwhich was opposed to us,\nhe also removed it from our midst, nailing it to the cross;\ndespoiling the principalities and the powers,\nhe made a public spectacle of them,\nleading them away in triumph by it."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 145:1b-2, 8-9, 10-11",
              "response": "R. (9) The Lord is compassionate toward all his works.",
              "content": "I will extol you, O my God and King,\n\nand I will bless your name forever and ever.\n\nEvery day will I bless you,\n\nand I will praise your name forever and ever.\n\nR. The Lord is compassionate toward all his works.\n\nThe LORD is gracious and merciful,\n\nslow to anger and of great kindness.\n\nThe LORD is good to all\n\nand compassionate toward all his works.\n\nR. The Lord is compassionate toward all his works.\n\nLet all your works give you thanks, O LORD,\n\nand let your faithful ones bless you.\n\nLet them discourse of the glory of your Kingdom\n\nand speak of your might.\n\nR. The Lord is compassionate toward all his works."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI chose you from the world,\nthat you may go and bear fruit that will last, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:12-19",
              "content": "Jesus departed to the mountain to pray,\nand he spent the night in prayer to God.\nWhen day came, he called his disciples to himself,\nand from them he chose Twelve, whom he also named Apostles:\nSimon, whom he named Peter, and his brother Andrew,\nJames, John, Philip, Bartholomew,\nMatthew, Thomas, James the son of Alphaeus,\nSimon who was called a Zealot,\nand Judas the son of James,\nand Judas Iscariot, who became a traitor.\n\nAnd he came down with them and stood on a stretch of level ground.\nA great crowd of his disciples and a large number of the people\nfrom all Judea and Jerusalem\nand the coastal region of Tyre and Sidon\ncame to hear him and to be healed of their diseases;\nand even those who were tormented by unclean spirits were cured.\nEveryone in the crowd sought to touch him\nbecause power came forth from him and healed them all."
            }
          },
          "saint_of_day": {
            "name": "Peter Claver",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-10": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.476Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-10": {
          "date": "2025-09-10",
          "liturgical_date": "Wednesday of the Twenty-third Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 3:1-11",
              "content": "Brothers and sisters:\nIf you were raised with Christ, seek what is above,\nwhere Christ is seated at the right hand of God.\nThink of what is above, not of what is on earth.\nFor you have died, and your life is hidden with Christ in God.\nWhen Christ your life appears,\nthen you too will appear with him in glory.\n\nPut to death, then, the parts of you that are earthly:\nimmorality, impurity, passion, evil desire,\nand the greed that is idolatry.\nBecause of these the wrath of God is coming upon the disobedient.\nBy these you too once conducted yourselves, when you lived in that way.\nBut now you must put them all away:\nanger, fury, malice, slander,\nand obscene language out of your mouths.\nStop lying to one another,\nsince you have taken off the old self with its practices\nand have put on the new self,\nwhich is being renewed, for knowledge,\nin the image of its creator.\nHere there is not Greek and Jew,\ncircumcision and uncircumcision,\nbarbarian, Scythian, slave, free;\nbut Christ is all and in all."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 145:2-3, 10-11, 12-13ab",
              "response": "R. (9) The Lord is compassionate toward all his works.",
              "content": "Every day will I bless you,\n\nand I will praise your name forever and ever.\n\nGreat is the LORD and highly to be praised;\n\nhis greatness is unsearchable.\n\nR. The Lord is compassionate toward all his works.\n\nLet all your works give you thanks, O LORD,\n\nand let your faithful ones bless you.\n\nLet them discourse of the glory of your Kingdom\n\nand speak of your might.\n\nR. The Lord is compassionate toward all his works.\n\nMaking known to men your might\n\nand the glorious splendor of your Kingdom.\n\nYour Kingdom is a Kingdom for all ages,\n\nand your dominion endures through all generations.\n\nR. The Lord is compassionate toward all his works."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nRejoice and leap for joy!\nYour reward will be great in heaven.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:20-26",
              "content": "Raising his eyes toward his disciples Jesus said:\n\n\"Blessed are you who are poor,\nfor the Kingdom of God is yours.\nBlessed are you who are now hungry,\nfor you will be satisfied.\nBlessed are you who are now weeping,\nfor you will laugh.\nBlessed are you when people hate you,\nand when they exclude and insult you,\nand denounce your name as evil\non account of the Son of Man.\n\n\"Rejoice and leap for joy on that day!\nBehold, your reward will be great in heaven.\nFor their ancestors treated the prophets\nin the same way.\nBut woe to you who are rich,\nfor you have received your consolation.\nBut woe to you who are filled now,\nfor you will be hungry.\nWoe to you who laugh now,\nfor you will grieve and weep.\nWoe to you when all speak well of you,\nfor their ancestors treated the false prophets in this way.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-11": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.387Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-11": {
          "date": "2025-09-11",
          "liturgical_date": "Thursday of the Twenty-third Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Colossians 3:12-17",
              "content": "Brothers and sisters:\nPut on, as God’s chosen ones, holy and beloved,\nheartfelt compassion, kindness, humility, gentleness, and patience,\nbearing with one another and forgiving one another,\nif one has a grievance against another;\nas the Lord has forgiven you, so must you also do.\nAnd over all these put on love,\nthat is, the bond of perfection.\nAnd let the peace of Christ control your hearts,\nthe peace into which you were also called in one Body.\nAnd be thankful.\nLet the word of Christ dwell in you richly,\nas in all wisdom you teach and admonish one another,\nsinging psalms, hymns, and spiritual songs\nwith gratitude in your hearts to God.\nAnd whatever you do, in word or in deed,\ndo everything in the name of the Lord Jesus,\ngiving thanks to God the Father through him."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 150:1b-2, 3-4, 5-6",
              "response": "R.(6) Let everything that breathes praise the Lord!",
              "content": "Praise the LORD in his sanctuary,\n\npraise him in the firmament of his strength.\n\nPraise him for his mighty deeds,\n\npraise him for his sovereign majesty.\n\nR. Let everything that breathes praise the Lord!\n\nPraise him with the blast of the trumpet,\n\npraise him with lyre and harp,\n\nPraise him with timbrel and dance,\n\npraise him with strings and pipe.\n\nR. Let everything that breathes praise the Lord!\n\nPraise him with sounding cymbals,\n\npraise him with clanging cymbals.\n\nLet everything that has breath\n\npraise the LORD! Alleluia.\n\nR. Let everything that breathes praise the Lord!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nIf we love one another,\nGod remains in us,\nand his love is brought to perfection in us.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:27-38",
              "content": "Jesus said to his disciples:\n\"To you who hear I say, love your enemies,\ndo good to those who hate you, bless those who curse you,\npray for those who mistreat you.\nTo the person who strikes you on one cheek,\noffer the other one as well,\nand from the person who takes your cloak,\ndo not withhold even your tunic.\nGive to everyone who asks of you,\nand from the one who takes what is yours do not demand it back.\nDo to others as you would have them do to you.\nFor if you love those who love you,\nwhat credit is that to you?\nEven sinners love those who love them.\nAnd if you do good to those who do good to you,\nwhat credit is that to you?\nEven sinners do the same.\nIf you lend money to those from whom you expect repayment,\nwhat credit is that to you?\nEven sinners lend to sinners,\nand get back the same amount.\nBut rather, love your enemies and do good to them,\nand lend expecting nothing back;\nthen your reward will be great\nand you will be children of the Most High,\nfor he himself is kind to the ungrateful and the wicked.\nBe merciful, just as also your Father is merciful.\n\n\"Stop judging and you will not be judged.\nStop condemning and you will not be condemned.\nForgive and you will be forgiven.\nGive and gifts will be given to you;\na good measure, packed together, shaken down, and overflowing,\nwill be poured into your lap.\nFor the measure with which you measure\nwill in return be measured out to you.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-12": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.286Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-12": {
          "date": "2025-09-12",
          "liturgical_date": "Friday of the Twenty-third Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 16:1b-2a and 5, 7-8, 11",
              "response": "R.    (see 5) You are my inheritance, O Lord.",
              "content": "Keep me, O God, for in you I take refuge;\n\nI say to the LORD, “My Lord are you.”\n\nO LORD, my allotted portion and my cup,\n\nyou it is who hold fast my lot.\n\nR.    You are my inheritance, O Lord.\n\nI bless the LORD who counsels me;\n\neven in the night my heart exhorts me.\n\nI set the LORD ever before me;\n\nwith him at my right hand I shall not be disturbed.\n\nR.    You are my inheritance, O Lord.\n\nYou will show me the path to life,\n\nfullness of joys in your presence,\n\nthe delights at your right hand forever.\n\nR.    You are my inheritance, O Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour word, O Lord, is truth;\nconsecrate us in the truth.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:39-42",
              "content": "Jesus told his disciples a parable:\n“Can a blind person guide a blind person?\nWill not both fall into a pit?\nNo disciple is superior to the teacher;\nbut when fully trained,\nevery disciple will be like his teacher.\nWhy do you notice the splinter in your brother’s eye,\nbut do not perceive the wooden beam in your own?\nHow can you say to your brother,\n‘Brother, let me remove that splinter in your eye,’\nwhen you do not even notice the wooden beam in your own eye?\nYou hypocrite!  Remove the wooden beam from your eye first;\nthen you will see clearly\nto remove the splinter in your brother’s eye.”"
            }
          },
          "saint_of_day": {
            "name": "Most Holy Name Mary",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-13": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.566Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-13": {
          "date": "2025-09-13",
          "liturgical_date": "Memorial of Saint John Chrysostom, Bishop and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 1:15-17",
              "content": "Beloved:\nThis saying is trustworthy and deserves full acceptance:\nChrist Jesus came into the world to save sinners.\nOf these I am the foremost.\nBut for that reason I was mercifully treated,\nso that in me, as the foremost,\nChrist Jesus might display all his patience as an example\nfor those who would come to believe in him for everlasting life.\nTo the king of ages, incorruptible, invisible, the only God,\nhonor and glory forever and ever. Amen."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 113:1b-2, 3-4, 5 and 6-7",
              "response": "R. (2) Blessed be the name of the Lord for ever.",
              "content": "Praise, you servants of the LORD,\n\npraise the name of the LORD.\n\nBlessed be the name of the LORD\n\nboth now and forever.\n\nR. Blessed be the name of the Lord for ever.\n\nFrom the rising to the setting of the sun\n\nis the name of the LORD to be praised.\n\nHigh above all nations is the LORD;\n\nabove the heavens is his glory.\n\nR. Blessed be the name of the Lord for ever.\n\nWho is like the LORD, our God,\n\nand looks upon the heavens and the earth below?\n\nHe raises up the lowly from the dust;\n\nfrom the dunghill he lifts up the poor.\n\nR. Blessed be the name of the Lord for ever."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWhoever loves me will keep my word,\nand my Father will love him,\nand we will come to him.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 6:43-49",
              "content": "Jesus said to his disciples:\n\"A good tree does not bear rotten fruit,\nnor does a rotten tree bear good fruit.\nFor every tree is known by its own fruit.\nFor people do not pick figs from thornbushes,\nnor do they gather grapes from brambles.\nA good person out of the store of goodness in his heart produces good,\nbut an evil person out of a store of evil produces evil;\nfor from the fullness of the heart the mouth speaks.\n\n\"Why do you call me, 'Lord, Lord,' but not do what I command?\nI will show you what someone is like who comes to me,\nlistens to my words, and acts on them.\nThat one is like a man building a house,\nwho dug deeply and laid the foundation on rock;\nwhen the flood came, the river burst against that house\nbut could not shake it because it had been well built.\nBut the one who listens and does not act\nis like a person who built a house on the ground\nwithout a foundation.\nWhen the river burst against it,\nit collapsed at once and was completely destroyed.\""
            }
          },
          "saint_of_day": {
            "name": "John Chrysostom",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-14": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.465Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-14": {
          "date": "2025-09-14",
          "liturgical_date": "Feast of the Exaltation of the Holy Cross",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Numbers 21:4b-9",
              "content": "With their patience worn out by the journey,\nthe people complained against God and Moses,\n\"Why have you brought us up from Egypt to die in this desert,\nwhere there is no food or water?\nWe are disgusted with this wretched food!\"\n\nIn punishment the LORD sent among the people saraph serpents,\nwhich bit the people so that many of them died.\nThen the people came to Moses and said,\n\"We have sinned in complaining against the LORD and you.\nPray the LORD to take the serpents from us.\"\nSo Moses prayed for the people, and the LORD said to Moses,\n\"Make a saraph and mount it on a pole,\nand if any who have been bitten look at it, they will live.\"\nMoses accordingly made a bronze serpent and mounted it on a pole,\nand whenever anyone who had been bitten by a serpent\nlooked at the bronze serpent, he lived."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 78:1bc-2, 34-35, 36-37, 38",
              "response": "R. (see 7b) Do not forget the works of the Lord!",
              "content": "Hearken, my people, to my teaching;\n\nincline your ears to the words of my mouth.\n\nI will open my mouth in a parable,\n\nI will utter mysteries from of old.\n\nR. Do not forget the works of the Lord!\n\nWhile he slew them they sought him\n\nand inquired after God again,\n\nRemembering that God was their rock\n\nand the Most High God, their redeemer.\n\nR. Do not forget the works of the Lord!\n\nBut they flattered him with their mouths\n\nand lied to him with their tongues,\n\nThough their hearts were not steadfast toward him,\n\nnor were they faithful to his covenant.\n\nR. Do not forget the works of the Lord!\n\nBut he, being merciful, forgave their sin\n\nand destroyed them not;\n\nOften he turned back his anger\n\nand let none of his wrath be roused.\n\nR. Do not forget the works of the Lord!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nWe adore you, O Christ, and we bless you,\nbecause by your Cross you have redeemed the world.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 3:13-17",
              "content": "Jesus said to Nicodemus:\n\"No one has gone up to heaven\nexcept the one who has come down from heaven, the Son of Man.\nAnd just as Moses lifted up the serpent in the desert,\nso must the Son of Man be lifted up,\nso that everyone who believes in him may have eternal life.\"\n\nFor God so loved the world that he gave his only Son,\nso that everyone who believes in him might not perish\nbut might have eternal life.\nFor God did not send his Son into the world to condemn the world,\nbut that the world might be saved through him."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-15": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.476Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-15": {
          "date": "2025-09-15",
          "liturgical_date": "Memorial of Our Lady of Sorrows",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 2:1-8",
              "content": "Beloved:\nFirst of all, I ask that supplications, prayers,\npetitions, and thanksgivings be offered for everyone,\nfor kings and for all in authority,\nthat we may lead a quiet and tranquil life\nin all devotion and dignity.\nThis is good and pleasing to God our savior,\nwho wills everyone to be saved\nand to come to knowledge of the truth.\n\nFor there is one God.\nThere is also one mediator between God and men,\nthe man Christ Jesus,\nwho gave himself as ransom for all.\n\nThis was the testimony at the proper time.\nFor this I was appointed preacher and Apostle\n(I am speaking the truth, I am not lying),\nteacher of the Gentiles in faith and truth.\n\nIt is my wish, then, that in every place the men should pray,\nlifting up holy hands, without anger or argument."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 28:2, 7, 8-9",
              "response": "R. (6) Blessed be the Lord, for he has heard my prayer.",
              "content": "Hear the sound of my pleading, when I cry to you,\n\nlifting up my hands toward your holy shrine.\n\nR. Blessed be the Lord, for he has heard my prayer.\n\nThe LORD is my strength and my shield.\n\nIn him my heart trusts, and I find help;\n\nthen my heart exults, and with my song I give him thanks.\n\nR. Blessed be the Lord, for he has heard my prayer.\n\nThe LORD is the strength of his people,\n\nthe saving refuge of his anointed.\n\nSave your people, and bless your inheritance;\n\nfeed them, and carry them forever!\n\nR. Blessed be the Lord, for he has heard my prayer."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, O Virgin Mary;\nwithout dying you won the martyr's crown\nbeneath the Cross of the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 19:25-27",
              "content": "Standing by the cross of Jesus were his mother\nand his mother's sister, Mary the wife of Clopas,\nand Mary Magdalene.\nWhen Jesus saw his mother and the disciple there whom he loved\nhe said to his mother, \"Woman, behold, your son.\"\nThen he said to the disciple,\n\"Behold, your mother.\"\nAnd from that hour the disciple took her into his home."
            }
          },
          "saint_of_day": {
            "name": "Our Lady Sorrows",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-16": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.112Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-16": {
          "date": "2025-09-16",
          "liturgical_date": "Memorial of Saints Cornelius, Pope, and Cyprian, Bishop, Martyrs",
          "liturgical_color": "red",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 3:1-13",
              "content": "Beloved, this saying is trustworthy:\nwhoever aspires to the office of bishop desires a noble task.\nTherefore, a bishop must be irreproachable,\nmarried only once, temperate, self-controlled,\ndecent, hospitable, able to teach,\nnot a drunkard, not aggressive, but gentle,\nnot contentious, not a lover of money.\nHe must manage his own household well,\nkeeping his children under control with perfect dignity;\nfor if a man does not know how to manage his own household,\nhow can he take care of the Church of God?\nHe should not be a recent convert,\nso that he may not become conceited\nand thus incur the Devil's punishment.\nHe must also have a good reputation among outsiders,\nso that he may not fall into disgrace, the Devil's trap.\n\nSimilarly, deacons must be dignified, not deceitful,\nnot addicted to drink, not greedy for sordid gain,\nholding fast to the mystery of the faith with a clear conscience.\nMoreover, they should be tested first;\nthen, if there is nothing against them,\nlet them serve as deacons.\nWomen, similarly, should be dignified, not slanderers,\nbut temperate and faithful in everything.\nDeacons may be married only once\nand must manage their children and their households well.\nThus those who serve well as deacons gain good standing\nand much confidence in their faith in Christ Jesus."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 101:1b-2ab, 2cd-3ab, 5, 6",
              "response": "R.(2) I will walk with blameless heart.",
              "content": "Of mercy and judgment I will sing;\n\nto you, O LORD, I will sing praise.\n\nI will persevere in the way of integrity;\n\nwhen will you come to me?\n\nR. I will walk with blameless heart.\n\nI will walk with blameless heart,\n\nwithin my house;\n\nI will not set before my eyes\n\nany base thing.\n\nR. I will walk with blameless heart.\n\nWhoever slanders his neighbor in secret,\n\nhim will I destroy.\n\nThe man of haughty eyes and puffed up heart\n\nI will not endure.\n\nR. I will walk with blameless heart.\n\nMy eyes are upon the faithful of the land,\n\nthat they may dwell with me.\n\nHe who walks in the way of integrity\n\nshall be in my service.\n\nR. I will walk with blameless heart."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nA great prophet has arisen in our midst\nand God has visited his people.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 7:11-17",
              "content": "Jesus journeyed to a city called Nain,\nand his disciples and a large crowd accompanied him.\nAs he drew near to the gate of the city,\na man who had died was being carried out,\nthe only son of his mother, and she was a widow.\nA large crowd from the city was with her.\nWhen the Lord saw her,\nhe was moved with pity for her and said to her,\n“Do not weep.”\nHe stepped forward and touched the coffin;\nat this the bearers halted,\nand he said, “Young man, I tell you, arise!”\nThe dead man sat up and began to speak,\nand Jesus gave him to his mother.\nFear seized them all, and they glorified God, exclaiming,\n“A great prophet has arisen in our midst,”\nand “God has visited his people.”\nThis report about him spread through the whole of Judea\nand in all the surrounding region."
            }
          },
          "saint_of_day": {
            "name": "Cornelius Cyprian",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-17": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.618Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-17": {
          "date": "2025-09-17",
          "liturgical_date": "Wednesday of the Twenty-fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 3:14-16",
              "content": "Beloved:\nI am writing you,\nalthough I hope to visit you soon.\nBut if I should be delayed,\nyou should know how to behave in the household of God,\nwhich is the Church of the living God,\nthe pillar and foundation of truth.\nUndeniably great is the mystery of devotion,\n\nWho was manifested in the flesh,\nvindicated in the spirit,\nseen by angels,\nproclaimed to the Gentiles,\nbelieved in throughout the world,\ntaken up in glory."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 111:1-2, 3-4, 5-6",
              "response": "R.(2) How great are the works of the Lord!",
              "content": "I will give thanks to the LORD with all my heart\n\nin the company and assembly of the just.\n\nGreat are the works of the LORD,\n\nexquisite in all their delights.\n\nR. How great are the works of the Lord!\n\nMajesty and glory are his work,\n\nand his justice endures forever.\n\nHe has won renown for his wondrous deeds;\n\ngracious and merciful is the LORD.\n\nR. How great are the works of the Lord!\n\nHe has given food to those who fear him;\n\nhe will forever be mindful of his covenant.\n\nHe has made known to his people the power of his works,\n\ngiving them the inheritance of the nations.\n\nR. How great are the works of the Lord!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life,\nyou have the words of everlasting life.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 7:31-35",
              "content": "Jesus said to the crowds:\n\"To what shall I compare the people of this generation?\nWhat are they like?\nThey are like children who sit in the marketplace and call to one another,\n\n'We played the flute for you, but you did not dance.\nWe sang a dirge, but you did not weep.'\n\nFor John the Baptist came neither eating food nor drinking wine,\nand you said, 'He is possessed by a demon.'\nThe Son of Man came eating and drinking and you said,\n'Look, he is a glutton and a drunkard,\na friend of tax collectors and sinners.'\nBut wisdom is vindicated by all her children.\""
            }
          },
          "saint_of_day": {
            "name": "Optional Memorial of Saint Hildegard of Bingen, Virgin and Doctor of the Church",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-18": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.495Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-18": {
          "date": "2025-09-18",
          "liturgical_date": "Thursday of the Twenty-fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 4:12-16",
              "content": "Beloved:\nLet no one have contempt for your youth,\nbut set an example for those who believe,\nin speech, conduct, love, faith, and purity.\nUntil I arrive, attend to the reading, exhortation, and teaching.\nDo not neglect the gift you have,\nwhich was conferred on you through the prophetic word\nwith the imposition of hands by the presbyterate.\nBe diligent in these matters, be absorbed in them,\nso that your progress may be evident to everyone.\nAttend to yourself and to your teaching;\npersevere in both tasks,\nfor by doing so you will save\nboth yourself and those who listen to you."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 111:7-8, 9, 10",
              "response": "R.(2) How great are the works of the Lord!",
              "content": "The works of his hands are faithful and just;\n\nsure are all his precepts,\n\nReliable forever and ever,\n\nwrought in truth and equity.\n\nR. How great are the works of the Lord!\n\nHe has sent deliverance to his people;\n\nhe has ratified his covenant forever;\n\nholy and awesome is his name.\n\nR. How great are the works of the Lord!\n\nThe fear of the LORD is the beginning of wisdom;\n\nprudent are all who live by it.\n\nHis praise endures forever.\n\nR. How great are the works of the Lord!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nCome to me, all you who labor and are burdened,\nand I will give you rest, says the Lord.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 7:36-50",
              "content": "A certain Pharisee invited Jesus to dine with him,\nand he entered the Pharisee's house and reclined at table.\nNow there was a sinful woman in the city\nwho learned that he was at table in the house of the Pharisee.\nBringing an alabaster flask of ointment,\nshe stood behind him at his feet weeping\nand began to bathe his feet with her tears.\nThen she wiped them with her hair,\nkissed them, and anointed them with the ointment.\nWhen the Pharisee who had invited him saw this he said to himself,\n\"If this man were a prophet,\nhe would know who and what sort of woman this is who is touching him,\nthat she is a sinner.\"\nJesus said to him in reply,\n\"Simon, I have something to say to you.\"\n\"Tell me, teacher,\" he said.\n\"Two people were in debt to a certain creditor;\none owed five hundred days' wages and the other owed fifty.\nSince they were unable to repay the debt, he forgave it for both.\nWhich of them will love him more?\"\nSimon said in reply,\n\"The one, I suppose, whose larger debt was forgiven.\"\nHe said to him, \"You have judged rightly.\"\nThen he turned to the woman and said to Simon,\n\"Do you see this woman?\nWhen I entered your house, you did not give me water for my feet,\nbut she has bathed them with her tears\nand wiped them with her hair.\nYou did not give me a kiss,\nbut she has not ceased kissing my feet since the time I entered.\nYou did not anoint my head with oil,\nbut she anointed my feet with ointment.\nSo I tell you, her many sins have been forgiven;\nhence, she has shown great love.\nBut the one to whom little is forgiven, loves little.\"\nHe said to her, \"Your sins are forgiven.\"\nThe others at table said to themselves,\n\"Who is this who even forgives sins?\"\nBut he said to the woman,\n\"Your faith has saved you; go in peace.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-19": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.631Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-19": {
          "date": "2025-09-19",
          "liturgical_date": "Friday of the Twenty-fourth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 1 Timothy 6:2c-12",
              "content": "Beloved:\nTeach and urge these things.\nWhoever teaches something different\nand does not agree with the sound words of our Lord Jesus Christ\nand the religious teaching\nis conceited, understanding nothing,\nand has a morbid disposition for arguments and verbal disputes.\nFrom these come envy, rivalry, insults, evil suspicions,\nand mutual friction among people with corrupted minds,\nwho are deprived of the truth,\nsupposing religion to be a means of gain.\nIndeed, religion with contentment is a great gain.\nFor we brought nothing into the world,\njust as we shall not be able to take anything out of it.\nIf we have food and clothing, we shall be content with that.\nThose who want to be rich are falling into temptation and into a trap\nand into many foolish and harmful desires,\nwhich plunge them into ruin and destruction.\nFor the love of money is the root of all evils,\nand some people in their desire for it have strayed from the faith\nand have pierced themselves with many pains.\n\nBut you, man of God, avoid all this.\nInstead, pursue righteousness, devotion,\nfaith, love, patience, and gentleness.\nCompete well for the faith.\nLay hold of eternal life,\nto which you were called when you made the noble confession\nin the presence of many witnesses."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 49:6-7, 8-10, 17-18, 19-20",
              "response": "R. Blessed the poor in spirit; the Kingdom of heaven is theirs!",
              "content": "Why should I fear in evil days\n\nwhen my wicked ensnarers ring me round?\n\nThey trust in their wealth;\n\nthe abundance of their riches is their boast.\n\nR. Blessed the poor in spirit; the Kingdom of heaven is theirs!\n\nYet in no way can a man redeem himself,\n\nor pay his own ransom to God;\n\nToo high is the price to redeem one's life; he would never have enough\n\nto remain alive always and not see destruction.\n\nR. Blessed the poor in spirit; the Kingdom of heaven is theirs!\n\nFear not when a man grows rich,\n\nwhen the wealth of his house becomes great,\n\nFor when he dies, he shall take none of it;\n\nhis wealth shall not follow him down.\n\nR. Blessed the poor in spirit; the Kingdom of heaven is theirs!\n\nThough in his lifetime he counted himself blessed,\n\n\"They will praise you for doing well for yourself,\"\n\nHe shall join the circle of his forebears\n\nwho shall never more see light.\n\nR. Blessed the poor in spirit; the Kingdom of heaven is theirs!"
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are you, Father, Lord of heaven and earth;\nyou have revealed to little ones the mysteries of the Kingdom.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 8:1-3",
              "content": "Jesus journeyed from one town and village to another,\npreaching and proclaiming the good news of the Kingdom of God.\nAccompanying him were the Twelve\nand some women who had been cured of evil spirits and infirmities,\nMary, called Magdalene, from whom seven demons had gone out,\nJoanna, the wife of Herod's steward Chuza,\nSusanna, and many others\nwho provided for them out of their resources."
            }
          },
          "saint_of_day": {
            "name": "Januarius",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-20": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.654Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-20": {
          "date": "2025-09-20",
          "liturgical_date": "Memorial of Saint Andrew Kim Tae-gŏn, Priest, and Paul Chŏng Ha-sang, and Companions, Martyrs",
          "liturgical_color": "red",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 100:1b-2, 3, 4, 5",
              "response": "R. (2) Come with joy into the presence of the Lord.",
              "content": "Sing joyfully to the LORD all you lands;\n\nserve the LORD with gladness;\n\ncome before him with joyful song.\n\nR. Come with joy into the presence of the Lord.\n\nKnow that the LORD is God;\n\nhe made us, his we are;\n\nhis people, the flock he tends.\n\nR. Come with joy into the presence of the Lord.\n\nEnter his gates with thanksgiving,\n\nhis courts with praise;\n\nGive thanks to him; bless his name.\n\nR. Come with joy into the presence of the Lord.\n\nFor he is good:\n\nthe LORD, whose kindness endures forever,\n\nand his faithfulness, to all generations.\n\nR. Come with joy into the presence of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are they who have kept the word with a generous heart\nand yield a harvest through perseverance.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 8:4-15",
              "content": "When a large crowd gathered, with people from one town after another\njourneying to Jesus, he spoke in a parable. \n“A sower went out to sow his seed.\nAnd as he sowed, some seed fell on the path and was trampled,\nand the birds of the sky ate it up.\nSome seed fell on rocky ground, and when it grew,\nit withered for lack of moisture.\nSome seed fell among thorns,\nand the thorns grew with it and choked it.\nAnd some seed fell on good soil, and when it grew,\nit produced fruit a hundredfold.”\nAfter saying this, he called out,\n“Whoever has ears to hear ought to hear.”\n\nThen his disciples asked him\nwhat the meaning of this parable might be.\nHe answered,\n“Knowledge of the mysteries of the Kingdom of God\nhas been granted to you;\nbut to the rest, they are made known through parables\nso that they may look but not see, and hear but not understand.\n\n“This is the meaning of the parable. \nThe seed is the word of God.\nThose on the path are the ones who have heard,\nbut the Devil comes and takes away the word from their hearts\nthat they may not believe and be saved.\nThose on rocky ground are the ones who, when they hear,\nreceive the word with joy, but they have no root;\nthey believe only for a time and fall away in time of temptation.\nAs for the seed that fell among thorns,\nthey are the ones who have heard, but as they go along,\nthey are choked by the anxieties and riches and pleasures of life, \nand they fail to produce mature fruit.\nBut as for the seed that fell on rich soil,\nthey are the ones who, when they have heard the word,\nembrace it with a generous and good heart,\nand bear fruit through perseverance.”"
            }
          },
          "saint_of_day": {
            "name": "Andrew Kim Taegon",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-21": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.194Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-21": {
          "date": "2025-09-21",
          "liturgical_date": "Twenty-fifth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Amos 8:4-7",
              "content": "Hear this, you who trample upon the needy\n and destroy the poor of the land!\n \"When will the new moon be over,\" you ask,\n \"that we may sell our grain,\n and the sabbath, that we may display the wheat?\n We will diminish the ephah,\n add to the shekel,\n and fix our scales for cheating!\n We will buy the lowly for silver,\n and the poor for a pair of sandals;\n even the refuse of the wheat we will sell!\"\n The LORD has sworn by the pride of Jacob:\n Never will I forget a thing they have done!"
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 113:1-2, 4-6, 7-8",
              "response": "R. (cf. 1a, 7b) Praise the Lord who lifts up the poor.",
              "content": "or:\n\nR. Alleluia.\n\nPraise, you servants of the LORD,\n\npraise the name of the LORD.\n\nBlessed be the name of the LORD\n\nboth now and forever.\n\nR. Praise the Lord who lifts up the poor.\n\nor:\n\nR. Alleluia.\n\nHigh above all nations is the LORD;\n\nabove the heavens is his glory.\n\nWho is like the LORD, our God, who is enthroned on high\n\nand looks upon the heavens and the earth below?\n\nR. Praise the Lord who lifts up the poor.\n\nor:\n\nR. Alleluia.\n\nHe raises up the lowly from the dust;\n\nfrom the dunghill he lifts up the poor\n\nto seat them with princes,\n\nwith the princes of his own people.\n\nR. Praise the Lord who lifts up the poor.\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 16:1-13",
              "content": "Jesus said to his disciples,\n\"A rich man had a steward\nwho was reported to him for squandering his property.\nHe summoned him and said,\n'What is this I hear about you?\nPrepare a full account of your stewardship,\nbecause you can no longer be my steward.'\nThe steward said to himself, 'What shall I do,\nnow that my master is taking the position of steward away from me?\nI am not strong enough to dig and I am ashamed to beg.\nI know what I shall do so that,\nwhen I am removed from the stewardship,\nthey may welcome me into their homes.'\nHe called in his master's debtors one by one.\nTo the first he said,\n'How much do you owe my master?'\nHe replied, 'One hundred measures of olive oil.'\nHe said to him, 'Here is your promissory note.\nSit down and quickly write one for fifty.'\nThen to another the steward said, 'And you, how much do you owe?'\nHe replied, 'One hundred kors of wheat.'\nThe steward said to him, 'Here is your promissory note;\nwrite one for eighty.'\nAnd the master commended that dishonest steward for acting prudently.\n\n\"For the children of this world\nare more prudent in dealing with their own generation\nthan are the children of light.\nI tell you, make friends for yourselves with dishonest wealth,\nso that when it fails, you will be welcomed into eternal dwellings.\nThe person who is trustworthy in very small matters\nis also trustworthy in great ones;\nand the person who is dishonest in very small matters\nis also dishonest in great ones.\nIf, therefore, you are not trustworthy with dishonest wealth,\nwho will trust you with true wealth?\nIf you are not trustworthy with what belongs to another,\nwho will give you what is yours?\nNo servant can serve two masters.\nHe will either hate one and love the other,\nor be devoted to one and despise the other.\nYou cannot serve both God and mammon.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-22": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.249Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-22": {
          "date": "2025-09-22",
          "liturgical_date": "Monday of the Twenty-fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ezra 1:1-6",
              "content": "In the first year of Cyrus, king of Persia,\nin order to fulfill the word of the LORD spoken by Jeremiah,\nthe LORD inspired King Cyrus of Persia\nto issue this proclamation throughout his kingdom,\nboth by word of mouth and in writing:\n\"Thus says Cyrus, king of Persia:\n'All the kingdoms of the earth\nthe LORD, the God of heaven, has given to me,\nand he has also charged me to build him a house in Jerusalem,\nwhich is in Judah.\nTherefore, whoever among you belongs to any part of his people,\nlet him go up, and may his God be with him!\nLet everyone who has survived, in whatever place he may have dwelt,\nbe assisted by the people of that place\nwith silver, gold, goods, and cattle,\ntogether with free-will offerings\nfor the house of God in Jerusalem.'\"\n\nThen the family heads of Judah and Benjamin\nand the priests and Levites–\neveryone, that is, whom God had inspired to do so–\nprepared to go up to build the house of the LORD in Jerusalem.\nAll their neighbors gave them help in every way,\nwith silver, gold, goods, and cattle,\nand with many precious gifts\nbesides all their free-will offerings."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 126:1b-2ab, 2cd-3, 4-5, 6",
              "response": "R. (3) The Lord has done marvels for us.",
              "content": "When the LORD brought back the captives of Zion,\n\nwe were like men dreaming.\n\nThen our mouth was filled with laughter,\n\nand our tongue with rejoicing.\n\nR. The Lord has done marvels for us.\n\nThen they said among the nations,\n\n\"The LORD has done great things for them.\"\n\nThe LORD has done great things for us;\n\nwe are glad indeed.\n\nR. The Lord has done marvels for us.\n\nRestore our fortunes, O LORD,\n\nlike the torrents in the southern desert.\n\nThose that sow in tears\n\nshall reap rejoicing.\n\nR. The Lord has done marvels for us.\n\nAlthough they go forth weeping,\n\ncarrying the seed to be sown,\n\nThey shall come back rejoicing,\n\ncarrying their sheaves.\n\nR. The Lord has done marvels for us."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nLet your light shine before others,\nthat they may see your good deeds and glorify your heavenly Father.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 8:16-18",
              "content": "Jesus said to the crowd:\n\"No one who lights a lamp conceals it with a vessel\nor sets it under a bed;\nrather, he places it on a lampstand\nso that those who enter may see the light.\nFor there is nothing hidden that will not become visible,\nand nothing secret that will not be known and come to light.\nTake care, then, how you hear.\nTo anyone who has, more will be given,\nand from the one who has not,\neven what he seems to have will be taken away.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-23": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.175Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-23": {
          "date": "2025-09-23",
          "liturgical_date": "Memorial of Saint Pius of Pietrelcina, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Ezra 6:7-8, 12b, 14-20",
              "content": "King Darius issued an order to the officials\nof West-of-Euphrates:\n\"Let the governor and the elders of the Jews\ncontinue the work on that house of God;\nthey are to rebuild it on its former site.\nI also issue this decree\nconcerning your dealing with these elders of the Jews\nin the rebuilding of that house of God:\nFrom the royal revenue, the taxes of West-of-Euphrates,\nlet these men be repaid for their expenses, in full and without delay.\nI, Darius, have issued this decree;\nlet it be carefully executed.\"\n\nThe elders of the Jews continued to make progress in the building,\nsupported by the message of the prophets,\nHaggai and Zechariah, son of Iddo.\nThey finished the building according to the command\nof the God of Israel\nand the decrees of Cyrus and Darius\nand of Artaxerxes, king of Persia.\nThey completed this house on the third day of the month Adar,\nin the sixth year of the reign of King Darius.\nThe children of Israel–priests, Levites,\nand the other returned exiles–\ncelebrated the dedication of this house of God with joy.\nFor the dedication of this house of God,\nthey offered one hundred bulls,\ntwo hundred rams, and four hundred lambs,\ntogether with twelve he-goats as a sin-offering for all Israel,\nin keeping with the number of the tribes of Israel.\nFinally, they set up the priests in their classes\nand the Levites in their divisions\nfor the service of God in Jerusalem,\nas is prescribed in the book of Moses.\n\nThe exiles kept the Passover on the fourteenth day of the first month.\nThe Levites, every one of whom had purified himself for the occasion,\nsacrificed the Passover for the rest of the exiles,\nfor their brethren the priests, and for themselves."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 122:1-2, 3-4ab, 4cd-5",
              "response": "R. (1) Let us go rejoicing to the house of the Lord.",
              "content": "I rejoiced because they said to me,\n\n\"We will go up to the house of the LORD.\"\n\nAnd now we have set foot\n\nwithin your gates, O Jerusalem.\n\nR. Let us go rejoicing to the house of the Lord.\n\nJerusalem, built as a city\n\nwith compact unity.\n\nTo it the tribes go up,\n\nthe tribes of the LORD.\n\nR. Let us go rejoicing to the house of the Lord.\n\nAccording to the decree for Israel,\n\nto give thanks to the name of the LORD.\n\nIn it are set up judgment seats,\n\nseats for the house of David.\n\nR. Let us go rejoicing to the house of the Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBlessed are those who hear the word of God\nand observe it.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 8:19-21",
              "content": "The mother of Jesus and his brothers came to him\nbut were unable to join him because of the crowd.\nHe was told, \"Your mother and your brothers are standing outside\nand they wish to see you.\"\nHe said to them in reply, \"My mother and my brothers\nare those who hear the word of God and act on it.\""
            }
          },
          "saint_of_day": {
            "name": "Pius Pietrelcina",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-24": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.246Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-24": {
          "date": "2025-09-24",
          "liturgical_date": "Wednesday of the Twenty-fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Tobit 13:2, 3-4a, 4befghn, 7-8",
              "response": "R.    (1b) Blessed be God, who lives for ever.",
              "content": "He scourges and then has mercy;\n\nhe casts down to the depths of the nether world,\n\nand he brings up from the great abyss.\n\nNo one can escape his hand.\n\nR.    Blessed be God, who lives for ever.\n\nPraise him, you children of Israel, before the Gentiles,\n\nfor though he has scattered you among them,\n\nhe has shown you his greatness even there.\n\nR.    Blessed be God, who lives for ever.\n\nSo now consider what he has done for you,\n\nand praise him with full voice.\n\nBless the Lord of righteousness,\n\nand exalt the King of ages.\n\nR.    Blessed be God, who lives for ever.\n\nIn the land of my exile I praise him\n\nand show his power and majesty to a sinful nation.\n\nR.    Blessed be God, who lives for ever.\n\nBless the Lord, all you his chosen ones,\n\nand may all of you praise his majesty.\n\nCelebrate days of gladness, and give him praise.\n\nR.    Blessed be God, who lives for ever."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Kingdom of God is at hand;\nrepent and believe in the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:1-6",
              "content": "Jesus summoned the Twelve and gave them power and authority\nover all demons and to cure diseases,\nand he sent them to proclaim the Kingdom of God\nand to heal the sick.\nHe said to them, “Take nothing for the journey,\nneither walking stick, nor sack, nor food, nor money,\nand let no one take a second tunic.\nWhatever house you enter, stay there and leave from there.\nAnd as for those who do not welcome you,\nwhen you leave that town,\nshake the dust from your feet in testimony against them.”\nThen they set out and went from village to village\nproclaiming the good news and curing diseases everywhere."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-25": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:49.631Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-25": {
          "date": "2025-09-25",
          "liturgical_date": "Thursday of the Twenty-fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Haggai 1:1-8",
              "content": "On the first day of the sixth month in the second year of King Darius,\nThe word of the LORD came through the prophet Haggai\nto the governor of Judah, Zerubbabel, son of Shealtiel,\nand to the high priest Joshua, son of Jehozadak:\n\nThus says the LORD of hosts:\nThis people says:\n\"The time has not yet come to rebuild the house of the LORD.\"\n(Then this word of the LORD came through Haggai, the prophet:)\nIs it time for you to dwell in your own paneled houses,\nwhile this house lies in ruins?\n\nNow thus says the LORD of hosts:\nConsider your ways!\nYou have sown much, but have brought in little;\nyou have eaten, but have not been satisfied;\nYou have drunk, but have not been exhilarated;\nhave clothed yourselves, but not been warmed;\nAnd whoever earned wages\nearned them for a bag with holes in it.\n\nThus says the LORD of hosts:\nConsider your ways!\nGo up into the hill country;\nbring timber, and build the house\nThat I may take pleasure in it\nand receive my glory, says the LORD."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 149:1b-2, 3-4, 5-6a and 9b",
              "response": "R. (see 4a) The Lord takes delight in his people.",
              "content": "Sing to the LORD a new song\n\nof praise in the assembly of the faithful.\n\nLet Israel be glad in their maker,\n\nlet the children of Zion rejoice in their king.\n\nR. The Lord takes delight in his people.\n\nLet them praise his name in the festive dance,\n\nlet them sing praise to him with timbrel and harp.\n\nFor the LORD loves his people,\n\nand he adorns the lowly with victory.\n\nR. The Lord takes delight in his people.\n\nLet the faithful exult in glory;\n\nlet them sing for joy upon their couches;\n\nLet the high praises of God be in their throats.\n\nThis is the glory of all his faithful. Alleluia.\n\nR. The Lord takes delight in his people."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nI am the way and the truth and the life, says the Lord;\nno one comes to the Father except through me.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:7-9",
              "content": "Herod the tetrarch heard about all that was happening,\nand he was greatly perplexed because some were saying,\n\"John has been raised from the dead\";\nothers were saying, \"Elijah has appeared\";\nstill others, \"One of the ancient prophets has arisen.\"\nBut Herod said, \"John I beheaded.\nWho then is this about whom I hear such things?\"\nAnd he kept trying to see him."
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-26": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.305Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-26": {
          "date": "2025-09-26",
          "liturgical_date": "Friday of the Twenty-fifth Week in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "",
              "content": ""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 43:1, 2, 3, 4",
              "response": "R.    (5) Hope in God; I will praise him, my savior and my God.",
              "content": "Do me justice, O God, and fight my fight\n\nagainst a faithless people;\n\nfrom the deceitful and impious man rescue me.\n\nR.    Hope in God; I will praise him, my savior and my God.\n\nFor you, O God, are my strength.\n\nWhy do you keep me so far away?\n\nWhy must I go about in mourning,\n\nwith the enemy oppressing me?\n\nR.    Hope in God; I will praise him, my savior and my God.\n\nSend forth your light and your fidelity;\n\nthey shall lead me on\n\nAnd bring me to your holy mountain,\n\nto your dwellingplace.\n\nR.    Hope in God; I will praise him, my savior and my God.\n\nThen will I go in to the altar of God,\n\nthe God of my gladness and joy;\n\nThen will I give you thanks upon the harp,\n\nO God, my God!\n\nR.    Hope in God; I will praise him, my savior and my God."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Son of Man came to serve\nand to give his life as a ransom for many.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:18-22",
              "content": "Once when Jesus was praying in solitude,\nand the disciples were with him,\nhe asked them, “Who do the crowds say that I am?”\nThey said in reply, “John the Baptist; others, Elijah;\nstill others, ‘One of the ancient prophets has arisen.’”\nThen he said to them, “But who do you say that I am?”\nPeter said in reply, “The Christ of God.”\nHe rebuked them and directed them not to tell this to anyone.\n\nHe said, “The Son of Man must suffer greatly\nand be rejected by the elders, the chief priests, and the scribes,\nand be killed and on the third day be raised.”"
            }
          },
          "saint_of_day": {
            "name": "Cosmas Damian",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-27": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:27:50.194Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-27": {
          "date": "2025-09-27",
          "liturgical_date": "Memorial of Saint Vincent de Paul, Priest",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Zechariah 2:5-9, 14-15a",
              "content": "I, Zechariah, raised my eyes and looked:\nthere was a man with a measuring line in his hand.\nI asked, \"Where are you going?\"\nHe answered, \"To measure Jerusalem,\nto see how great is its width and how great its length.\"\n\nThen the angel who spoke with me advanced,\nand another angel came out to meet him and said to him,\n\"Run, tell this to that young man:\nPeople will live in Jerusalem as though in open country,\nbecause of the multitude of men and beasts in her midst.\nBut I will be for her an encircling wall of fire, says the LORD,\nand I will be the glory in her midst.\"\n\nSing and rejoice, O daughter Zion!\nSee, I am coming to dwell among you, says the LORD.\nMany nations shall join themselves to the LORD on that day,\nand they shall be his people and he will dwell among you."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Jeremiah 31:10, 11-12ab, 13",
              "response": "R. (see 10d) The Lord will guard us as a shepherd guards his flock.",
              "content": "Hear the word of the LORD, O nations,\n\nproclaim it on distant isles, and say:\n\nHe who scattered Israel, now gathers them together,\n\nhe guards them as a shepherd guards his flock.\n\nR. The Lord will guard us as a shepherd guards his flock.\n\nThe LORD shall ransom Jacob,\n\nhe shall redeem him from the hand of his conqueror.\n\nShouting, they shall mount the heights of Zion,\n\nthey shall come streaming to the LORD's blessings.\n\nR. The Lord will guard us as a shepherd guards his flock.\n\nThen the virgins shall make merry and dance,\n\nand young men and old as well.\n\nI will turn their mourning into joy,\n\nI will console and gladden them after their sorrows.\n\nR. The Lord will guard us as a shepherd guards his flock."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nOur Savior Christ Jesus destroyed death\nand brought life to light through the Gospel.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:43b-45",
              "content": "While they were all amazed at his every deed,\nJesus said to his disciples,\n\"Pay attention to what I am telling you.\nThe Son of Man is to be handed over to men.\"\nBut they did not understand this saying;\nits meaning was hidden from them\nso that they should not understand it,\nand they were afraid to ask him about this saying."
            }
          },
          "saint_of_day": {
            "name": "Vincent De Paul",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-28": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:28:55.447Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-28": {
          "date": "2025-09-28",
          "liturgical_date": "Twenty-sixth Sunday in Ordinary Time",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Amos 6:1a, 4-7",
              "content": "Thus says the LORD the God of hosts:\n Woe to the complacent in Zion!\n Lying upon beds of ivory,\n stretched comfortably on their couches,\n they eat lambs taken from the flock,\n and calves from the stall!\n Improvising to the music of the harp,\n like David, they devise their own accompaniment.\n They drink wine from bowls\n and anoint themselves with the best oils;\n yet they are not made ill by the collapse of Joseph!\n Therefore, now they shall be the first to go into exile,\n and their wanton revelry shall be done away with."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 146:7, 8-9, 9-10",
              "response": "R. (1b) Praise the Lord, my soul!",
              "content": "or:\n\nR. Alleluia.\n\nBlessed is he who keeps faith forever,\n\nsecures justice for the oppressed,\n\ngives food to the hungry.\n\nThe LORD sets captives free.\n\nR. Praise the Lord, my soul!\n\nor:\n\nR. Alleluia.\n\nThe LORD gives sight to the blind;\n\nthe LORD raises up those who were bowed down.\n\nThe LORD loves the just;\n\nthe LORD protects strangers.\n\nR. Praise the Lord, my soul!\n\nor:\n\nR. Alleluia.\n\nThe fatherless and the widow he sustains,\n\nbut the way of the wicked he thwarts.\n\nThe LORD shall reign forever;\n\nyour God, O Zion, through all generations. Alleluia.\n\nR. Praise the Lord, my soul!\n\nor:\n\nR. Alleluia."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 16:19-31",
              "content": "Jesus said to the Pharisees:\n\"There was a rich man who dressed in purple garments and fine linen\nand dined sumptuously each day.\nAnd lying at his door was a poor man named Lazarus, covered with sores,\nwho would gladly have eaten his fill of the scraps\nthat fell from the rich man's table.\nDogs even used to come and lick his sores.\nWhen the poor man died,\nhe was carried away by angels to the bosom of Abraham.\nThe rich man also died and was buried,\nand from the netherworld, where he was in torment,\nhe raised his eyes and saw Abraham far off\nand Lazarus at his side.\nAnd he cried out, 'Father Abraham, have pity on me.\nSend Lazarus to dip the tip of his finger in water and cool my tongue,\nfor I am suffering torment in these flames.'\nAbraham replied,\n'My child, remember that you received\nwhat was good during your lifetime\nwhile Lazarus likewise received what was bad;\nbut now he is comforted here, whereas you are tormented.\nMoreover, between us and you a great chasm is established\nto prevent anyone from crossing who might wish to go\nfrom our side to yours or from your side to ours.'\nHe said, 'Then I beg you, father,\nsend him to my father's house, for I have five brothers,\nso that he may warn them,\nlest they too come to this place of torment.'\nBut Abraham replied, 'They have Moses and the prophets.\nLet them listen to them.'\nHe said, 'Oh no, father Abraham,\nbut if someone from the dead goes to them, they will repent.'\nThen Abraham said, 'If they will not listen to Moses and the prophets,\nneither will they be persuaded if someone should rise from the dead.'\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-29": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:28:54.925Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-29": {
          "date": "2025-09-29",
          "liturgical_date": "Feast of Saints Michael, Gabriel, and Raphael, Archangels",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Daniel 7:9-10, 13-14",
              "content": "As I watched:\n\nThrones were set up\nand the Ancient One took his throne.\nHis clothing was bright as snow,\nand the hair on his head as white as wool;\nHis throne was flames of fire,\nwith wheels of burning fire.\nA surging stream of fire\nflowed out from where he sat;\nThousands upon thousands were ministering to him,\nand myriads upon myriads attended him.\n\nThe court was convened, and the books were opened.\nAs the visions during the night continued, I saw\n\nOne like a son of man coming,\non the clouds of heaven;\nWhen he reached the Ancient One\nand was presented before him,\nHe received dominion, glory, and kingship;\nnations and peoples of every language serve him.\nHis dominion is an everlasting dominion\nthat shall not be taken away,\nhis kingship shall not be destroyed."
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 138:1-2ab, 2cde-3, 4-5",
              "response": "R. (1) In the sight of the angels I will sing your praises, Lord.",
              "content": "I will give thanks to you, O LORD, with all my heart,\n\nfor you have heard the words of my mouth;\n\nin the presence of the angels I will sing your praise;\n\nI will worship at your holy temple\n\nand give thanks to your name.\n\nR. In the sight of the angels I will sing your praises, Lord.\n\nBecause of your kindness and your truth;\n\nfor you have made great above all things\n\nyour name and your promise.\n\nWhen I called, you answered me;\n\nyou built up strength within me.\n\nR. In the sight of the angels I will sing your praises, Lord.\n\nAll the kings of the earth shall give thanks to you, O LORD\n\nwhen they hear the words of your mouth;\n\nAnd they shall sing of the ways of the LORD\n\n\"Great is the glory of the LORD\n\nR. In the sight of the angels I will sing your praises, Lord."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nBless the LORD, all you angels,\nyou ministers, who do his will.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel John 1:47-51",
              "content": "Jesus saw Nathanael coming toward him and said of him,\n\"Here is a true child of Israel.\nThere is no duplicity in him.\"\nNathanael said to him, \"How do you know me?\"\nJesus answered and said to him,\n\"Before Philip called you, I saw you under the fig tree.\"\nNathanael answered him,\n\"Rabbi, you are the Son of God; you are the King of Israel.\"\nJesus answered and said to him,\n\"Do you believe\nbecause I told you that I saw you under the fig tree?\nYou will see greater things than this.\"\nAnd he said to him, \"Amen, amen, I say to you,\nyou will see heaven opened\nand the angels of God ascending and descending on the Son of Man.\""
            }
          },
          "saint_of_day": {
            "name": null,
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    },
    "2025-09-30": {
      "meta": {
        "version": "1.0",
        "last_updated": "2025-07-22T03:28:55.316Z",
        "source": "bible.usccb.org",
        "liturgical_year": "2025"
      },
      "daily_readings": {
        "2025-09-30": {
          "date": "2025-09-30",
          "liturgical_date": "Memorial of Saint Jerome, Priest and Doctor of the Church",
          "liturgical_color": "white",
          "readings": {
            "first_reading": {
              "citation": "Reading 1 Zechariah 8:20-23",
              "content": "Thus says the LORD of hosts:\nThere shall yet come peoples,\nthe inhabitants of many cities;\nand the inhabitants of one city shall approach those of another,\nand say, \"Come! let us go to implore the favor of the LORD\";\nand, \"I too will go to seek the LORD.\"\nMany peoples and strong nations shall come\nto seek the LORD of hosts in Jerusalem\nand to implore the favor of the LORD.\nThus says the LORD of hosts:\nIn those days ten men of every nationality,\nspeaking different tongues, shall take hold,\nyes, take hold of every Jew by the edge of his garment and say,\n\n\"Let us go with you, for we have heard that God is with you.\""
            },
            "responsorial_psalm": {
              "citation": "Responsorial Psalm Psalm 87:1b-3, 4-5, 6-7",
              "response": "R. (Zec 8:23) God is with us.",
              "content": "His foundation upon the holy mountains\n\nthe LORD loves:\n\nThe gates of Zion,\n\nmore than any dwelling of Jacob.\n\nGlorious things are said of you,\n\nO city of God!\n\nR. God is with us.\n\nI tell of Egypt and Babylon\n\namong those that know the LORD;\n\nOf Philistia, Tyre, Ethiopia:\n\n\"This man was born there.\"\n\nAnd of Zion they shall say:\n\n\"One and all were born in her;\n\nAnd he who has established her\n\nis the Most High LORD.\"\n\nR. God is with us.\n\nThey shall note, when the peoples are enrolled:\n\n\"This man was born there.\"\n\nAnd all shall sing, in their festive dance:\n\n\"My home is within you.\"\n\nR. God is with us."
            },
            "gospel_acclamation": {
              "citation": "Alleluia",
              "content": "R. Alleluia, alleluia.\nThe Son of Man came to serve\nand to give his life as a ransom for many.\nR. Alleluia, alleluia."
            },
            "gospel": {
              "citation": "Gospel Luke 9:51-56",
              "content": "When the days for Jesus to be taken up were fulfilled,\nhe resolutely determined to journey to Jerusalem,\nand he sent messengers ahead of him.\nOn the way they entered a Samaritan village\nto prepare for his reception there,\nbut they would not welcome him\nbecause the destination of his journey was Jerusalem.\nWhen the disciples James and John saw this they asked,\n\"Lord, do you want us to call down fire from heaven\nto consume them?\"\nJesus turned and rebuked them,\nand they journeyed to another village."
            }
          },
          "saint_of_day": {
            "name": "Jerome",
            "short_bio": "Brief biography (Premium feature)",
            "premium_content": true
          }
        }
      }
    }
  }
}